{"status": "OK", "message": "success", "results": [{"content": "Perfect 99 target and strategy!", "parent_id": null, "user": "gorilla", "published": 1322111113839, "downs": 0, "karma": 1, "id": 420358, "ups": 1}, {"content": "Good on you Washingtonians. Thank you for taking it right to the store.", "parent_id": null, "user": "Renee1m", "published": 1322111297101, "downs": 0, "karma": 1, "id": 420369, "ups": 1}, {"content": "Has anybody yet noted that this is a great idea simply because every city has a Walmart? \n\nUp until now, most #occupations have occurred in major urban hubs. Depending on the focus of this operation, it could be a great way to branch out.", "parent_id": null, "user": "adamrains", "published": 1322111558213, "downs": 0, "karma": 1, "id": 420387, "ups": 1}, {"content": "Nope don't boycott local places. Small businesses need revenue.", "parent_id": 417255, "user": "nicck", "published": 1322078679034, "downs": 1, "karma": 1, "id": 417542, "ups": 2}, {"content": "why do they call it Black Friday?\nsounds racist to me\ndoes it mean that it's a sale for blacks?", "parent_id": null, "user": "eyeofthetiger", "published": 1322111754567, "downs": 1, "karma": 0, "id": 420396, "ups": 1}, {"content": "Walmart advertises criminals out in front of their stores, posing for charity, so that they can break in your house later and steal.", "parent_id": null, "user": "BOA", "published": 1322111853444, "downs": 0, "karma": 1, "id": 420401, "ups": 1}, {"content": "Walmart advertises criminals out in front of their stores, posing for charity, so that they can break in your house later and steal. Don't expect any help from the cops or prosecutor - they're paid off.", "parent_id": null, "user": "BOA", "published": 1322111983672, "downs": 0, "karma": 1, "id": 420411, "ups": 1}, {"content": "If you don't think there is a reason to be in this fight, then think about this,,,,,this is  just 1 Family the Rothschild Family, and a current list of the Banks they own world wide look for additions...>\nBank For International Settlements (BIS)\n    Afghanistan: Bank of Afghanistan\n    Albania: Bank of Albania\n    Algeria: Bank of Algeria\n    Argentina: Central Bank of Argentina\n    Armenia: Central Bank of Armenia\n    Aruba: Central Bank of Aruba\n    Australia: Reserve Bank of Australia\n    Austria: Austrian National Bank\n    Azerbaijan: Central Bank of Azerbaijan Republic\n    Bahamas: Central Bank of The Bahamas\n    Bahrain: Central Bank of Bahrain\n    Bangladesh: Bangladesh Bank\n    Barbados: Central Bank of Barbados\n    Belarus: National Bank of the Republic of Belarus\n    Belgium: National Bank of Belgium\n    Belize: Central Bank of Belize\n    Benin: Central Bank of West African States (BCEAO)\n    Bermuda: Bermuda Monetary Authority\n    Bhutan: Royal Monetary Authority of Bhutan\n    Bolivia: Central Bank of Bolivia\n    Bosnia: Central Bank of Bosnia and Herzegovina\n    Botswana: Bank of Botswana\n    Brazil: Central Bank of Brazil\n    Bulgaria: Bulgarian National Bank\n    Burkina Faso: Central Bank of West African States (BCEAO)\n    Burundi: Bank of the Republic of Burundi\n    Cambodia: National Bank of Cambodia\n    Cameroon: Bank of Central African States\n    Canada: Bank of Canada – Banque du Canada\n    Cayman Islands: Cayman Islands Monetary Authority\n    Central African Republic: Bank of Central African States\n    Chad: Bank of Central African States\n    Chile: Central Bank of Chile\n    China: The People’s Bank of China\n    Colombia: Bank of the Republic\n    Comoros: Central Bank of Comoros\n    Congo: Bank of Central African States\n    Costa Rica: Central Bank of Costa Rica\n    Côte d’Ivoire: Central Bank of West African States (BCEAO)\n    Croatia: Croatian National Bank", "parent_id": null, "user": "xAnonymousx", "published": 1322112195093, "downs": 0, "karma": 1, "id": 420429, "ups": 1}, {"content": "Ows= jealous english lit flunky", "parent_id": null, "user": "Wallst4eva", "published": 1322111077675, "downs": 0, "karma": 1, "id": 420355, "ups": 1}, {"content": "Cuba: Central Bank of Cuba\n    Cyprus: Central Bank of Cyprus\n    Czech Republic: Czech National Bank\n    Denmark: National Bank of Denmark\n    Dominican Republic: Central Bank of the Dominican Republic\n    East Caribbean area: Eastern Caribbean Central Bank\n    Ecuador: Central Bank of Ecuador\n    Egypt: Central Bank of Egypt\n    El Salvador: Central Reserve Bank of El Salvador\n    Equatorial Guinea: Bank of Central African States\n    Estonia: Bank of Estonia\n    Ethiopia: National Bank of Ethiopia\n    European Union: European Central Bank\n    Fiji: Reserve Bank of Fiji\n    Finland: Bank of Finland\n    France: Bank of France\n    Gabon: Bank of Central African States\n    The Gambia: Central Bank of The Gambia\n    Georgia: National Bank of Georgia\n    Germany: Deutsche Bundesbank\n    Ghana: Bank of Ghana\n    Greece: Bank of Greece\n    Guatemala: Bank of Guatemala\n    Guinea Bissau: Central Bank of West African States (BCEAO)\n    Guyana: Bank of Guyana\n    Haiti: Central Bank of Haiti\n    Honduras: Central Bank of Honduras\n    Hong Kong: Hong Kong Monetary Authority\n    Hungary: Magyar Nemzeti Bank\n    Iceland: Central Bank of Iceland\n    India: Reserve Bank of India\n    Indonesia: Bank Indonesia\n    Iran: The Central Bank of the Islamic Republic of Iran\n    Iraq: Central Bank of Iraq\n    Ireland: Central Bank and Financial Services Authority of Ireland\n    Israel: Bank of Israel\n    Italy: Bank of Italy\n    Jamaica: Bank of Jamaica\n    Japan: Bank of Japan\n    Jordan: Central Bank of Jordan\n    Kazakhstan: National Bank of Kazakhstan\n    Kenya: Central Bank of Kenya\n    Korea: Bank of Korea\n    Kuwait: Central Bank of Kuwait\n    Kyrgyzstan: National Bank of the Kyrgyz Republic\n    Latvia: Bank of Latvia\n    Lebanon: Central Bank of Lebanon\n    Lesotho: Central Bank of Lesotho\n    Libya: Central Bank of Libya\n    Lithuania: Bank of Lithuania\n    Luxembourg: Central Bank of Luxembourg\n    Macao: Monetary Authority of Macao\n    Macedonia: National Bank of the Republic of Macedonia\n    Madagascar: Central Bank of Madagascar\n    Malawi: Reserve Bank of Malawi\n    Malaysia: Central Bank of Malaysia\n    Mali: Central Bank of West African States (BCEAO)\n    Malta: Central Bank of Malta\n    Mauritius: Bank of Mauritius\n    Mexico: Bank of Mexico\n    Moldova: National Bank of Moldova\n    Mongolia: Bank of Mongolia\n    Montenegro: Central Bank of Montenegro\n    Morocco: Bank of Morocco\n    Mozambique: Bank of Mozambique\n    Namibia: Bank of Namibia\n    Nepal: Central Bank of Nepal\n    Netherlands: Netherlands Bank\n    Netherlands Antilles: Bank of the Netherlands Antilles\n    New Zealand: Reserve Bank of New Zealand\n    Nicaragua: Central Bank of Nicaragua\n    Niger: Central Bank of West African States (BCEAO)\n    Nigeria: Central Bank of Nigeria\n    Norway: Central Bank of Norway\n    Oman: Central Bank of Oman\n    Pakistan: State Bank of Pakistan\n    Papua New Guinea: Bank of Papua New Guinea\n    Paraguay: Central Bank of Paraguay\n    Peru: Central Reserve Bank of Peru\n    Philippines: Bangko Sentral ng Pilipinas\n    Poland: National Bank of Poland\n    Portugal: Bank of Portugal\n    Qatar: Qatar Central Bank\n    Romania: National Bank of Romania\n    Russia: Central Bank of Russia\n    Rwanda: National Bank of Rwanda\n    San Marino: Central Bank of the Republic of San Marino\n    Samoa: Central Bank of Samoa\n    Saudi Arabia: Saudi Arabian Monetary Agency\n    Senegal: Central Bank of West African States (BCEAO)\n    Serbia: National Bank of Serbia\n    Seychelles: Central Bank of Seychelles\n    Sierra Leone: Bank of Sierra Leone\n    Singapore: Monetary Authority of Singapore\n    Slovakia: National Bank of Slovakia\n    Slovenia: Bank of Slovenia\n    Solomon Islands: Central Bank of Solomon Islands\n    South Africa: South African Reserve Bank\n    Spain: Bank of Spain\n    Sri Lanka: Central Bank of Sri Lanka\n    Sudan: Bank of Sudan\n    Surinam: Central Bank of Suriname\n    Swaziland: The Central Bank of Swaziland\n    Sweden: Sveriges Riksbank\n    Switzerland: Swiss National Bank\n    Tajikistan: National Bank of Tajikistan\n    Tanzania: Bank of Tanzania\n    Thailand: Bank of Thailand\n    Togo: Central Bank of West African States (BCEAO)\n    Tonga: National Reserve Bank of Tonga\n    Trinidad and Tobago: Central Bank of Trinidad and Tobago\n    Tunisia: Central Bank of Tunisia\n    Turkey: Central Bank of the Republic of Turkey\n    Uganda: Bank of Uganda\n    Ukraine: National Bank of Ukraine\n    United Arab Emirates: Central Bank of United Arab Emirates\n    United Kingdom: Bank of England\n    United States: The Dirty Nasty Stinky Fed, Federal Reserve Bank of New York\n    Uruguay: Central Bank of Uruguay\n    Vanuatu: Reserve Bank of Vanuatu\n    Venezuela: Central Bank of Venezuela\n    Vietnam: The State Bank of Vietnam\n    Yemen: Central Bank of Yemen\n    Zambia: Bank of Zambia\n    Zimbabwe: Reserve Bank of Zimbabwe", "parent_id": 420429, "user": "xAnonymousx", "published": 1322112335119, "downs": 0, "karma": 1, "id": 420440, "ups": 1}, {"content": "Why We Shouldn't Celebrate Thanksgiving\nThanksgiving Day should be turned into a National Day of Atonement to acknowledge the genocide of America's indigenous peoples. \nhttp://www.alternet.org/story/68170/", "parent_id": null, "user": "Geranimo", "published": 1322112516746, "downs": 0, "karma": 2, "id": 420459, "ups": 2}, {"content": "The outrageously high \"compensation\" that top executives steal from corporate funds disillusion anyone that is actually working to increase the corporate funds. Furthermore, the greed of these top few is such an overriding principal of their behavior, they see contribution to the common welfare a burden instead of a responsibility. The 99% tax  income tax bracket should be reinstated for all income over the average workers' lifetime income..", "parent_id": null, "user": "gjpc", "published": 1322112636347, "downs": 0, "karma": 2, "id": 420468, "ups": 2}, {"content": "Might I just ask you Potential OWS members 1 question\n\n                          How many Banks does your family own ?\n\n                                                                    Anonymous", "parent_id": 420440, "user": "xAnonymousx", "published": 1322112821198, "downs": 0, "karma": 1, "id": 420477, "ups": 1}, {"content": "I have to agree with you the the government should have no say into how a business is structured or how it runs it's day to day operations.  By the same token corporations have no business influencing our representatives....  they should not be able to contribute the obscene amounts of money to political campaigns.  Corporations should not have a more powerful voice in our governments decision making than the citizens do.  I also believe that when a business such as Walmart is a  major cause for our lack of a manufacturing base then something needs to be done.  And let's face it Walmart doesn't exactly have a reputation that gives me any reason to support what it does.\n\nTheir product is sub standard, their rate of pay is lousy, they definitely are one Corporation I would mind seeing regulated right out of business.", "parent_id": 417246, "user": "sinead", "published": 1322094579540, "downs": 4, "karma": 2, "id": 419090, "ups": 6}, {"content": "I imagine how much better communities would be were it not for the development of Wal-Mart, a company that began by pretending to be an \"all American made\" company.  We do not need these stores, as they do not alleviate budget pressures, they rely on poverty to stay in business. The ills of Wal-Mart have been so widely documented and it is a surprise that they have not been put out of business. The reason is that they are one of the three major employers in the U.S....along with the USPS and the US Military.  Too many people are feeding off of the system.", "parent_id": null, "user": "tsdevi", "published": 1322102049613, "downs": 0, "karma": 2, "id": 419689, "ups": 2}, {"content": "NY City has refused to allow Walmart to open a store here. Therefore, New Yorkers drive just over the border to Long Island, to Westchester and elsewhere to shop at Walmart. \n\nThose consumers spend their money outside the city, which means the city council was doubly dumb. \n\nMeanwhile, there are literally thousands of 99-cent stores in NY City. They sell true junk. But Walmart sells good stuff at low prices.", "parent_id": null, "user": "noslappz", "published": 1322079498635, "downs": 0, "karma": 1, "id": 417607, "ups": 1}, {"content": "u just stole my comment. who r u to censor me? proves u r not the 99%.", "parent_id": null, "user": "axi2011", "published": 1322113559893, "downs": 0, "karma": 1, "id": 420537, "ups": 1}, {"content": "Quite a few for sure, in Richmond (a southern suburb) you can't even read the signs; but I like the non-corporate model, you can still buy bottled milk at the local grocer by my friends place. Hastings st. Is lined with small artsy shops, and you can get a big plastic container of grapes for like $1.25 at the tiny Asian markets.\n\nI'm not sure about Alco, in fairness it appears that whatever steps were taken after the re-financing worked out quite well; but we're still dealing with a company that is over 100 years old, already had a number of buildings, capital assets, staff, and a distribution system; then had a large infusion of capital, that was my point. \n\nIt's a different situation than Average Joe attempting to go to a bank in 2011 to loan acquire a multi-million dollar loan to start a big box retain chain (a notoriously difficult racket to make a profit in at the best of times).\n\nWalmart competes on a low-cost model, and it is amazingly efficient. Businesses competing on a high service/value added model stand a chance; businesses with established locations and brand equity also stand a chance; its theoretically possible I suppose to start up a new retail chain and compete on cost, but it would take a serious business plan, serious capital, and a level of expertise that most people in America simply don't have... and on top of that a better economic outlook, and some good luck; and it certainly would not happen overnight.", "parent_id": 418372, "user": "alexrai", "published": 1322113482785, "downs": 0, "karma": 1, "id": 420527, "ups": 1}, {"content": "But he just showed you that neither he or his dad borrowed money from a bank.  Neither did I when I started my business.  In fact, I believe it is the norm to \"bootstrap fund\" a small business startup.", "parent_id": 419514, "user": "FreeMarkets", "published": 1322102410393, "downs": 0, "karma": 1, "id": 419712, "ups": 1}, {"content": "Yes, I can and I have already answered your question.  It amounts to 1/2 of one cent for every time you walk into WalMart.  You go once a week, you would be off setting ONLY 1/2 or 1cent of that donations.  \n\nAnd you expect to give how much of a raise to 1.2 million workers at WalMart.", "parent_id": 417104, "user": "ronjj", "published": 1322199761764, "downs": 0, "karma": 1, "id": 424825, "ups": 1}, {"content": "A song for OWS... http://www.youtube.com/watch?v=4FM3KR9dEOk", "parent_id": null, "user": "OWSMusic", "published": 1322199959428, "downs": 0, "karma": 1, "id": 424838, "ups": 1}, {"content": "No, you didn't\n\nShort attention span I guess.\n\n\nUnion, YES!", "parent_id": 418338, "user": "shooz", "published": 1322090432152, "downs": 0, "karma": 1, "id": 418701, "ups": 1}, {"content": "u just stole my comment. who r u to censor me? proves u r not the 99%.", "parent_id": null, "user": "axi2011", "published": 1322113980349, "downs": 0, "karma": 1, "id": 420567, "ups": 1}, {"content": "THIS should serve as an alert to all of you who are very involved in this WalMart protest, as important as you think it might be:\n\nOur most trusted neighbor country has been seeking a pipeline route to provide oil to refineries in the United States  What was our answer??\n\n01.  No, it might harm Nebraska\n02.  No, it might harm Utah\n03.  No, lets' discuss it for two years (Obama)\n\nTODAY, that  problem was solved.  \n\n01.  China will take it.\n\nAnd somehow in our way of reasoning - WalMart is our biggest problem.  Fiddle all you want - Rome is burning and I really don't think that anyone on these posts fully understands or cares beyond their own agendas. \n\nProtest WalMart and their imported trinkets all you want.  China just walked right past you and took one of the most valuable assets that was ever offered to the USA.", "parent_id": null, "user": "ronjj", "published": 1322200477430, "downs": 0, "karma": 1, "id": 424872, "ups": 1}, {"content": "Love you too.\n\nSo you only recognize one way to increase profits, right??  Do you make any distinction regarding, same store sales, gross profit on sales, total gross profit including added sources of sales (additional stores), etc.\n\nIf you had your facts before you, I bet that you would find that WalMart is making the same profit that they did when Sam had one store - probably a lot less actually.  Now think about what kind of profit you are talking about.\n\nIf I sell one of my beautiful handcrafted toe rings for $50.00 this year and expand next year to sell 2 for $100.00 can you relate to profit in this context.  And yes, I may try to get my German nickel silver that you think if the real thing a little cheaper in China, but what if I maintain the same profit margin and reduce my price to 2 for $90.00. \n\nMost of the posts on here are so off base that nothing is really obvious.", "parent_id": 417583, "user": "ronjj", "published": 1322084331256, "downs": 0, "karma": 2, "id": 418058, "ups": 2}, {"content": "On thinking about what I just read, a cashier ought to be paid higher, simply because of more responsibility handling money. My mistake in thought, thinking too deeply, I guess, but I still hold firm to the idea that reorganizing a business with a desire to break up the division of labor helps combat this line of thought.", "parent_id": 417634, "user": "aeturnus", "published": 1322080060237, "downs": 0, "karma": 1, "id": 417652, "ups": 1}, {"content": "So you aren't just living off your $29k a year.\nso what was the point of your argument?", "parent_id": 419869, "user": "HarryPairatestes2", "published": 1322114865484, "downs": 0, "karma": 1, "id": 420628, "ups": 1}, {"content": "Bwahahaha good one. Occupy WallMart. Cliche' much? You think these poor underpaid workers get trodden on enough already, but noooooo, now OWS is there to finish off the job and make sure they lose their jobs by blocking WallMart customers and staff alike. Brilliant as usual OWS. I'm sure you can alienate every last member of the 99% if you keep going the way you are going.", "parent_id": null, "user": "Jimmy44", "published": 1322115085845, "downs": 2, "karma": 1, "id": 420641, "ups": 3}, {"content": "Sounds like you own a company that resells stuff you buy from Walley World. If I had the name of it I would boycott you too. :)", "parent_id": 418506, "user": "USCitizenVoter", "published": 1322090765971, "downs": 0, "karma": 1, "id": 418722, "ups": 1}, {"content": "u just stole my comment. who r u to censor me? proves u r not the 99%.", "parent_id": null, "user": "axi2011", "published": 1322115133808, "downs": 0, "karma": 1, "id": 420646, "ups": 1}, {"content": "I can't imagine that Canada is that upset or ever surprised.  The oil from Canada has to be super refined.  Which means that the oil companies here would not make much money on it.  Since we all know corporations run this country, its all about the bottom line.  They did not think it was worthwhile to engage in a huge environmental battle for such a small profit.  Anyway that is what I heard, I could be wrong.", "parent_id": 424872, "user": "ithink", "published": 1322201826272, "downs": 0, "karma": 1, "id": 424926, "ups": 1}, {"content": "I love this movement. I used to work for walmart in Oklahoma city. They treated us like crapp. Didn't pay well. Many people I worked with were on food stamps because walmart just did not pay them enough to live on. It is just crazy how they treat there slaves. I will not be shopping there at all this Xmas season due to be out of work for 2 years. This is the longest I have ever been without a job. It sucks can't pay bills.", "parent_id": null, "user": "Cjoy77", "published": 1322090833527, "downs": 0, "karma": 1, "id": 418730, "ups": 1}, {"content": "ps.  Kill walmart", "parent_id": 424872, "user": "ithink", "published": 1322201947097, "downs": 0, "karma": 1, "id": 424931, "ups": 1}, {"content": "this thread makes my head hurt. if u guys want everyone equal sounds more like communism. grow up and stop crying about CEOs. get out there and start your own company and \"run it right\" then see how hard it is to keep shareholders happy and profits constantly growing.  A bunch of unemployed, overeducated morons in here. lol.  But that's fine, you all just make me look that much smarter in the real world and I'm able to have a more successful career because of it.", "parent_id": 417558, "user": "LarsBorsch", "published": 1322080935686, "downs": 0, "karma": 1, "id": 417721, "ups": 1}, {"content": "They are forced to work somewhere.", "parent_id": 424508, "user": "sfsteve", "published": 1322203042167, "downs": 0, "karma": 1, "id": 424976, "ups": 1}, {"content": "I never included small business. The big boxes intent is to run the the small business OUT of business,by opening on TG and black friday at midnight. If you can't see that, we're in big trouble. Its called Monopoly!", "parent_id": 417542, "user": "MiMi1026", "published": 1322104028996, "downs": 0, "karma": 1, "id": 419816, "ups": 1}, {"content": "Never should corporations control government but we see it constantly with campaing contributions.  I disagree with your statement that government should not interfer with business and that we need less government.  Less government is what got us in this economic downward spiral.  It is what allowed companies to ship more  and more jobs overseas and allowed companies to take advantage of their workers.  Less government is not the answer! A change in the way government is run is the absolute answer.  The United States Constitution clearly states that our government is for the people by the people.  The only problem is that once as we exercise our vote on who we want to lead this country, our power is gone.  We have politicians presenting bills in congress of their own accord, reallly prompted by their campaing contributions.  Take for example Obamas Jobs bill.  Somethins needs to be done.  There is a majority in favor of the bill across the country but still congress votes no with the majority.  Our government is no longer for the people by the people.  Its more along the lines for the wealthy by the wealthy at the expense of everyone not in the top one percent.", "parent_id": 417246, "user": "buddazjade", "published": 1322102657064, "downs": 0, "karma": 1, "id": 419725, "ups": 1}, {"content": "Aside from the fact that WalMart is notorious for its union-busting practices, it is also in the business of making it very hard for other businesses to compete. It is an economic problem on a large scale. When WalMart comes to a town, wages tend to drop. Other business are forced to pay less to compete. That is an extremist position.\n\nA firm becomes a terrible place to work if they decide to make you pay for your health care. Forcing a person to pay for health care while up to his head in medical bills is an extremist position for any corporation to undertake.\n\nYou do not have to be directly violent to take an extremist position. In some cases, an extremist position might be good if it benefits most. In this case, it doesn't. WalMart does what it does out of self-interest. The workers do what they do to survive. There are always going to be far more workers than there are managers and CEOs, and it is to those individuals that I lend my support.", "parent_id": 417639, "user": "aeturnus", "published": 1322081235882, "downs": 0, "karma": 3, "id": 417747, "ups": 3}, {"content": "Pls organize one week minimum of Dont Buy At Walmart and repeat monthly until Walmart goes bust. Time to end this monster!", "parent_id": null, "user": "Misenka141957", "published": 1322116852065, "downs": 0, "karma": 1, "id": 420749, "ups": 1}, {"content": "this is true. I knew a few wally world employees who were on subsidized housing and medicaid.", "parent_id": 418560, "user": "MiMi1026", "published": 1322104539221, "downs": 0, "karma": 1, "id": 419852, "ups": 1}, {"content": "Seriously. Where?", "parent_id": 418638, "user": "gladyg", "published": 1322091193584, "downs": 0, "karma": 1, "id": 418768, "ups": 1}, {"content": "They really should change the Wal Mart cheer.\nGive me an O, give me a V, Give me an E, Give me an R, Give me a W, Give me an O, Give me an R, Give me a K, Give me an E, Give me a D. Give me a squiggly. Give me a U, Give me an N, Give me a D, Give me an E, Give me an R, Give me a P, Give me an A, Give me an I, Give me a D--Whats that spell????\n\nOverworked & Underpaid   YEA!!!!!!!", "parent_id": null, "user": "Justice4all", "published": 1322091223704, "downs": 0, "karma": 1, "id": 418773, "ups": 1}, {"content": "But that is based on total family income.  If a parent is absent from the scene, there are Xnumber of children in the family, etc, your claim may be true.  It is also true if no one in the family works at WalMart.  Does this apply to McDonalds too? What is the bigger picture that you are typing to make a point about.", "parent_id": 418560, "user": "ronjj", "published": 1322091232236, "downs": 1, "karma": 0, "id": 418775, "ups": 1}, {"content": "If it was easy, why don't the average joe do it?\nAlso, The CEO in a company like Walmart works almost 24/7. The guy who mops the floor could give a crap (ive been there). while the CEO may not appear to work harder, they have to take in more information and process it the best they can.", "parent_id": 417148, "user": "jdnreha", "published": 1322091257431, "downs": 0, "karma": 1, "id": 418777, "ups": 1}, {"content": "Keep up the great work!", "parent_id": null, "user": "BreadLandPeace", "published": 1322117335434, "downs": 0, "karma": 1, "id": 420775, "ups": 1}, {"content": "There's a bit of a troll problem, but I encourage you to ignore all the profanity laced attacks and look for constructive conversation.  It's always good to have another pair of eyes and a good brain to discuss ideas, welcome aboard!", "parent_id": 417425, "user": "vnayar", "published": 1322081717925, "downs": 1, "karma": 0, "id": 417779, "ups": 1}, {"content": "OK. Let's raise the minimum wage and then all start paying equally higher prices on all items that we purchase, making our minimum wage increase a total wash. Genius idea.", "parent_id": 417447, "user": "occupyyourself85", "published": 1322079739004, "downs": 1, "karma": 2, "id": 417625, "ups": 3}, {"content": "You're right.  But as a former small store owner it's difficult to even come close to being able to offer the same prices the big box stores do, they just don't have the same buying power, so they can't purchase their products for resale at the price Walmart, or Target etc... can.   I don't think there are very many of them that deliberately set out to \"rip off the poor\".\n\nI also asked the protesters to be kind to the people that go into Walmart   that they are protesting....  I'm sure if they could afford to go elsewhere they would.", "parent_id": 419120, "user": "sinead", "published": 1322099556542, "downs": 0, "karma": 3, "id": 419489, "ups": 3}, {"content": "An Idea that i have set in Motion, http://www.youtube.com/watch?v=gryco23SQlU Can You Commit to it? Spread it if you can, My family agreed.", "parent_id": null, "user": "Fiction", "published": 1322117586279, "downs": 0, "karma": 1, "id": 420794, "ups": 1}, {"content": "I didn't say people shop at Wal-Mart because they are \"stupid\".  I repeat that I don't think people understand the real costs (environmental, economic, existential) of shopping there.  None of us really know those costs in absolute terms, so I think it's a stretch to imagine a \"net\" calculation going on for anyone.  Most people simple \"go to store\" without asking these questions or doing any calculations whatsoever.", "parent_id": 423950, "user": "beamerbikeclub", "published": 1322204818217, "downs": 0, "karma": 1, "id": 425059, "ups": 1}, {"content": "No he does have a choice and he did make choices that proved unwise. having a kid before you can afford to care for the kid is a problem. he can go to school but not full time. he can go to a junior college and take courses online. His fiancee can work at Wal-Mart, they always seem to be hiring (I know it's like going to the devil for help).\n\nBut should salary be based on individual needs? If he didn't have a kid or an unemployed fiancee living with him, should he then not qualify for higher pay?", "parent_id": 418105, "user": "HarryPairatestes2", "published": 1322086877716, "downs": 0, "karma": 2, "id": 418332, "ups": 2}, {"content": "We really need to overhaul the minimum wage rules. It ws estimated an average family would need to make $22 per hour just to have the basics, and that's assuming their employer paid for health insurance! Walmart bragged about using solar and wind power, even though only 2 percent of their energy comes that way. I so agree with this boycott.", "parent_id": null, "user": "OccupyforEarth", "published": 1322082358581, "downs": 0, "karma": 2, "id": 417827, "ups": 2}, {"content": "Why are they not occupying at the height of the Black Friday madness that starts Thanksgiving night?  I live near this Walmart and it is mostly poor people from a diverse ethnic background that shop there.  They shop there to make ends meet.  That said, I think it's a great statement and I may just drop by...", "parent_id": null, "user": "LisaB303", "published": 1322206498059, "downs": 0, "karma": 1, "id": 425119, "ups": 1}, {"content": "Yeah, call for help USCitizenVoter, you got a troll trapped in your net of absurdity.  And no one have has the courtesy to explain what a \"troll\" is even through I have asked several times.\n\nI happen to have things to say that a I think might challenge some on here to think deeper and to reason more about their stances on a number of topics.  You will find that in most of my posts, I do not call names such as you do, nor do I try to shut down the flow in information and discussion like you do.\n\nSorry I made you mess your pants.  Take time out and clean up.", "parent_id": 418604, "user": "ronjj", "published": 1322090098570, "downs": 1, "karma": 1, "id": 418671, "ups": 2}, {"content": "I hate Walmart. Unfortunately, I have to still go there because I can get more food for less money and the money is really tight in our home right now.  The walmart in my town is open all day tomorrow, so the workers get no break whatsoever.", "parent_id": null, "user": "southernwoman", "published": 1322077849881, "downs": 2, "karma": 0, "id": 417455, "ups": 2}, {"content": "Kind of like the unions standing with you?  How they take union dues and give money to the DNC?  (lobbying?)   What is the difference?  It adds up to millions of bucks.  I think that if you post here you are required to have a brain.", "parent_id": 417104, "user": "mandodod", "published": 1322082782708, "downs": 3, "karma": -2, "id": 417866, "ups": 1}, {"content": "So the description \"slavery\" doesn't really apply at all, does it? Slaves can't choose where to work.", "parent_id": 424976, "user": "AuditElmerFudd", "published": 1322207194728, "downs": 0, "karma": 1, "id": 425160, "ups": 1}, {"content": "I would love to know what Walmart you shop at? I know people who work there and they would be thrilled to make 10 dollars an hour.  Granted wages differ based on location and the cost of living in the area the business is located.  So businesses located in a higher cost area inherently pay more (common sense).  In all actuality the \"10 dollars\" an hour made in higher living areas really equates to minimum wage or slightly over.  \n\nEven at just below 20k a year a person still cannot afford their basic necessities.  These basic necessities have changed over time but they include houseing, food, utilities, medical/dental/vision, car and auto insurance.  At bare minimum these things cost 1700 dollars a month.  That comes out to 400 dollars over 20k.  So I am extremely confused why you are supporting my arguments for me? I appreciate it!\n\nThe assumption I am making is that any person, in any job, should make enough money to take care of them selves.  I never said that a store clerk should make high wages, but no person should ever have to slave 40 hours a week, every week, get paid nothing, have no benefits and still have to struggle to pay their bills and provide for them selves.  That is greedy business people thinking they are better than the average person because they came up with a great idea.  They are no better than anyone else.  People who started with nothing and build a million or billion dollar empire should do well to remember where they came from.  The problem is that a lot of people with money are born into it and have no idea what it is to budget, go without, go hungry so your kids can eat.  The practice of using and abusing the average work is inhumane and crule.  In fact I would even go so far to say that the practices are unconstitutional.  We as American citizens are guaranteed the right to life, liberty and the persuit of happiness.  What businesses are doing are denying people the right to live (and not in the literal sense so come back with something stupid).   \n\nAs for your oh so poetic comments on the salary of a CEO.  I never said the money taken away from CEOs or stock holders had to only translate into an hourly increase. It could be used toward improving aspect of the company that involve everyone, for example, better insurance, offering sick time and vaction pay, holiday bonuses etc.  If we are talking about putting back money into the company, then there are plenty of share holders, besides the CEO, who make a great deal of money.  They can take pay cuts also.  Which will certainly privide more money.  Lets not forget all the tax breaks businesses get from the government.  There is more than enough money for businesses to pay more, provide better benefits, and create more jobs.  So please stop making it sound like Walmart and other companies are so victimized and are doing us such a great service because they simply provide work.  I'm sorry but I need more, I expect more from American business.", "parent_id": 419761, "user": "buddazjade", "published": 1322121310593, "downs": 0, "karma": 1, "id": 420981, "ups": 1}, {"content": "So if I have one employee as a clerk in my store I have to pay them $46,000 a year even if I am not making enough to pay myself that salary?  How does that make sense and how does that increase job availability for small businesses?", "parent_id": 417848, "user": "HarryPairatestes2", "published": 1322083172575, "downs": 0, "karma": 2, "id": 417903, "ups": 2}, {"content": "Im sorry to be the one to tell you this but Republicans are never the answer.  After Reagan and Two Bush's I would think that would be pretty obvious.  If you support the wealthy 1 percent getting richer while the middle class and lower class just get poorer, well I guess Mitt Romney is the choice for you.", "parent_id": 418440, "user": "buddazjade", "published": 1322121576660, "downs": 0, "karma": 1, "id": 420989, "ups": 1}, {"content": "Amazon.com is not a more ethical alternative.\n\nhttp://blog.seattlepi.com/trevorgriffey/2011/04/03/top-10-reasons-to-avoid-amazon-com/\n\nhttp://www.mcall.com/news/local/amazon/", "parent_id": null, "user": "nichole", "published": 1322121664365, "downs": 0, "karma": 1, "id": 420996, "ups": 1}, {"content": "Millionaire's tax?", "parent_id": 417668, "user": "HarryPairatestes2", "published": 1322083293038, "downs": 0, "karma": 1, "id": 417918, "ups": 1}, {"content": "If you don’t care for unpleasant truths, now is your last chance to turn away.  People have been saying the world is experiencing a great awakening- and I just got a glimpse of what that really means.  \n\nLook for yourself if you dare.  Read “Awakening To the Nightmare” at www.josephcouture.com", "parent_id": 417104, "user": "JosephCouture", "published": 1322079824878, "downs": 0, "karma": 2, "id": 417629, "ups": 2}, {"content": "", "parent_id": 417458, "user": "anonymous", "published": 1322083421428, "downs": 0, "karma": 1, "id": 417930, "ups": 1}, {"content": "Employees should have some sort of say, since they are the ones doing a lot of the work. For some reason, people have this idea that the employees must be slaves and must do what they are told without questioning anything. This is completely unfair. Employer/employee relationships are two-way streets... not one-way streets. It's wise for the employer to listen to its employees anyway. If the employees are unhappy (because of being treated unfairly), what kind of production will they accomplish?", "parent_id": 418721, "user": "SwissMiss", "published": 1322122457463, "downs": 0, "karma": 2, "id": 421025, "ups": 2}, {"content": "This is an excellent idea.", "parent_id": null, "user": "professorzed", "published": 1322079841032, "downs": 1, "karma": 1, "id": 417632, "ups": 2}, {"content": "And the company ought to be reorganized such that a person stocking items is also in charge of a few other things, allowing him more say in the overall activities of the organization. If that were to happen, then how much he is paid an hour ought to be higher.\n\nSecondly, a stock boy is considerably even more boring and rote than a cashier, so a cashier ought to be paid lower. Again, though, reorganizing a business with a desire to break up the division of labor helps combat this line of thought.", "parent_id": 417139, "user": "aeturnus", "published": 1322079861089, "downs": 0, "karma": 1, "id": 417634, "ups": 1}, {"content": "Places like Trader Joe's and Whole Foods are very hard to get into. Why? It's because they treat their employees well and give them decent pay and benefits. They have very low turnover. My mom has been trying to get into them in this area for 3 years. It's not rocket science trying to figure out how to keep employees happy and loyal. You certainly can't treat them like shit and then expect loyalty.", "parent_id": 418453, "user": "SwissMiss", "published": 1322122731726, "downs": 0, "karma": 1, "id": 421039, "ups": 1}, {"content": "Exactly. Private enterprise has recieved massive taxpayer bailouts and subsidies from the government for a long time f.ex. Lots of cash earned by hard working people has been  given to private business to keep it viable. Just because something is now private property by law doesnt necessarily make it right nor unchangable.\n\nhttp://struggleforfreedom.blogg.no/", "parent_id": 418426, "user": "struggleforfreedom80", "published": 1322089237794, "downs": 0, "karma": 2, "id": 418590, "ups": 2}, {"content": "Corporations are corrupt.  You have it backwards.\n\nRepublicans help them a lot.\n\nDue to a bill Bush signed, just as he left office, the USPS has to suddenly fully fund it's pensions out 75 years in advance. \n\nThat was while the economy was crashing and burning.\n\nHe was still in for a bit of union busting.\nI wonder who paid for that bill?\n\nOh, yeah!  We did!\n\n\nNo unions ever got anywhere near that in it's contract.\n\nNow, couple that fact, with all the anti-union marketing/PR you've been listening to.  Stuff from those corporate sponsored marketing/PR firms.\n\nRush gets paid by them for almost everything he says. Every idea he puts out there.\n\nNow, tell me again, how unions aren't part of the 99%?", "parent_id": 419226, "user": "shooz", "published": 1322096969331, "downs": 0, "karma": 3, "id": 419279, "ups": 3}, {"content": "Everyone knows the political and economic systems are broken. Is some kind of new paradigm possible? This video begins that discussion. See if it causes you to think about what you have been taught is right. A crisis is a good time to re-evaluate basic assumptions. Reality trumps any ideology conservative or liberal. \n\nhttp://tinyurl.com/5swbwzz", "parent_id": 417449, "user": "dealdoctor", "published": 1322079839492, "downs": 0, "karma": 1, "id": 417631, "ups": 1}, {"content": "No comment on the republican plot?\n\nI don't believe in coincidence.\n\nYou do.\n\n\nYou're corrupt.\n\nPlainer and simpler.", "parent_id": 419357, "user": "shooz", "published": 1322098265745, "downs": 0, "karma": 3, "id": 419385, "ups": 3}, {"content": "They don't get paid a ton.", "parent_id": 419417, "user": "SwissMiss", "published": 1322123214473, "downs": 0, "karma": 1, "id": 421060, "ups": 1}, {"content": "And I would like to answer something for you.... While we banter back and forth here...  dividing up Wal-Marts billions of revenue and increased profits generated by corporate brutality on its employees, the environment, and other businesses, corporations like this are undermining our entire political system and democracy. The representatives that you and I vote into office are being bought and sold to the highest bidder. There is no spin or slant on that fact. You have been sold out by this corporation and your own government ronjj.... and you apparently don't even know it. Man they got you good...", "parent_id": 417219, "user": "xxcONScIENcExx", "published": 1322076778116, "downs": 0, "karma": 4, "id": 417342, "ups": 4}, {"content": "Agreed.", "parent_id": 417221, "user": "SwissMiss", "published": 1322123381513, "downs": 0, "karma": 1, "id": 421065, "ups": 1}, {"content": "Three decades ago that CEO has 350,000 employees under his sphere of responsibility.  Today he has 1.2 million  Is your salary the same as it was the day you started work?? Has your responsibilities increased by the same ratio as that of the CEO.  If it comes out that he/she is underpaid according to the ratio you work out, just don't say anything more.  OK?  I'll not bring it up again.", "parent_id": 417584, "user": "ronjj", "published": 1322083828285, "downs": 1, "karma": 0, "id": 417985, "ups": 1}, {"content": "If you can't afford to pay yourself $46,000 a year, then maybe you shouldn't be in business.", "parent_id": 417903, "user": "SwissMiss", "published": 1322123509596, "downs": 1, "karma": 1, "id": 421068, "ups": 2}, {"content": "Are you saying that if someone is married, they don't deserve to make a decent wage, just because of being married and their spouse makes more money than they do?", "parent_id": 420628, "user": "SwissMiss", "published": 1322123653283, "downs": 0, "karma": 1, "id": 421075, "ups": 1}, {"content": "Get 100 people to stand in each checkout lane and buy the cheapest item (say a pack of Ramen or some sort of loose produce). Then exit store, re-enter and repeat during store hours, then finally get a refund at the customer service desk. Spend as much time at the checkout as possible, by paying with a check or pennies for instance. The long lines may cause a dip in sales of other items and cause customers to shop at another store. All of this being completely within the rights as a \"consumer\"", "parent_id": null, "user": "JIMINRDU", "published": 1322123806209, "downs": 0, "karma": 1, "id": 421081, "ups": 1}, {"content": "So because they choose to not improve their situation in life they should be paid more then their job is worth?\n\nMy brother in law's job is a parking lot attendant at a local horse racing track. He has had this job for over 20 years. He makes $30k a year. During the 8 hours he works all he does is sit in a booth watching TV (he works at night and is the person to let in horse trainers to the stalls). he has never done anything to improve his position at the track or in life. yet you believe he should be rewarded for his choices.\n\nDuring the same period of time his wife went from being a receptionist at a real estate office to becoming a successful real estate agent earning over a $150k a year, even during the real estate downturn. She studied, took classes, passed tests and did what it took to not be on the bottom of the ladder.", "parent_id": 417899, "user": "HarryPairatestes2", "published": 1322083929238, "downs": 0, "karma": 2, "id": 417998, "ups": 2}, {"content": "You asked what a troll is here read this for yourself.\n\nhttp://www.alternet.org/media/149197/are_right-wing_libertarian_internet_trolls_getting_paid_to_dumb_down_online_conversations/?page=entire\n\n[-]GirlFriday1 points 6 hours ago\n\n\nI remember my first philosophy 101 course and my first beer. \n\n\"I do not care what threads you write in or what are your views. I only care for interesting discussions. If I called you out here, it is because you have only used logical fallacies on this webpage. It does not matter if you use proper arguments elsewhere, these do not eliminate the fact that you do not do so here. This defense of yours is just another logical fallacy.\" U jelly? \n\nSee this? \n\nhttp://www.alternet.org/media/149197/are_right-wing_libertarian_internet_trolls_getting_paid_to_dumb_down_online_conversations/?page=entire\n \nHave you seen places like this? http://www.thebrickfactory.com/what-we-do\n \nor this: http://www.thewritersforhire.com/seo/social-media.html\n \nOnce upon a time we didn't know how this game worked. But, now........we do.:D U mad?", "parent_id": 418671, "user": "USCitizenVoter", "published": 1322091966667, "downs": 0, "karma": 1, "id": 418846, "ups": 1}, {"content": "That's awesome!  But we have enough resources in this country that if they're being shared appropriately you shouldn't have to work that much.  We want people having families and want parents to spend as much time with their children as possible.  That's important as well as working hard.", "parent_id": 420247, "user": "corbini157", "published": 1322124132109, "downs": 0, "karma": 1, "id": 421093, "ups": 1}, {"content": "I agree 100%. Thanksgiving is nothing but a lie.... a white lie.", "parent_id": 420459, "user": "SwissMiss", "published": 1322124205327, "downs": 0, "karma": 1, "id": 421095, "ups": 1}, {"content": "Why did the lending institutions approve those loans and hand out the money?", "parent_id": 420320, "user": "SwissMiss", "published": 1322124329581, "downs": 0, "karma": 1, "id": 421099, "ups": 1}, {"content": "Get Your \ncameras ready.. peopleofwalmart.com", "parent_id": null, "user": "americanboy", "published": 1322124364768, "downs": 0, "karma": 1, "id": 421101, "ups": 1}, {"content": "Interrupting business in their stores is a great way to get attention. How far would they get at the HQ? You have to hit them where it hurts them the most.... impeding the making of money.", "parent_id": 419814, "user": "SwissMiss", "published": 1322124457473, "downs": 0, "karma": 1, "id": 421103, "ups": 1}, {"content": "One thing to consider is that your dad isn't the only person taking a risk on HIS business.  His employees are also vesting their families safety and security as employees depend on their salaries to pay for these things.  It's really just about the employers understanding their responsibilities to their employees.", "parent_id": 418721, "user": "corbini157", "published": 1322124499427, "downs": 0, "karma": 1, "id": 421106, "ups": 1}, {"content": "Good on Norway.", "parent_id": 418480, "user": "SwissMiss", "published": 1322124595933, "downs": 0, "karma": 1, "id": 421110, "ups": 1}, {"content": "Get 100 people to stand in each checkout lane and buy the cheapest item (say a pack of Ramen or some sort of loose produce). Then exit store, re-enter and repeat during store hours, then finally get a refund at the customer service desk. Spend as much time at the checkout as possible, by paying with a check or pennies for instance. The long lines may cause a dip in sales of other items and cause customers to shop at another store. All of this being completely within the rights as a \"consumer\"", "parent_id": null, "user": "JIMINRDU", "published": 1322124660080, "downs": 0, "karma": 1, "id": 421112, "ups": 1}, {"content": "", "parent_id": null, "user": "anonymous", "published": 1322124688739, "downs": 0, "karma": 1, "id": 421113, "ups": 1}, {"content": "\"The USA is the best place on earth.\"\n\nThat is one of the biggest myths on the planet. Socialism works VERY WELL in SEVERAL countries. Read up on them.", "parent_id": 418190, "user": "SwissMiss", "published": 1322124758453, "downs": 0, "karma": 1, "id": 421119, "ups": 1}, {"content": "How many $ has Walmart saved Americans over the past four decades?", "parent_id": null, "user": "americanboy", "published": 1322124807096, "downs": 0, "karma": 1, "id": 421122, "ups": 1}, {"content": "How many mom and pop stores offer health care to part time employees? Why not protest mom and pops?", "parent_id": null, "user": "UNCMike", "published": 1322124903613, "downs": 0, "karma": 1, "id": 421125, "ups": 1}, {"content": "Walmart sent higher paying manufacturing jobs overseas, therefore many people are forced to work for Walmart for those lower wages because there are no better manufacturing jobs.", "parent_id": 417725, "user": "wewontgetfooledagain", "published": 1322125169379, "downs": 0, "karma": 1, "id": 421132, "ups": 1}, {"content": "I love Wal-Mart! Wal-Mart provides jobs to millions of low skill worker a chance to make a living instead of getting a public assistance. Does anyone remember the story of Wal-Mart baby? If OWS is so up to against the big corporations, who start as a small company and gradually grew to giant company then you should go occupied McDonald, KFC, Microsoft, and so on.\nOWS go home and get a real job with paid and ask yourself who pay you?", "parent_id": null, "user": "freeusa", "published": 1322125174742, "downs": 1, "karma": 1, "id": 421133, "ups": 2}, {"content": "", "parent_id": null, "user": "anonymous", "published": 1322125309146, "downs": 0, "karma": 1, "id": 421137, "ups": 1}, {"content": "Well - I wasn't going to do this, but here goes.  I am back into your world of great assumptions.  Let's practice:  I have four apples and four oranges.  How many do I have?  or you may want to try this one:\nI have four apples and four oranges and I let you hold 2 of each, how many do I have now.  This is called advanced math so it may challenge you a little.\n\nI do not own a company that resells stuff from Walley World.  You see they have that contracted out already - you did know that did you not. They used to get rid of it through Bud's Stores but not any more.  Bud was Sam's brother, I am sure you knew that.   Years ago, I did purchase palletts from a company that got rid of Target items.  I am sure that you know that once that BOX is thrown away, that doll is not worth much to Target.   That is called customer services - because they do allow you to return it and it goes into a huge pile, is shrink wrapped and sold to the highest bidder who IS NOT real hung up on selling boxes anyway. (or it was at that time - they may have it contracted out now too).\n\nMy company's name is STUPID, you are welcome to come and sit under our big sign out front any time you like (call it boycottin' or whatever.)", "parent_id": 418722, "user": "ronjj", "published": 1322092101964, "downs": 0, "karma": 1, "id": 418857, "ups": 1}, {"content": "Harder for certain, a thousand times harder? I doubt it.\n However, I bet he does work 1000 time smarter. and sometimes all it takes is brains to bring in the money. The people doing the work are nothing more than the tools of the business.\n \n Maybe if those on the bottom were to work really hard, get an education, show that their ideas could bring grand results, they too would end up in the corporate office,, however, accepting the lower level of employment that their personal history has brought them and doing nothing to improve, can only result in a lifetime of limited income jobs... ending up sleeping in a tent in some city park while a drunk guy takes a dump right in front of their tent opening.", "parent_id": 417148, "user": "5percenter", "published": 1322092188532, "downs": 0, "karma": 1, "id": 418863, "ups": 1}, {"content": "Yes Walmart is basically THE reason for our huge trade deficit. They (Walmart etc. and politicians) sent all of our jobs overseas, import everything made in China etc. in slave labor camps yet still sell products at fairly high prices (vs. labor costs) to make billions, and put many smaller stores and business owners out of business (they are now working for low wages at Walmart etc.), so they have a retail monopoly. This is TERRIBLE and a huge reason why our economy and jobs are in shambles. Google trade deficit, walmart, etc.\n\nWhen will the USA restrict imports, end the trade deficit, bring jobs back to the USA, and outlaw lobbying????? Bush had 8 years to fix this and did nothing. John Edwards is the only one who talked about bringing American jobs back. What we need is another Boston Tea Party.\n\nWhich is better, Americans simply stocking shelves with goods made overseas or Americans working in American factories to make those products? Have everything made overseas and sooner or later too many Americans can't even afford those less expensive products.", "parent_id": null, "user": "wewontgetfooledagain", "published": 1322125939418, "downs": 0, "karma": 1, "id": 421151, "ups": 1}, {"content": "Well, now I am trapped between boycott and stupid.  You have driven me to replying to my own posts, I assume that I should give up.", "parent_id": 418857, "user": "ronjj", "published": 1322092233893, "downs": 0, "karma": 1, "id": 418867, "ups": 1}, {"content": "born to hunt...forced to work", "parent_id": null, "user": "murderkingz", "published": 1322084547356, "downs": 0, "karma": 1, "id": 418086, "ups": 1}, {"content": "I agree.  As long as you don't hurt others you are free do speak out in what way you please.  But Walmart is still private property, so you should take care of yourselves.", "parent_id": 417528, "user": "pinker", "published": 1322079893045, "downs": 0, "karma": 1, "id": 417637, "ups": 1}, {"content": "You need to CHANGE THE LAWS that determine how outside money is used in the political system.", "parent_id": 420122, "user": "shoesandtables", "published": 1322128761949, "downs": 1, "karma": 1, "id": 421220, "ups": 2}, {"content": "It's called a LIVING WAGE - something that needs to be talked about more", "parent_id": 418517, "user": "shoesandtables", "published": 1322128967243, "downs": 0, "karma": 1, "id": 421227, "ups": 1}, {"content": "I am reading here of starting companies (or taking them over) and running them democratically. How many here have tried starting a business? The government; federal, state and local have so many restrictions, licensing, taxes that you are hard pressed to make a buck even if you have a market for your product. The gov (all mentioned above) ran my local nursery in the ground with all the regulations, taxes and restrictions. It is a nightmare to own a business, and if you do end up making it through the government maze you ought to be able to make as much as you are willing to work for. I tried paying my employees a living wage (while I didn't take a cent for myself) and the taxes alone ate up every bit of profit I had and left nothing to grow my business, buy equipment, etc.  All this talk is wishful thinking. Get the government out of the way and out of our pockets.", "parent_id": null, "user": "gardengal", "published": 1322092455759, "downs": 0, "karma": 1, "id": 418885, "ups": 1}, {"content": "Thanks for ruining the movement.", "parent_id": null, "user": "laffingrass", "published": 1322076743081, "downs": 3, "karma": -1, "id": 417338, "ups": 2}, {"content": "Walmart needs to UNIONIZE all across the country!! The workers there, if they organize collectively, have so much power!! -- and they work for the largest corporation IN THE WORLD!!", "parent_id": 417104, "user": "shoesandtables", "published": 1322129432304, "downs": 0, "karma": 1, "id": 421236, "ups": 1}, {"content": "The best way to get a mass convergence of Occupiers into Wal-Mart? Tell them there's a sale on Tevas and iPhone chargers. BUH-DUM-BUMP-CHING!!! \n\nThank you! I'll be here all night. Be sure to tip your waiter.", "parent_id": null, "user": "Sharpie933", "published": 1322212219320, "downs": 0, "karma": 1, "id": 425367, "ups": 1}, {"content": "There is a great amount of difference between entry level positions and career positions.  Are you a career: clerk, stocker, janitor, tire repairman, oil changer, at WalMart.  How about McDonald's.  Do you go THERE to see your friends that have worked there for 25 years.\nDo you even know the name of a wait person at Appleby's because you have seen them there for 20 years??\n\nWhat is the turnover rate in your high school class of 2012 going to be, how about your college class of 2012,\n\nThe turnover rate at WalMart is about average for the retail industry as a whole.\n\nYou point is only valid to support your point.  There is a lot more to all stories like this and TOO many people can not seem to see a picture beyond their point (we used to call it the end of their nose).", "parent_id": 418565, "user": "ronjj", "published": 1322090946986, "downs": 0, "karma": 4, "id": 418739, "ups": 4}, {"content": "Then don't work at Walmart. Simple. If they are such a terrible place to work, they would be out of business already. You make it sound like there are brownshirt thugs whipping employees and forcing them into labor.", "parent_id": 417528, "user": "fatherlenin", "published": 1322079922434, "downs": 1, "karma": 3, "id": 417639, "ups": 4}, {"content": "Oh I know you, why your the JUNKMAN. Have you got a couple (thats 2) of the left handed monkey wrenches. I'll take them if you do. The wrenches make great christmas gifts.  I'm looking forward to your reply. Hope you had time to read GirlFridays article that descibes what a troll is.", "parent_id": 418857, "user": "USCitizenVoter", "published": 1322092651869, "downs": 0, "karma": 1, "id": 418895, "ups": 1}, {"content": "Unions are corrupt.  Can't have it both ways.  You are a hypocrite.  More and more States will force the unions out of power.  Public sector unions are going away fast.  The Post Office unions are going away.  There is no money for new contracts.  Old style pensions will be replaced by a 401k system.  You will not need unions after that.  It is already going on in the big cities. 401k is the future .  The Federal Government saw the handwriting on the wall 30 years ago and switched to a 401k type plan called the TSP.", "parent_id": 417877, "user": "mandodod", "published": 1322096293845, "downs": 2, "karma": -1, "id": 419226, "ups": 1}, {"content": "It doesn't make sense, and it doesn't increase job availability:  It mostly makes it impossible for poor people to get jobs.  But, the most IMPORTANT thing is that it makes liberals feel good about themselves.  And that's the most important thing, don't ya know.", "parent_id": 417903, "user": "FreeMarkets", "published": 1322133508154, "downs": 0, "karma": 1, "id": 421345, "ups": 1}, {"content": "You are clueless.  It's easy to pick out the commentators here that have actually founded and run a small business.  I can't use a \"tax break\" if I'm not making any money:  Tax breaks apply to profits.  Raising the minimum wage is a tax on business owners, who have to pay for it out of their own pockets, with money they do not have.  Ultimately, they can't hire more people, so the entry level to the job market gets shut down.", "parent_id": 417936, "user": "FreeMarkets", "published": 1322133657447, "downs": 0, "karma": 1, "id": 421352, "ups": 1}, {"content": "I boycotted Wallyworld for years long before anyone else even noticed that they needed to be boycotted. Yes! I agree with all of the above. On the other hand they allow people to reside in the parking lots of many of their stores. To use the restrooms at all hours etc. I know because I am one of the persons that literally lived in the parking lot at the Eastlake Walmart in Otay Mesa, California. I was overnight parking at Home Depot but I found a back pack that had been tossed into the bushes and reported it to the police. The police gave a description of my truck and trailer over the radio and because of the possibility of foul play in regards to whom the backpack belonged to the police asked me to leave Home Depot and go to Walmart. I did go that very night, the management as well as all the employees and security at Walmart were very kind and helpful to me while I stayed there. I was there for close to two weeks, after this I maintained my convictions towards Walmart but I did lift my boycott. I felt that not to do so would be acting out of blatant hypocrisy. I still do not shop at Walmart but I have stayed at several Walmart’s while traveling without any problem. Many homeless people and families have been staying at Walmart for years now when they need to. I feel that this is commendable on behalf of Walmart and at the same time I truthfully agree with everything that was posted about Walmart policy, this is difficult for me.", "parent_id": null, "user": "Violetarojo", "published": 1322135366331, "downs": 0, "karma": 1, "id": 421406, "ups": 1}, {"content": "Get someone to go back and read everything for you.  It's not your fault that you do not get it.   There are people that can help you.", "parent_id": 418701, "user": "mandodod", "published": 1322092961379, "downs": 1, "karma": 0, "id": 418923, "ups": 1}, {"content": "VETO para todos estos personajes que han participado de alguna manera en las decisiones que han llevado a Colombia (y todos los demás países) a la situación en la que se encuentra.\nNo supieron aprovechar la oportunidad de hacer algo bueno por el país, sólo por sus bolsillos. No más de estos funestos personajes, necesitamos sangre nueva para que de verdad este país tenga lo que se merece.\nVETO", "parent_id": null, "user": "Anacleto", "published": 1322085582041, "downs": 0, "karma": 2, "id": 418205, "ups": 2}, {"content": "On top of $15/hour do you also want the employer to pay 100% of health care and pension benefits or does the employee need to pay some part of those?", "parent_id": 417221, "user": "HarryPairatestes2", "published": 1322079994438, "downs": 1, "karma": 0, "id": 417645, "ups": 1}, {"content": "That's what I say", "parent_id": 420122, "user": "Farleymowat", "published": 1322138671887, "downs": 1, "karma": 2, "id": 421463, "ups": 3}, {"content": "http://5000000iro.wordpress.com/\n\nGold   Man   Sucks    ...", "parent_id": null, "user": "Tino", "published": 1322139891599, "downs": 0, "karma": 1, "id": 421496, "ups": 1}, {"content": "I don't care how much $$ they have/make for as long as they don't buy/bribe the politicians. We need to make sure that the Walton family has as much political power/influence as Joe-the-plumber family", "parent_id": null, "user": "Barkode", "published": 1322140223643, "downs": 0, "karma": 1, "id": 421505, "ups": 1}, {"content": "They don't use ritalin anymore.  You are a hypocrite.  Can't have it both ways.  Can't say it's OK for one but not another.  Unions give millions to politics.   OWS says that is wrong but you let the unions stand with you anyway.  Hypocrite.", "parent_id": 418939, "user": "mandodod", "published": 1322093528757, "downs": 1, "karma": 0, "id": 418974, "ups": 1}, {"content": "This should only make China angry.\n\nWal-Mart lost a Class Action lawsuit for the State of South Carolina a year ago for mistreating their workers. Asking them to work off the clock, stealing overtime, etc.", "parent_id": null, "user": "ishikabe", "published": 1322142830825, "downs": 0, "karma": 1, "id": 421594, "ups": 1}, {"content": "Well, here we go again.  The left handed monkey wrenches come packed two to a box (one large and one small).  Please explain to me if you want two (one box) like this, or two (two boxes)like this.  Man, some people are so difficult to communicate with you have to show them a picture.", "parent_id": 418895, "user": "ronjj", "published": 1322093858770, "downs": 0, "karma": 1, "id": 419004, "ups": 1}, {"content": "STOLEN LAND so they, royalty and freemasons got their capital for free. we need to seize the land for all!! this is OUR LAND we claim it in the name of the people!", "parent_id": 418870, "user": "sufinaga", "published": 1322109095272, "downs": 0, "karma": 1, "id": 420223, "ups": 1}, {"content": "It was corporations like Wal-Mart that lead to this unbalanced free-trade charade we see today that has sucked our entire manufacturing sector out of this country and deposited it into the likes of China. Wal-Mart's financial leverage on Washington applied through the lobbyist, played a major role the oppression of the American Middle Class.\n\nOWS is right on target... (No retailer pun intended) ... by addressing this travesty. I'm appalled at the far right's continued argument that Government should not be involved with Business. However, they continue to support corporate lobbyist... so I guess they think it is OK for Business to be involved in Government!", "parent_id": null, "user": "VERUM", "published": 1322143417592, "downs": 0, "karma": 1, "id": 421622, "ups": 1}, {"content": "Let's see. If we spread out that 4.7 million to WalMart's 2 million employees they'd each get $2.35 a year! Great idea! That'll make them rich!", "parent_id": null, "user": "elmerpkatz", "published": 1322143619122, "downs": 0, "karma": 1, "id": 421630, "ups": 1}, {"content": "\"Power concedes to nothing w/out a DEMAND...it never has..and it never will\":Frederick Douglas former slave...rise up my people...HUELGA!!!", "parent_id": null, "user": "murderkingz", "published": 1322086715423, "downs": 0, "karma": 1, "id": 418314, "ups": 1}, {"content": "On that basis of thought a new baby should simply be allowed to die because it only sucks the life out of others. Cogs in a machine really are human doings but then again others think we should be human beings. The guy with the mop is one or the other and it is up to you to decide how you will treat him. The CEO and the mopper both are not the MOP!", "parent_id": 417250, "user": "dealdoctor", "published": 1322080073381, "downs": 0, "karma": 3, "id": 417654, "ups": 3}, {"content": "How did Sam Walton do it, then?", "parent_id": 417794, "user": "FreeMarkets", "published": 1322086771114, "downs": 0, "karma": 1, "id": 418316, "ups": 1}, {"content": "WalMart is the largest employer in the country, which is probably why research has centered on them.  I do know that McDonalds has not shown up in the news repeatedly for child labor and wage-and-hour violations in my area, as  WalMart has.  WalMart has also made cuts which make it even harder for its employees to buy into its health insurance.\n\nThe bottom line is that someone who works a full time job, or the equivalent number of hours in 2 or 3 jobs, should be able to live half-way decently.\n\nDo you have actual data about single parent families, or are you guessing?  Do you have a reason to defend WalMart?", "parent_id": 418775, "user": "cmt", "published": 1322093931531, "downs": 0, "karma": 2, "id": 419015, "ups": 2}, {"content": "I think this is one of the best things I have heard coming from OWS.   But please remember to be kind to any shoppers that do decide to shop there.  So many people with very little income depend on Walmart to make some kind of Christmas for there families, and we can't blame them.\n\nGOOD LUCK!!  :)", "parent_id": null, "user": "sinead", "published": 1322094049239, "downs": 0, "karma": 2, "id": 419033, "ups": 2}, {"content": "Boycot Wal-Mart", "parent_id": null, "user": "mikedenis", "published": 1322145294726, "downs": 0, "karma": 1, "id": 421692, "ups": 1}, {"content": "Oh, the poor workers! Oh, the humanity! They have jobs and are paid WAY more than those in third-world countries. Why is it such a bad thing to provide work? At least Wal-Mart and its employees are doing something besides sitting on their tails complaining about nonsense. You people need to start contributing to this once great country. WTFU.", "parent_id": null, "user": "patg911", "published": 1322103289602, "downs": 1, "karma": 0, "id": 419758, "ups": 1}, {"content": "Fine with me if that's the way the owner of the business has structured said business.", "parent_id": 417568, "user": "pinker", "published": 1322080022602, "downs": 1, "karma": 2, "id": 417648, "ups": 3}, {"content": "Why does it seem like most ideas generated by OWS have no purpose other than half baked plans and dreams to hopefully affect/collapse large corporations and the US economy by actually impacting and hurting the 99%? There seems to be no follow up, forethought, or accountability for the people who will be most affected and hurt by OWS actions. Every boycott or attack on businesses prevents people (99%) from earning income. Is it right because you have made bad decisions to punish EVERYONE who has a job? \n\nWhat happens if you actually succeed in financially impacting or causing the collapse of a corporation?..... More layoffs, increased unemployment, additional need for government run social assistance, more people who can not pay their bills? So just how will these actions against the 99% help the 99%? When the doors close, the people who will feel the pain are the employees.... \n\nThe so called 1% have savings and investments and typically don't live paycheck to paycheck, unlike most of your so called 99%. The 1% you are trying to hurt will still have food on the table and keep paying their bills, and will most likely start another endeavor to make money because they are entrepreneurs who make things happen for themselves vs waiting for handouts, blaming others, or waiting till it's too late and wondering what happened and crying why me. \n\nLife is about choices, change, accountability, god, family, country, and values. If your foundation is weak (values, beliefs) your house will not be strong (life's decisions) and things will crumble around around you. When things crumble, what are you doing to rebuild, and fortify your house? Do you stand and watch it fall blaming others, or do you get your hands dirty and repair it. When do people have to look around and take responsibility for their individual choices? \n\nAre we becoming a country where we believe it is the governments role or responsibility to manage our lives? Today you are fighting against the failed policies and bad decisions of the government by asking the government to put in more social and entitlement policies to manage and control your future rather than fixing the problems. Are you looking at the history and risks of what you are demonstrating for... more social programs and government control? The government has never been successful in business or managing anything!!!!!\n\nIf you knew that Wal-Mart doesn't treat its employees correctly or pay enough why did you take the job or shop there when they came into your town? If you make a bad investment or a bad decision because you didn't think about the long term, research potential risks, or confer with a lawyer or investment advisor, why are you blaming others? If you didn't study finance, history, economics, or didn't take the time read the contract, why is it someone else's fault? If you kept your head down in the sand and didn't participate in our political system to ensure someone who represented your interests was elected and you just complained, why are you so upset and surprised? \n\nAll of these problems didn't happen overnight, it took years. But it doesn't take a revolution to change things. If you are the 99% you can constructively work together to elect representatives who will champion your causes and make change. Work together to change the laws and systems. Be accountable, be part of the solution not the problem.\n\nWhy do I not see any ideas for the 99% banding together and helping each other to improve, achieve, or sustain? Only calls for assistance or shouts of blame. If people lose jobs, can't eat, lose their home, etc because of OWS actions, what are your plans to help and support them? Where are your solutions or forward looking plans.... What's next if you achieve your goals and employees and their families are hurt by your day to day protests and actions?\n\nThis is why our constitution exists and why we have delegates to represent us. We have stored up our grievances and frustrations and have not effectively participated in our established political system. Now because people have sat back and watched what is going on (more people vote for American Idol) everyone is in an uproar and negatively reacting. Yes, we have many major problems and need drastic change. Is collapsing our economy and government going to succeed in making things better, or should we work within the framework setup by our founding fathers to make change?\n\nAre we really so oppressed that it is time for revolution and are you prepared for months, years, or decades of real economic depression, social chaos, food shortages, civil unrest, starvation, homelessness, job loss, etc. The banks will surely control the money by order of the government which will not go away. We will see Military on the streets, marshal law will be imposed, the rights you currently have will be suspended, and in fact we will have given the government more power.", "parent_id": null, "user": "proudamerican26", "published": 1322145462549, "downs": 0, "karma": 1, "id": 421701, "ups": 1}, {"content": "profanity attacks? so you are a crucifixion merchant? we just need to protect our children's minds from the jesus horror story. christians say man is bad and war is good, onward christian soldiers?!?! no no no! man is good and we do not want christian recruiting followers from our community. christians want a religious war against muslims. our community has solidarity with the poor against the tyranny of these two religions and their fascist masters.", "parent_id": 417802, "user": "sufinaga", "published": 1322109487128, "downs": 1, "karma": 0, "id": 420254, "ups": 1}, {"content": "No, I can't imagine it.  Please show us the business model so that we can give it analysis.", "parent_id": 417104, "user": "SelfAppointedLeader", "published": 1322145596245, "downs": 0, "karma": 1, "id": 421705, "ups": 1}, {"content": "Do you know the purpose of civil disobedience? To disobey... To break the law... Why would you make a choice to break the law, what are the risks? If you take the risk, aren't you responsible and accountable for the result of your choices? Why can't you see the police have to enforce the law? Why can't you see, breaking the law by not getting permits and protesting illegally is designed in hopes that the police will hurt someone and then insight the protestors to fight back/riot?\n\nThe peaceful protestors and our children are merely pawns of the radicals and revolutionaries who are covertly orchestrating and guiding anyone who will follow and fall into their plan for world revolution....violence! This is not a conspiracy and all the facts are there for you to see and find. They are capitalizing on our weaknesses and willingness to follow, put the sheep out for slaughter to spark the flame! This tactic has been used successfully over and over throughout history and today. Insight the mob and they will fight back.\n\nHere are the real organizers of OWS: http://www.overexposed.com/tag/organizers/\n\nWhile many of the issues regarding banking regulation, taxes, government spending, sustaining and managing public programs, etc. are worthy causes and deserve public debate and require drastic change, there are forces behind the OWS movement who want more than change... If you think OWS is about peaceful change and is a grass roots coalition spreading across the world, you should just look around at the symbols and listen to each other.  Just look at the banner on the top of this web page: Revolution - an overthrow or repudiation and the thorough replacement of an established government or political system by the people governed. A radical (bottom of page) and pervasive change in society and the social structure, especially one made suddenly and often accompanied by violence. \n\nThe fist pump graphic/logo (top of page and signs all over) that has been a symbol at the OWS protests was a clear sign this has been in works for some time. http://www.youtube.com/watch?v=lpXbA6yZY-8 They say there is no agenda or leadership, that is so they can get the sheep to follow blindly and then a spark will ignite the fire of violence and revolution, leading to the total collapse of the US economy.... Their main goal. Why do you think the World Trade Center was a chosen target? Islamist, Communists, socialists, and radicals are all following the plan.... Unfortunately, too many Americans are caught up in belonging to something without knowing what the end game is. If they knew the real goals, they may not follow so eagerly.\n\nHere is what people should think about and question: Do you know the leaders and influencers behind OWS? There are people behind these protests who want nothing more than the collapse of our government and economy because they hate America and the American way. There have been people (radicals, socialists, Marxists, and several organizations) wanting and planning this for years. If OWS succeeds in their goal to collapse the economy, all the reasons you think you are protesting will become reality. There will truly be months, years, or decades of real economic depression, social chaos, food shortages, civil unrest, starvation, homelessness, job loss, etc. The banks will surely control the money by order of the government which will not go away. We will see Military on the streets, marshal law will be imposed, the rights you currently have will be suspended, and in fact we will have given the government more power. \n\nThis is not just rhetoric or me ranting. There is a ton of history and evidence to support this. Just look it up. Checkout \"The revolution business\" http://www.youtube.com/watch?v=-P7uuPCWXng and http://www.youtube.com/watch?v=lpXbA6yZY-8 and \"OWS Exposed\" and 10 great financial collapses in history http://listverse.com/2010/08/10/10-great-financial-collapses-in-history/", "parent_id": null, "user": "proudamerican26", "published": 1322145682514, "downs": 0, "karma": 1, "id": 421711, "ups": 1}, {"content": "$200 a week?  Where in the U.S. is that the minimum wage for a full time Walmart employee?\n\nYou are making an assumption that a person working as a store clerk at Walmart is a career job that requires high wages and full benefits. Why not describe it as it really is: a beginning job for entering the workforce.  A clerk at Walmart should not be thinking this is the career job for the next 20 years unless they are hoping to work up the ladder toward management.\n\nThe average minimum wage pay at Walmart is just below $10/hour depending on which state you are talking about. That comes out to just below $20k a year. The job is not meant to be a job to support a family.\n\nDoes a CEO making $20 million a year or more mean anything different for the minimum wage worker? No. If the CEO reduced their pay to say $1 million a year that remaining $19 million divided among 2.1 million workers (includes management) comes out to $9.00 for each worker.", "parent_id": 419680, "user": "HarryPairatestes2", "published": 1322103346314, "downs": 1, "karma": 0, "id": 419761, "ups": 1}, {"content": "Trust me..I know a manager at a certain Walmart and his guards all have tasers and are more than willing to use them.. have fun in jail lol", "parent_id": null, "user": "canibus111", "published": 1322145932193, "downs": 0, "karma": 1, "id": 421722, "ups": 1}, {"content": "Walmart CEO Michael Duke's $35 million salary, when converted to an hourly wage, works out to $16,826.92. By comparison, a Walmart employee makes an average of $8.50 per hour. \nABC NEWS Business Unit \nJuly 2, 2010 \nI'm sure the health coverage doesn't quite match either. It's disgusting that we have all let these corporate giants become what they are. Lesson learned. So now is the time for change.", "parent_id": null, "user": "nyhc4405", "published": 1322224074577, "downs": 0, "karma": 1, "id": 425691, "ups": 1}, {"content": "I agree they are very different. A hammer and a person are very different. If the hammer is used to drive a nail it is a good thing that is great. If it is used to kill a person that is not a good thing. When effort worth becomes a power hammer to harm people worth its use is improper. It is worthy that the CEO make more for talent and effort. It is not ok for them to make so much more or for their corporation to gouge so much that people value is harmed. This \"monopoly game\" is real and the best players can starve others and that is immoral. Talent used to a degree that it crushes people is misused talent. Justice will seek to balance effort worth and human worth to a degree that one need not harm the other. Today they are WAY out of balance. The individual with talent is no island but lives within a context of other people and the environment.", "parent_id": 417724, "user": "dealdoctor", "published": 1322145980124, "downs": 0, "karma": 1, "id": 421725, "ups": 1}, {"content": "VANCOVER - beautiful area.  And what % of your population if of oriental descent??\n\nI used to buy from Pearl, in downtown LA.  Now there was a lady with both class and connections who could outprice WalMart any day on a very wide selection of artifical plants.  And sadly, her workers  were probably under paid and were actually children (on weekends at least) but what could I say, they were her children.\n\nI think ALCO is an American Dream.  But please help me out here do they still owe a lot to GE??  They seem to have a business plan that works - I am sure you have shopped in one, basically a skinny WalMart in an area where WalMart doesn't want to go and they seem to be doing well.\n\nAnd, yes, I would expect to be asked the question about how I could compete.  If I didn't have a business plan that would hold up to their standards, I would not expect their money.\n\nAbout all the options, NO NO NO.  They may have the option on one piece of property in one particular place or maybe even two - that is called avanced planning.  On ALL the property, I don't think so unless you are from an area with very extremely limitied vacant retail zoned land..  That is why when a WalMart goes in, a slew of other businesses surround it from Home Depot to Lowes to chain restaurants.  The businesses around one of our WalMart locations include a sole owner jewelry store, an independent tire store, a medical clinic, independently owned chain motel.  At one time, we had an independent grocery that could run rings around WalMart by running their own trucks to California and bringing  produce to their stores at prices WalMart never tried to meet. (since sold to an even bigger grocery chain)\n\nI am not a union hater, never belonged to one, my wife did for awhile.  I am simply attempting to put some ideas, and possibilities and facts out there for you to arrive at your own conclusions.  I did not make any conclusions and try to force them on anyone", "parent_id": 417963, "user": "ronjj", "published": 1322087291555, "downs": 0, "karma": 1, "id": 418372, "ups": 1}, {"content": "I would prefer to think of us as both being members of the human family. When we no longer \"crown her good with brotherhood\" we are out of balance. A family with slaves is out of health. A family where all work to form a more perfect union and embrace cooperation rather than competition will be a more healthy family. Which has priority money or people?  They both will be in the mix. I put people first but fully realize that any person being any other person's slave is wrong. I do not want you to work for me. I have three hard earned graduate degrees and have worked every day of my life since I was fifteen. I also am a vet.  That said I am not a \"worker\". I am a person. Be honest, you are too, brother. A house is for the home. An economic system is for the people of the nation. When that gets reversed the shit hits the fan because the value of people as people is subordinated to other things. The value you give others is the value you embrace for yourself because you also are a person. Lazy is bad. The long lines at soup kitchens in the great depression were full of people, not lazy drones.", "parent_id": 417712, "user": "dealdoctor", "published": 1322146548022, "downs": 0, "karma": 1, "id": 421752, "ups": 1}, {"content": "", "parent_id": 417246, "user": "anonymous", "published": 1322094277356, "downs": 0, "karma": 1, "id": 419060, "ups": 1}, {"content": "Thanks for the input jimmy44, we will take those deep and thoughtful comments in to consideration.\n After all we should be striving to keep the employers that are responsible for creating a slave working class afloat, because NO FULL Time Employment, No Living Wage, No Health Benefits,90% Chinese Import Stocked Shelves, creating 80,000 employees that can't pay rent, or go to the doctor, forced to feel as if their lives are on the edge of destruction at all times.....is a good thing        Damn Jimmy that describes a perfect world .....\n I'm gonna get right on that !..........\n I think since it was your idea, we should name it after you\n \"The Jimmy\".................congrats brother on your insightful input.....\n\nP.S. we all could use a little jimmy in our lives, how lucky are we to have our very own.......................Anonymous", "parent_id": 420641, "user": "xAnonymousx", "published": 1322226142364, "downs": 0, "karma": 1, "id": 425735, "ups": 1}, {"content": "As I've said, I like the guy's ideas and hope they go into politics to represent such ideas.", "parent_id": 417617, "user": "pinker", "published": 1322080154130, "downs": 2, "karma": -1, "id": 417660, "ups": 1}, {"content": "Holiday-shopping frenzy begins before Black Friday\n \nBy GEORGETT ROBERTS and HANNAH RAPPLEYE\n \n \nPosted: 1:28 AM, November 25, 2011\n \nIt’s a march on Mall Street!\n \nSwarms of savvy shoppers took to city streets yesterday, camping out in order to lay siege to stores that were already offering deep discounts on prime products like TVs, jewelry and apparel — hours before Black Friday even began.\n \n“We didn’t go to the parade — today is for shopping!” said tourist Hagem Mazuad, 41, who owns a car dealership in Brazil. “We started early because of the crowd and big lines.”\n \n \nShoppers skillfully navigated Manhattan streets also clogged with Macy’s parade spectators to score apparel, jewelry and toys during what’s become America’s newest retail holiday — Thanksgiving Black Thursday.\n \n \nHours after the parade ended, a parade of shoppers converged on Macy’s Herald Square.\n \nAt around 11 p.m., a dozen or so Occupy Wall Street protesters began marching around the store, chanting and waving signs. They were far outnumbered — and generally ignored — by the hundreds of customers waiting on line.\n \n“People in line have been nice,’’ said Glen Russoen, of Alabama. “But the protesters need to be cleared out. They’re idiots.’’\n\n\nRead more: http://www.nypost.com/p/news/local/it_black_thursday_ZlOvIQo26FTorvplqbPPZM#ixzz1eiooyOWL", "parent_id": null, "user": "noslappz", "published": 1322226450837, "downs": 0, "karma": 1, "id": 425748, "ups": 1}, {"content": "Is it Walmart that is Evil, or is it us that want low prices?  A small business owner can not sustainably insure its employees, especially now.  This is not because they are greedy; it's because the cost of health care is ridiculous.  \n\nI'm not convinced that corporations, like Walmart, are so bad.  If people do not want to work there, they should find another job or develop themselves to do so while working there.  If people do not want to support Walmart, how come so many shop there; mainly the 99%?  We shop there because they provide a good price.  I think Walmart has become the scapegoat of a larger issue.....nonetheless; I do agree that campaign contributions need to be eliminated.", "parent_id": null, "user": "guero1nd", "published": 1322147983419, "downs": 0, "karma": 1, "id": 421845, "ups": 1}, {"content": "CRESWELL >LIVING PROOF...that it takes a weak mind to be convinced to vote against their own best interests, obviously knows nothing about supply side economics,and nowhere in a free market capitalist system, is it alright to use your profits to skew the regulations of that system in order to make whatever criminal behavior you choose to use legal.\n So may I humbly submit a request that creswell grab his little blue cloth walmart checkout bag, fill it with dicks, which I hear go on sale today,,,,,,,,,,and suck them  \n You're  too vacuous to debate, and I'm too tired to educate.....\n                         Anonymous", "parent_id": 422743, "user": "xAnonymousx", "published": 1322226894608, "downs": 0, "karma": 1, "id": 425773, "ups": 1}, {"content": "Yes, I understand how it works and sorry if I implied they were doing it on purpose (although many of us in my neighborhood have seen our corner store owner buying baskets of one item at Walmart to resale to us - half of us don't have cars).  Nonetheless, poor people don't have the luxury to pay a little more because they disagree with a store's ideologies - they just need to feed their families.", "parent_id": 420168, "user": "pinker", "published": 1322148177275, "downs": 1, "karma": 0, "id": 421859, "ups": 1}, {"content": "I find our elected officials incompetent to govern. They need some incentive that will mean something to them instead of putting funds at risk that will cause harm to those persons and institutions who can least afford such loss. I suggest that these officials’ pay and/or benefits be cut if and/or when they fail to do their job. As it is, party “a” threatens to harm parties “”d” through “z” if parties “b” and “c” can’t come to an agreement. It makes no sense whatsoever to threaten Congress with cuts that will not have any impact on them directly. Our Constitution establishes the type of government we are to have. We do not need to establish any “sub” groups within these institutions. They are all responsible collectively to govern and if/when they fail to do so they are all liable collectively. The “carrot and stick” method only works when the carrot or stick is guaranteed to the same one. These officials have received their carrot upon being elected as they shall receive full pay and full benefits for the rest of their life even if they only serve one term. I say put all options “on the table” including their lifetime pay and benefits. I’m of the position that such a “stick” would cause these officials to get their head out of the clouds and their feet on the ground.", "parent_id": null, "user": "TexasThunder", "published": 1322227006625, "downs": 0, "karma": 1, "id": 425782, "ups": 1}, {"content": "Walmart is one of the companies excluded from investment by Norway's ethics committee for their National Pension Trust, on these very grounds.", "parent_id": null, "user": "brooklynviking", "published": 1322088271791, "downs": 0, "karma": 3, "id": 418480, "ups": 3}, {"content": "Beautiful and inspiring stuff from Phil Rockstroh, poet, lyricist, and philosopher:  \"Remember this: Most likely, the corporate state has, to some degree, colonized your mind, as it is well on its way to destroying the ecosystem of the entire planet.\n\nConversely, let your soul occupy you. While there might be an ongoing effort to scour Liberty Park of liberty, they cannot do likewise to your heart without your consent. Turn the tables on them: Evict the corporate occupiers from the public realm within--as all the while, you challenge propaganda whenever it crosses your path…on the streets, at your workplace, at family gatherings, and on social media-- because a lie left unchallenged begins to be accepted as truth. And worse, invades, colonizes and exploits (and often kills) a portion of the soul of the world.\"\n\nhttp://www.commondreams.org/view/2011/11/23\n\n He ends his essay with a quote from Utah Phillips:\nThe state can't give you freedom, and the state can't take it away. You're born with it, like your eyes, like your ears. Freedom is something you assume, then you wait for someone to try to take it away. The degree to which you resist is the degree to which you are free.”", "parent_id": null, "user": "rcarmstrong", "published": 1322088458704, "downs": 0, "karma": 1, "id": 418496, "ups": 1}, {"content": "http://5000000iro.wordpress.com/\n\nGold  Man  Sucks...\n\nwhat ?", "parent_id": null, "user": "Tino", "published": 1322148959634, "downs": 0, "karma": 1, "id": 421898, "ups": 1}, {"content": "The whole movement is rhetoric. Stop using the internet.", "parent_id": 417522, "user": "fatherlenin", "published": 1322078639776, "downs": 3, "karma": -1, "id": 417537, "ups": 2}, {"content": "They are leeches on our society. They don't deserve to be in our new communities. Shut them down now!!", "parent_id": 419634, "user": "FreedomIn2012", "published": 1322101566842, "downs": 1, "karma": 0, "id": 419647, "ups": 1}, {"content": "I hope that you folks can make a real presence of the OWS for this action. Good luck!\n\nA suggestion.\n\nPrint out a pile of voter registration forms and pass them out. Nothing will scare these owners of Wall Street and Congress more than if OWS is making a show of politically activating and empowering voters.\n\nVoter Registration pdf\nhttp://www.secstate.wa.gov/elections/pdf/vrform.pdf", "parent_id": null, "user": "aahpat", "published": 1322088683134, "downs": 0, "karma": 1, "id": 418525, "ups": 1}, {"content": "Christianity is another lie that completely steals its entire origins from the Egyptian sun god Horace which was around 3000BC. Look it up. We fight wars over lies and the truth is out there.  www.thrivemovement.com", "parent_id": 420254, "user": "nparker", "published": 1322149808432, "downs": 0, "karma": 1, "id": 421943, "ups": 1}, {"content": "I don't have exact figures in my head, but a huge percent of the children of Wal-Mart employees get public paid medical care due to poverty.   Similarly on subsidized school lunches.", "parent_id": 418534, "user": "cmt", "published": 1322088953046, "downs": 0, "karma": 1, "id": 418560, "ups": 1}, {"content": "You're welcome.", "parent_id": 425735, "user": "Jimmy44", "published": 1322228587284, "downs": 0, "karma": 1, "id": 425859, "ups": 1}, {"content": "if you are a cashier at walmart, you are more than likely unqualified to organize a major corporation.  Walmart doesn't hire 10th grade dropouts to run its enterprises. your argument is disturbing, in that it is so intensely juvenile. Stay in school, take a couple of econ classes.", "parent_id": 417528, "user": "tsizzle", "published": 1322101604406, "downs": 0, "karma": 1, "id": 419653, "ups": 1}, {"content": "I have no financial, personal, family employment or other reason to defend WalMart.  And it was not my intent to defend them.  I have seen what they did to Lambert Glove manufacturing in the area where I was born.  It was cruel-but so is business in general.\n\nI agree with your bottom line fully.  One minimum wage job in our area is not going to put shelter over your head and food on the plate of your family.  But this all relative too - are you a single family worker, kids, no kids, your wife have full coverage insurance at her job- why pay twice for the same thing, etc, etc.\n\nWhat I have been attempting to do is to provide a reason to think about posts placed on this or any other forum which are based on a very narrow view, very limited information and questionable interpretation and solution to any problem presented.\n\nIf this is presented as a forum for discussion, learning, and community problem solving there has to be more than stating a fact as a fact and calling everyone else stupid that does not accept the biased presentation.", "parent_id": 419015, "user": "ronjj", "published": 1322094721874, "downs": 0, "karma": 1, "id": 419101, "ups": 1}, {"content": "Look,   even if the corporations give zillions to politics and the unions only give millions, it is still the same and you know it.  They are both corrupt.  I did have a bunch of coffee!  I'm saying both are bad news.  OWS needs to stay away from the unions.  Just looks creepy.   Hypocrite. I am right.  Unions are dead.  Or will be soon.", "parent_id": 419074, "user": "mandodod", "published": 1322094757451, "downs": 1, "karma": 0, "id": 419104, "ups": 1}, {"content": "People have lost their means to prosper in America. Pay these people fairly and in the future some of them will open businesses better than a walmart.", "parent_id": 418517, "user": "USCitizenVoter", "published": 1322089573550, "downs": 0, "karma": 3, "id": 418625, "ups": 3}, {"content": "You're making it up as you go, right?", "parent_id": 418834, "user": "HarryPairatestes2", "published": 1322094801533, "downs": 0, "karma": 1, "id": 419112, "ups": 1}, {"content": "The fixation on cheap and cost cutting is foundational and systemic. Corporations are merely the most efficient players of this game.The public of course wants the best product at the best price~the cheapest price hence walmart grows massively by being uber effective at this.This conundrum of prices and wages can't be solved at the level at which it is created which is the level of incentives structured into the very foundation of our debt/ interest based monetary system which makes money and making mioney much more important than the real wealth and health of the planet.This economic system is based on a delusional accounting of what is real wealth and the incentives of this system keep most everyone fixated on the map of dollars and 'sense' and not the territory of what is really important and valuable.We need to start a global conversation about What is Real Wealth.Peace", "parent_id": null, "user": "Conundrums", "published": 1322152366222, "downs": 0, "karma": 1, "id": 422067, "ups": 1}, {"content": "The fixation on cheap and cost cutting is foundational and systemic. Corporations are merely the most efficient players of this game.The public of course wants the best product at the best price~the cheapest price hence walmart grows massively by being uber effective at this.This conundrum of prices and wages can't be solved at the level at which it is created which is the level of incentives structured into the very foundation of our debt/ interest based monetary system which makes money and making mioney much more important than the real wealth and health of the planet.This economic system is based on a delusional accounting of what is real wealth and the incentives of this system keep most everyone fixated on the map of dollars and 'sense' and not the territory of what is really important and valuable.We need to start a global conversation about What is Real Wealth.Peace", "parent_id": null, "user": "Conundrums", "published": 1322152506945, "downs": 0, "karma": 1, "id": 422074, "ups": 1}, {"content": "In regards to Walmart, as I've stated below somewhere, people deserve the dignity of being able to afford toilet paper.  The corner stores rip off the poor.  I'd ask the people who shop there how they feel.  agree with other stuff you said.", "parent_id": 419090, "user": "pinker", "published": 1322094937008, "downs": 2, "karma": 3, "id": 419120, "ups": 5}, {"content": "The protesters in Tahir Square in Cairo see this very distant, but they are actually protesting also against WalMart, who controls US politics toghether with a few big ones, thus controlling the CIA and Pentagon who control the Military Junta en Egypt. Egyptions could also name their movement Occupy Wall Street. The people in Wall Street are conscious of this, the rest of us much less. But it is actually a confrontation of the middle and low class OF THE WHOLE PLANET against the us 1 %. It is only a matter of time until the 1 % finally understands before things turn ugly for them. I do not think they will fight to the end like Hitler or Gadaffi.", "parent_id": null, "user": "DonQuixot", "published": 1322230959290, "downs": 0, "karma": 1, "id": 425964, "ups": 1}, {"content": "I just don't fully understanding your reasoning.  Did any of today's big box stores start out as big box stores.  It seems to me that K-Mart used to be a 5-10 cent store  operating under the banner of SSK.... and worked its way up.  WalMart certainly did not start out as a big box store  - more like a single Ben Franklin I think.\n\nPerhaps this is a completely different area with a vastly distorted look at the TIME factor.  There is a great difference in starting a chain like K'Mart in the 1960's and working up to a multitude of stores and your comparison of walking into a bank and having instant gratification of owning and operating a big box store the next day.  Assuming that you are in your twenties, you have 50 years to get your chain of big box stores going. The life cycle of the usual chain such as K-Mart is around 30-40 years and they have exceeded that and are now in decline\n\nYou have made the assumption that the same thing won't happen to WalMart.  You just can't seem to see the challenge of being there when they start their decline.  \n\nMost of the people in America are not expected to have the level of expertise that would be required to open that store, but how does that in any way impede the fact that it could be done.   Please remember that there was only ONE Sam Walton and that was all it took.    \n\nAnd now to ALCO.  If that chain had not re-invented themselves they would also be in the heap of history.  Alco is operating out of new store buildings with a new business plan.  They are just being successful in the same way that any other local store could be under the right leadership.  Surviving over 100 with that level of success is almost unheard of - GE loan or not.\n\nIt really seems that this site reflects the lack of vision, leadership and drive to do \nwhat it would take to counter what you see as the impossible.. BUT you know what I think - I think those young people are out there today making their plans,  getting an education in business and the world, setting up financial plans and they will be the next big box store owners and operators.\n\nThere are a thousand reasons why it can't be done and you and you have regurgitated several of them \"It's a different situation\", \"this stands a chance\" and \"that stands a chance\"\n\nWhy are the majority of the post on all of these forums based on a defeatist attitude that the only solution is to PULLdown what exists rather than show some initiative involving \"boot straps\"\n\nPlease take a minute to look through the posts and note the totally defeatist attitude, the we will tear down what we don't like or see as an barricade in out path to instant gratification.  \n\nIf I had a big bone to throw at each of the posts on here, we could probably move on with some success in all areas of concern being mentioned and get rid of the defeatist posts and \"poor little me\" attitudes being expressed herein.", "parent_id": 420527, "user": "ronjj", "published": 1322153427064, "downs": 0, "karma": 1, "id": 422129, "ups": 1}, {"content": "I'm sure most of you are aware of the Buy Nothing Day(s) coming up.\nhttp://www.nextworldtv.com/page/5802.html\nJust wanted to put something else out there: I've committed to a Buy Nothing Year. Obviously I will buy food, etc. but I won't buy anything non essential, even 2nd hand clothing for a full 365 days. My wife always calls me a Wantmonster, and I admit, I grew up with money and didn't like to deny myself too much. I made this decision to not purchase anything for a year on the Summer Solstice (June 21) so I'm already at the 5 month mark. \n\nIf we all didn't buy all the useless junk (that usually doesn't last anyway) from Walmart and other big box stores, the small mom and pop businesses might actually have a chance.\n\nI fully support and respect the efforts of the whole OWS//99% movement. Very inspiring!", "parent_id": null, "user": "willful", "published": 1322095271194, "downs": 0, "karma": 1, "id": 419148, "ups": 1}, {"content": "And that is the great freedom that we do have.  May I suggest a temporary job at WalMart,  work like h___, get a good recommendation, etc, and take the Trader Joe's job when it opens up to you.\n\nThat is called upward mobility.  (Please, I am NOT saying that is not what your Mother is now doing).\n\nMy point is simply, making WalMart like trader Joe's will not solve the problem of more job availability - under those conditions, it will be very hard to get a job at WalMart too.\n\nGood luck to your Mother.  I love Trader Joe's.  Wish our little city had one.", "parent_id": 421039, "user": "ronjj", "published": 1322154347275, "downs": 0, "karma": 1, "id": 422182, "ups": 1}, {"content": "Very high, by who's definition? About average for the retail service industry as a whole.", "parent_id": 418565, "user": "ronjj", "published": 1322154512738, "downs": 0, "karma": 1, "id": 422191, "ups": 1}, {"content": "Just got back from Wal-Mart....happy shoppers, no protesters, and I picked up some great stuff while helping Wal-Mart's shareholders make some money too.  Some movement you got going.  No effect at all.", "parent_id": 417552, "user": "SelfAppointedLeader", "published": 1322232514947, "downs": 0, "karma": 1, "id": 426030, "ups": 1}, {"content": "The purpose of Corporations, like Walmart, is to make a few people rich at the expense of the middle class.  If the size of such corporations were limited, then smaller mom-and-pop grocery stores would take their place.  We would then see the growth of the middle class.", "parent_id": null, "user": "Darkwolfs", "published": 1322232572230, "downs": 0, "karma": 1, "id": 426035, "ups": 1}, {"content": "No waiting for black friday deal! Nov.25-Nov.30, 65% off storewide!only 7days you can get the big sale!No waiting for the crazy deal!For Christmas gifts and winter collection are your best choice!\nMore surprise in www.dvdsetau.com can't miss the chance!Buy it now!!", "parent_id": null, "user": "xzy", "published": 1322232620307, "downs": 0, "karma": 1, "id": 426037, "ups": 1}, {"content": "No, I was pointing out that not everyone is like your relative who minds the parking lot. It seems like you are trying to make the correlation that people  \"deserve\" their shitty pay that barely gets them by. \n\nI don't consider heavy lifting for 8 hours \"easy\" work. I don't consider my friend stupid. He has a different knowledge base that I do. I know my way around computers, he knows his way around cars. He didn't do so well in the computer programming classes. I can't do anything beyond the most basic maintenance to my vehicle. Just because he doesn't have his degree doesn't make him a lesser person than me. He has a different skill set.\n\nWe all need people who are good with computers and cars. We need people to do the heavy lifting, so that Wal*Mart has their shelves filled with Chinese goods that we seem to love buying. Instead of shaming these people for not being college-educated like us, we should support them.", "parent_id": 418332, "user": "XenuLives", "published": 1322155759197, "downs": 0, "karma": 1, "id": 422267, "ups": 1}, {"content": "Look, my friend made a big mistake. He had that kid WAY too early. Should we \"punish\" him for the rest of his life because of this one mistake? Its not like he killed somebody.", "parent_id": 422267, "user": "XenuLives", "published": 1322156032102, "downs": 0, "karma": 1, "id": 422284, "ups": 1}, {"content": "A lot of them are recently graduated from school or retired. Most people are aware of that.", "parent_id": 418800, "user": "gladyg", "published": 1322091812184, "downs": 1, "karma": 0, "id": 418834, "ups": 1}, {"content": "Crowds storm stores on Black Friday\n\n New Yorkers were up early this morning, hitting stores all over the city looking for deals and discounts as the Black Friday craze swept the Big Apple. At the H&M on 34th Street, bargain hunters...  Read Full Story", "parent_id": null, "user": "noslappz", "published": 1322234247449, "downs": 0, "karma": 1, "id": 426104, "ups": 1}, {"content": "That is important, but remember, people wouldn't be so poor if we weren't living in a Wal-Mart economy where we roll back worker's wages so we can have lower prices.  That's not a good trade-off. Everything costed more, when adjusted for inflation (except health care and education), 50 years ago, but salaries were much higher too in proportion to inflation.", "parent_id": 419641, "user": "occupiedinCHI", "published": 1322156682538, "downs": 2, "karma": 0, "id": 422322, "ups": 2}, {"content": "farmerjohn - Agreed!  In today's society nothing is handed to you.  You have to work hard to get ahead in life and I think a large percentage of the population is still not willing to do that.  I too started a business with nothing and sacrificed what others are just not willing to.  Hard work and never giving up on that dream is the key to success.", "parent_id": 420247, "user": "myers73", "published": 1322156804733, "downs": 0, "karma": 1, "id": 422336, "ups": 1}, {"content": "Keep it up\n\n'Company Policy: We are not hiring until Obama is gone'\n\nhttp://www.11alive.com/news/article/214228/3/Company-Policy-We-are-not-hiring-until-Obama-is-gone", "parent_id": null, "user": "figero", "published": 1322156857011, "downs": 0, "karma": 1, "id": 422341, "ups": 1}, {"content": "Fill up shopping carts with perishable goods and leave them all over the store.  Help their employees get some hours and cut into their profits.", "parent_id": null, "user": "occupiedinCHI", "published": 1322156937338, "downs": 1, "karma": 0, "id": 422346, "ups": 1}, {"content": "How about their long history of giving employment to low-skilled workers when the alternatives are worse? No one is entitled to a job. Get real, folks. Harm Wal-Mart and you'll just be hurting the workers.", "parent_id": null, "user": "AuditElmerFudd", "published": 1322157421523, "downs": 1, "karma": 2, "id": 422368, "ups": 3}, {"content": "Absurd. Communities typically demand to have a Wal-Mart because they carry cheap goods people want. The company doesn't employ magic to convince people to buy stuff there. The histrionics are off the charts on this one.", "parent_id": 419439, "user": "AuditElmerFudd", "published": 1322157615683, "downs": 1, "karma": 1, "id": 422378, "ups": 2}, {"content": "It's simple economics. Remember, Wal-Mart started out with one store also and because it was run efficiently, it was rewarded with more sales. There is nothing evil or pernicious about it.", "parent_id": 420168, "user": "AuditElmerFudd", "published": 1322157775564, "downs": 2, "karma": 0, "id": 422390, "ups": 2}, {"content": "You never answered my first question:  Who is getting paid $5/hour at Walmart so they only earn $200 a week?\n\nWhere do you get $1700 a month for the basic necessities per month?\n\nHere is a guy who was able to live on $20k a year in San Francisco:\nhttp://martynemko.blogspot.com/2010/02/how-i-could-live-well-on-20000-year.html\n\nRemember, not every job is meant to be a career. What incentive would there be to move up in life if being a clothes stacker at Walmart paid $50k a year?", "parent_id": 420981, "user": "HarryPairatestes2", "published": 1322157778142, "downs": 0, "karma": 1, "id": 422391, "ups": 1}, {"content": "He is ultimately responsible for almost 2,000,000 people worldwide receiving a paycheck every week.  That can't be too hard...", "parent_id": 417148, "user": "myers73", "published": 1322157809202, "downs": 0, "karma": 1, "id": 422392, "ups": 1}, {"content": "Laws that force people to share are immoral.", "parent_id": 421093, "user": "AuditElmerFudd", "published": 1322157898831, "downs": 1, "karma": 0, "id": 422400, "ups": 1}, {"content": "That's why borrowing from friends, family, or angel investors makes more sense. Forget about banks.", "parent_id": 419514, "user": "AuditElmerFudd", "published": 1322158023487, "downs": 0, "karma": 2, "id": 422408, "ups": 2}, {"content": "Walmart reduces food costs to low income families by 15-20%. they are on the forefront of marketing locally grown fruits and vegetables. Wrong target.", "parent_id": null, "user": "OregonRuts", "published": 1322158001187, "downs": 1, "karma": 2, "id": 422405, "ups": 3}, {"content": "It is America.  You do have a choice of where you want to work and shop.", "parent_id": 419802, "user": "myers73", "published": 1322158071117, "downs": 0, "karma": 1, "id": 422413, "ups": 1}, {"content": "$22/hr per person?  or combined?", "parent_id": 417827, "user": "myers73", "published": 1322158191821, "downs": 0, "karma": 1, "id": 422421, "ups": 1}, {"content": "Products would be cheaper too.\n\nWe, the consumers paid for all that nefarious activity.", "parent_id": 417104, "user": "shooz", "published": 1322158294104, "downs": 0, "karma": 1, "id": 422430, "ups": 1}, {"content": "did you know that all corporations have charters granted by the state they are chartered in and can be revoked by that state,think of the possibility!", "parent_id": null, "user": "peterpeace", "published": 1322235537566, "downs": 0, "karma": 1, "id": 426179, "ups": 1}, {"content": "And do you realize, that Walmart provides for families around the nation.  Cut off that work supply and you have maybe a few hundred thousands out of work.  Sometimes I have to wonder if you understand the simple term consequences of your actions.", "parent_id": null, "user": "myrealthoughtshidden", "published": 1322235994444, "downs": 0, "karma": 1, "id": 426195, "ups": 1}, {"content": "Since 1970 C.E.O. wages have increased 275% while workers wages have stayed stagnant, that's immoral.", "parent_id": 422400, "user": "corbini157", "published": 1322159754306, "downs": 0, "karma": 3, "id": 422490, "ups": 3}, {"content": "Well, if you and Wallstreet, would actually share, such a law would be unnecessary, but that's not the case.", "parent_id": 422400, "user": "shooz", "published": 1322159910957, "downs": 0, "karma": 1, "id": 422494, "ups": 1}, {"content": "More like 425%.", "parent_id": 422490, "user": "shooz", "published": 1322160287930, "downs": 0, "karma": 1, "id": 422504, "ups": 1}, {"content": "I am so glad there's a wal mart in Asheville! OCCUPY THEM ALL!", "parent_id": null, "user": "Jonahl", "published": 1322236532038, "downs": 0, "karma": 1, "id": 426224, "ups": 1}, {"content": "Media coverage of OWS Walmart boycott is increasing foot traffic at Walmart.\n\nNice work. Another big backfire for OWS.", "parent_id": null, "user": "noslappz", "published": 1322236585633, "downs": 0, "karma": 1, "id": 426229, "ups": 1}, {"content": "Banish Wal-Mart", "parent_id": null, "user": "mikedenis", "published": 1322160892788, "downs": 0, "karma": 1, "id": 422529, "ups": 1}, {"content": "Record crowds are jamming stores all over the US.\n\nLooks like nobody cares about OWS.", "parent_id": null, "user": "noslappz", "published": 1322236729489, "downs": 0, "karma": 1, "id": 426237, "ups": 1}, {"content": "Where did all of the walmart employees work before walmart came to town? Were they just a big mass of unemployed people waiting for walmart to show up?", "parent_id": 418768, "user": "HarryPairatestes2", "published": 1322091492328, "downs": 0, "karma": 2, "id": 418800, "ups": 2}, {"content": "Up to 152 MILLION Americans expected to shop this weekend\n\nBargain-hunters didn't even wait until the end of Thanksgiving to rush into stores and gobble up holiday deals.", "parent_id": null, "user": "noslappz", "published": 1322236854534, "downs": 0, "karma": 1, "id": 426253, "ups": 1}, {"content": "Fair enough, maybe it is theoretically possible to compete with them if you had 50 years; I still think its a much more difficult proposition in 2011 than it was even in 1980, let alone 1960. \n\nGlobalization, technology, and accumulated purchasing power are pretty serious barriers to entry. Not sure if that's defeatist, I think its just being realistic, and if I ever start a business it certainly isn't going to be a department store. Walmart clearly owns that category when even established players like Alco have to base their business model around what Walmart is doing to avoid going chapter 11 for the second time.\n\nEither way, I think the main problem is still capital. To get a bank loan in Canada (I assume its the same down there) you need to give a personal guarantee, so you either need to be rich, or you need very nice family or friends who are rich. \n\nVC Firms do not care about small businesses, so then what do you do if have a good idea but are unemployed or underemployed?\n\nI look at it like this. I suck at Golf, if I try as hard as I can each shot, I might make par once every few games. A pro makes par or less almost every time putting in the same amount of effort I do. That is the situation the general population is in, but the stakes are much higher for missing a shot; and there is a substantial advantage to other players who are not starting out with a monetary handicap.\n\nStatistically, if 100 people put in the effort, maybe one does ok. Maybe fewer in this economy (which is gone to crap specifically because of globalization). That is a pretty expensive lottery ticket that most people simply can't afford.\n\nThe government needs to address the issues of income inequality, financing, and employment; if those issues are not addressed soon OWS will look quite tame compared to what will be happening in another 10 years.\n\nYou know what the simplest interim solution would be? Bring back trade barriers. Then Walmart would have to buy American, creating huge numbers of new jobs.", "parent_id": 422129, "user": "alexrai", "published": 1322161624505, "downs": 0, "karma": 1, "id": 422563, "ups": 1}, {"content": "Besides the high unemployment rate!!", "parent_id": 418800, "user": "gladyg", "published": 1322091967711, "downs": 0, "karma": 1, "id": 418847, "ups": 1}, {"content": "I'd much prefer someone get together and occupy the Frozen Food distribution center in Cedar Falls, IA.  Yeah my brothers a bit right wing but that doesn't mean I can't have a heart for him.  Target is more anti union than walmart.  They lured him away from a well paying job.  Trained him for a month, had the trainees do the public tour of the buildings and promptly had most of them fired for no reason after that.  Haven't been anywhere near a Target except once or twice in 2-3 years.", "parent_id": null, "user": "PatrynXX", "published": 1322101675306, "downs": 0, "karma": 1, "id": 419659, "ups": 1}, {"content": "Hi im darren check out my blog http://youngphilosopher89.wordpress.com\nits left wing reflecting my anarcho-syndicalist views", "parent_id": null, "user": "YoungPhilosopher89", "published": 1322238307711, "downs": 0, "karma": 1, "id": 426335, "ups": 1}, {"content": "Yes it would.  Perhaps pioneers given land by the government.", "parent_id": 418426, "user": "pinker", "published": 1322092276553, "downs": 0, "karma": 1, "id": 418870, "ups": 1}, {"content": "It might be easy to target huge corporations, especially one as big as Wal Mart, but I don't quite understand occupying it.  I love the direction OWS is heading with all this talk about accountability, but what about holding accountable those who support Wal Mart by shopping there.  I think more emphasis needs to be placed on the 99%'s responsibility to protest corporations with unethical corporate governance.  It seems like there is a lot of complaining about huge corporations but the only way they get so much power is because people, mostly from the 99%, are giving it to them.", "parent_id": null, "user": "squareone", "published": 1322101690578, "downs": 0, "karma": 1, "id": 419662, "ups": 1}, {"content": "In the meantime those same barriers put a lot of farmers out of business who depend on American exporting their goods to the world.    Think I would rather have WalMart down the street doing their thing than to walk in and find my local grocery shelves empty though we would probably have tanker trucks lined up for miles trying to off load ethanol.\n\nAnd if you want to come close to par in golf, partner up with someone who constantly shoots under and consider that as a team you are doing pretty D____ well.\n\nThis all gets back to the most overriding control of people today, who think that it all about ME.  Read through the posts here and see what it is all about, ME ME ME ME.  \n\nMaybe I should write a book and sell it for $45.00.\n\nGive me $25,000 for a small business loan and I will put you into a retail business that has the potential (depending on how hard you want to work) of grossing $1,000 per day with a gross profit margin of 50-75%.  You can sell 100% American purchased goods and feel good that you are not a big importer like WalMart.  PS, you will also become one of the largest recyclers in your city.\n\nBeen there, done that and the family tradition continues.", "parent_id": 422563, "user": "ronjj", "published": 1322164200284, "downs": 0, "karma": 1, "id": 422723, "ups": 1}, {"content": "I shop at Wal Mart almost every week and I'll be shopping there on Black Friday 2011. If you socialist had any sense, ya'll would open up your own store(s) and compete, but no, ya'll rather have a hissy fit outside. There will be more of us inside shopping than you fools outside. Free market wins and socialism loses.", "parent_id": null, "user": "creswell", "published": 1322164475340, "downs": 1, "karma": 1, "id": 422743, "ups": 2}, {"content": "@SwissMiss,\n\nYou clearly have no idea how to run a business. You give your employees say over what happens in your business, and you'll make absolutely no progress what so ever.", "parent_id": 421025, "user": "gamer86", "published": 1322164882024, "downs": 0, "karma": 1, "id": 422768, "ups": 1}, {"content": "And crack-heads demand crack but I don't think we should help them to it.\n\nBut you are right, it's not magic.  It's cheap Chinese labor and factories in countries with no environmental protections so they can pollute all they want.  And it's also (apparently) poor treatment of American workers.  \n\nBut it's also uninformed Americans buying stuff they don't Really understand the cost of.", "parent_id": 422378, "user": "beamerbikeclub", "published": 1322164957179, "downs": 0, "karma": 2, "id": 422775, "ups": 2}, {"content": "@SwissMiss\n\nAnother genius reply from SwissMiss! So genius... what if you have 4 clerks all of whom demand $46,000 a year in salary? What if you have 10 clerks? The business owner would be broke... but that's OK as long as his/her employees are making out fine!", "parent_id": 421068, "user": "gamer86", "published": 1322165008650, "downs": 0, "karma": 1, "id": 422781, "ups": 1}, {"content": "look, that sucks...but the real problem is that people shop there...people will be lined up around the block to get in there tomorrow night...If people wanted to shop at \"mom and pop\" stores, they would...they choose not to, that is why these big box stores are what they are.", "parent_id": 417747, "user": "tsizzle", "published": 1322101751628, "downs": 0, "karma": 1, "id": 419667, "ups": 1}, {"content": "A new place to Occupy. \nCrystal Bridges Museum \n\nOn November 8, 2011 \nThe American art world's biggest event in decades is happening this week — but it's not where you'd expect it to be.\n\nBentonville, Ark., is home to Wal-Mart headquarters and, starting Nov. 11, it will also be home to the Crystal Bridges Museum of American Art and what some critics are calling one of the world's best collections of American art.\n\nCrystal Bridges is the brainchild of Wal-Mart heiress Alice Walton. While it's not as vast as New York's Metropolitan Museum of Art or the National Gallery in Washington, D.C., the museum is set to showcase an impressive collection of American art, including well-known pieces by Alexander Calder and Devorah Sperber.\n *********blah blah blah blah to make a long story short\n\nAccording to Bacigalupi, nobody at Wal-Mart is involved with Crystal Bridge's daily operations — Alice Walton invested her own money into building the museum. Of course, her fortune is built on Wal-Mart stock.\n\"Even if it's not called [the] Wal-Mart Museum, it is Wal-Mart's money,\" says Lorraine Millot, a writer for the French newspaper Liberation who visited the museum for the media preview.\n\nFor the entire story from NPR news follow this link. \nhttp://www.npr.org/2011/11/08/142019716/wal-mart-heiress-brings-art-museum-to-the-ozarks", "parent_id": null, "user": "snid", "published": 1322165428412, "downs": 0, "karma": 1, "id": 422813, "ups": 1}, {"content": "walmart has about 2,000,000 employees, so they could give each of them about $3.50 if they cut their campaigns.", "parent_id": 417104, "user": "MaerF0x0", "published": 1322165813719, "downs": 0, "karma": 1, "id": 422832, "ups": 1}, {"content": "Sorry Kids \"Usually it's the Grinch that steals Christmas. This year it's the government\" Boycott Walmart Forever", "parent_id": null, "user": "USCitizenVoter", "published": 1322097692609, "downs": 0, "karma": 2, "id": 419336, "ups": 2}, {"content": "Professional writer?  Thank you for the compliment.  Thank you. \n\nHowever, I am happily retired on my $500.00 + monthly social security check - hoping for a cost of living raise this year.  That ethanol fiasco screwed me over at the grocery store - did you notice that jump in food prices after we started making that stuff??\n\nIf you want to know who I am, I will be more than happy to give you the facts, except for real personal information that is none of your business.  Please feel free to ask.  You might be surprised and I do not lie nor do I make referrals to http: sites.", "parent_id": 418846, "user": "ronjj", "published": 1322092837284, "downs": 0, "karma": 1, "id": 418913, "ups": 1}, {"content": "Canada may not be upset.  I AM.\n\nI think, living in the oil patch, that this will take on a totally different prospective when oil reaches $200.00?bbl and our best source is being shipped to China for processing.\n\nAnd, just how much are you willing to pay for oil, when it has to be imported from CHINA back into the USA????", "parent_id": 424926, "user": "ronjj", "published": 1322240601981, "downs": 0, "karma": 1, "id": 426493, "ups": 1}, {"content": "I don't need help, you do.\n\nYou missed it.\n\nAsk your doctor about ritalin.", "parent_id": 418923, "user": "shooz", "published": 1322093159048, "downs": 0, "karma": 1, "id": 418939, "ups": 1}, {"content": "Per person!", "parent_id": 422421, "user": "OccupyforEarth", "published": 1322168027503, "downs": 0, "karma": 1, "id": 422931, "ups": 1}, {"content": "Another stupid Idea. Live in a small town. When the Wal-mart came in  it provided much needed jobs. It also brought in more smaller stores as well to compete against them. Our local Wal-Mart also supports our local Salvation Army Thrift Store. It sends items such as left over holiday merchandise , outdated eggs , and breads to be sold at a very , very low price rather then tossing them in a trash bin. On top of that our local Wal-Mart began carrying products made in our state (MIO). Every Christmas our Wal-Mart host toys for tots , The Angel Tree , and Shop With a Cop.  This idea to try to make this company and others out to be evil is rather stupid. You only end up hurting the people that are depending on their services , and generosity.", "parent_id": null, "user": "angelofmercy", "published": 1322168302641, "downs": 1, "karma": 1, "id": 422945, "ups": 2}, {"content": "I see a lot of stupid people here thinking that Walmart's $15 B of annual profit is way to big and they should take that and pay their employees' health insurances (and maybe buy them each a car). You need to get an education on how corporations are FORCED (through your valued regulation) to make financial reports. a few important points for you all to understand:\n      FIRST, profit is not cash that's in the bank, it's a periodic statement of earnings based on sales and expenses recognized in that same period. Where this is important is because significant investments (like new stores and other long-term improvements) do not show up as an expense the minute you pay for them, they are spread-out over many many years, which means that typically only 1/7 to 1/30th of Walmart's investments are recognized on the income statement that reports it's \"profit\".\n    SECOND: Walmart had $400 B + of sales last year, so $15B of profit is actually very very little % of it's overall sales (3.9% to be exact). Think about it this way, Walmart is a corporation that is publicly held. It is owned by Billions of people who daily decide whether to invest their money in Walmart or a savings account. Some months, it probably looks better for them to move the company to the savings account. \n    THIRD: Just because Walmart is so big, their tiny profit seems so big, but it really isn't. It's naive of people to not educate themselves before getting up in arms over what is really tiny profit. \n     FOURTH: Let's look at your silly proposals to pay health insurance for all of Walmart's employees. The company employs 2.1 Million people (or approx 2.1 M more jobs than the occupy protesters are occupying themselves). The average cost of health insurance is about $5,000 per year (just for the individual, we're not even talking about their families). This expense would then reduce Walmart's profit by $10.5 B. This one gesture alone would leave the company with a profit of close to 1% of sales. What do you think would happen then? You got it, people would not want to buy or hold the company's stock, which would result in the company eventually dieing since it's ability to secure cash for improving stores will be eliminated. Oh yeah, then those 2.1 M people will be out of a job altogether. I'm beginning to wonder if the OWS people care if anyone has a job....\n  \n    Unfortunately for many of you OWS air heads, the minor complexities of the way our financial systems work is too great for you to mentally overcome. Hopefully this simple explanation might help you understand better.... but I doubt it.....", "parent_id": null, "user": "classynancy", "published": 1322241092110, "downs": 0, "karma": 1, "id": 426527, "ups": 1}, {"content": "Workers have the power to quit. That's a problem for employers. If workers want to run the company, then they have to share the risks of ownership, which means they have to put in equity capital.\n\nThey can buy stock, for example. The United Auto Workers could have bought GM and run it on their terms. Instead, the made unsustainable demands and drove GM to bankruptcy. Based on the way things are going now, the new GM will file for a second bankruptcy, probably before the 2016 election.", "parent_id": 421025, "user": "noslappz", "published": 1322169127107, "downs": 0, "karma": 1, "id": 422985, "ups": 1}, {"content": "From the Department of Bad Ideas at OWS:\n\nBlocking shoppers from Walmart on Friday.", "parent_id": null, "user": "noslappz", "published": 1322169247433, "downs": 0, "karma": 1, "id": 422994, "ups": 1}, {"content": "You moron, if they took every dollar of their entire profit of $16 B (forget what they spent on lobbying) and paid all 2.1 Million pf their workers with it, it would come out to $6,000 more per year or $3 per hour. Oh yeah, by the way, then the company would be out of business since they wouldn't have any money to invest in remodeling stores or other capital investments and the billions of people who own their stock would dump it in favor of a bank account (which is probably about the equivalent of investing in Walmart right now anyway!) Then the 2.1 M workers would be out of a job.\n\nGreat work, you just came up with a way of letting go of 2.1 M people, remind me to not elect you to the board of directors of my company!", "parent_id": 417104, "user": "classynancy", "published": 1322241352934, "downs": 0, "karma": 1, "id": 426544, "ups": 1}, {"content": "A turnover rate in the 40-percent range is a very high turnover rate. I would have to look at overall comparative standards, but even so it is still very high. If that is becoming the average rate overall, then we definitely need to look at how labor is organized.", "parent_id": 422191, "user": "aeturnus", "published": 1322169618446, "downs": 0, "karma": 1, "id": 423008, "ups": 1}, {"content": "The Walton family did nothing to deserve this wealth.", "parent_id": null, "user": "NiceLovelyDay", "published": 1322093544432, "downs": 0, "karma": 2, "id": 418978, "ups": 2}, {"content": "conumdrums says:\n\n<i>We need to start a global conversation about What is Real Wealth.Peace</i>\n\nReally? In other words, you want to argue with a collection of people who would agree on nothing.", "parent_id": 422074, "user": "noslappz", "published": 1322169628986, "downs": 0, "karma": 1, "id": 423012, "ups": 1}, {"content": "Go to Walmart and grab a shopping cart, fill it to the brim, take it to the checkout line and walk out.  Just leave the cart there in line blocking the registers.  Hell, grab two or three carts and act like you are going to spend hundreds of dollars then simply leave the line and the store.  Imagine the confusion and problems the management would have to go through to sort it all out.", "parent_id": null, "user": "randart", "published": 1322169959892, "downs": 1, "karma": 0, "id": 423021, "ups": 1}, {"content": "Yes, there are people who share this concern with you.   But I think, and I am sorry if this is terrible of me, but I think a huge price hike would allow people to experiment with methods for dealing with the inevitable fact that oil is a finite resource.  Three to five giant price hikes over a period of 10 years may be all we need to reset our lives.", "parent_id": 426493, "user": "ithink", "published": 1322241498531, "downs": 0, "karma": 1, "id": 426552, "ups": 1}, {"content": "so you occupy losers will keep the average Joe from getting his kid an on-sale gift for christmas. Make a real statement by setting yourselves on fire in front of a Ruth Chris Steakhouse", "parent_id": null, "user": "ProgMan", "published": 1322171599001, "downs": 1, "karma": 0, "id": 423069, "ups": 1}, {"content": "So, you Occupy loser plan to stop the average Joe worker from saving a buck to buy his kid a christmas gift.  nice", "parent_id": null, "user": "ProgMan", "published": 1322171759641, "downs": 1, "karma": 0, "id": 423077, "ups": 1}, {"content": "I fully agree.  Just look at the size of our cars since the 1970's.  We can and must adjust.  But I would rather see that adjustment come from within rather than be imposed by China or some other oil producer.", "parent_id": 426552, "user": "ronjj", "published": 1322242462907, "downs": 0, "karma": 1, "id": 426626, "ups": 1}, {"content": "I notice that a lot of the people who have something to say about Walmart's policies and politics haven't ever worked there. If you want a valid view on its corruption then ask some one who works there. I did work there for two years, and I can say in the affirmative that practically everything said about it is true. All they (shareholders) care about is making more money; I was told that several times by management/corporate.", "parent_id": null, "user": "stoicheion", "published": 1322242467611, "downs": 0, "karma": 1, "id": 426627, "ups": 1}, {"content": "Wal☆mart sucks!", "parent_id": null, "user": "markcoby98", "published": 1322242511275, "downs": 0, "karma": 1, "id": 426632, "ups": 1}, {"content": "Walmart sucks!\nTheir a great example of corporate greed, and abuse of their employees.", "parent_id": null, "user": "markcoby98", "published": 1322242693793, "downs": 0, "karma": 1, "id": 426645, "ups": 1}, {"content": "Good deal... but will those shoppers be able to break the mind-set that Wal-Mart helps them save money? Many of those struggling to make ends meet use Wal-Mart. These shoppers are not going to easily let go of cheap imported goods. How will the OWS movement address this?", "parent_id": null, "user": "mad58", "published": 1322174341891, "downs": 0, "karma": 3, "id": 423183, "ups": 3}, {"content": "That is because wages are way to high.  Benifirs are way to high.  With India and China....it had to happen.", "parent_id": 421132, "user": "mandodod", "published": 1322175227281, "downs": 0, "karma": 1, "id": 423230, "ups": 1}, {"content": "So, you're offering to work for $0.50 an hour?\n\n\nI have some work for you.  Pm me.", "parent_id": 423230, "user": "shooz", "published": 1322175419784, "downs": 0, "karma": 1, "id": 423243, "ups": 1}, {"content": "No.  It is too late.  Jobs will not come back to the US because wages are so low in Mexico and India and China.  It is too late.  They will not come back.   Sorry.", "parent_id": 423243, "user": "mandodod", "published": 1322175733733, "downs": 0, "karma": 1, "id": 423256, "ups": 1}, {"content": "I do not shop at Wal-Mart, never have, but I am obviously in the super minority. If everyon, including those from OWS would boycott with their pocket book, then Wally World would listen. Vendors can collude together and deny Wal-Mart any discounts beyond what they offer competitors. Employees can find other jobs if they feel mistreated by the company. just saying,", "parent_id": null, "user": "Trogdor", "published": 1322176044267, "downs": 0, "karma": 1, "id": 423268, "ups": 1}, {"content": "I wish that there was a 'share' button for this link. I want to share it on facebook. Great idea to occupy Wal Mart. Our family at the start were against the big corps but they suck you in with their monopolistic pricing. But we have boycotted Wal Mart for almost a year now. They 'push' chemical filled and GMO foods and I found myself giving the one finger salute to all of the video cams that they have watching everyone. Has anyone seen the 'people of wal-mart videos on youtube where they basically mock people who shop there. Where did they get the video from i wonder. Are the elite people so boring as to have to watch and mock shoppers? Probably.", "parent_id": null, "user": "PeaceAnneJustice", "published": 1322176422155, "downs": 0, "karma": 1, "id": 423278, "ups": 1}, {"content": "I recommend those interested to check out this film: WAL-MART: High Cost Of Low Price [Full Film] --- Here is the link: http://www.youtube.com/watch?v=dp0O9jxLS64&feature=related", "parent_id": 417187, "user": "shoesandtables", "published": 1322078800028, "downs": 2, "karma": 5, "id": 417552, "ups": 7}, {"content": "they control way to much of the market.", "parent_id": null, "user": "EndTheFed214", "published": 1322177489394, "downs": 0, "karma": 1, "id": 423322, "ups": 1}, {"content": "every job isn't a career no, but every job should be able to provide the very basic necessities to live including a one bedroom apartment, food, a car too get to and from your job, utilities, health care and a little spending money to fuel the economy. it's really not too much to ask for when CEO's and many \"uppers\" make more than enough to support their bottom line. That doesn't mean these people should be able to afford a house and a bmw... there's still incentives to move up in life, but even u've also got to look at things that some people aren't that smart to move up and never will be, some people are disabled preventing them from moving up, some people can't afford higher education, should these people not be able to \"make a living\"?", "parent_id": 422391, "user": "skillciaX", "published": 1322244090555, "downs": 0, "karma": 1, "id": 426751, "ups": 1}, {"content": "It's a Flash Mob!", "parent_id": null, "user": "thegrinchwhostoleyourmoney", "published": 1322078794387, "downs": 2, "karma": -1, "id": 417550, "ups": 1}, {"content": "The Legal System is 100% fraud based on admiralty. the waters of birth are symbolic of a vessel's maiden voyage. nautical law brought illegitimately to the land.\n Just say “motion to dismiss based on lack of subject matter jurisdiction. I AM A SOVEREIGN. I am not a legal person. I am the holder in due course of the trade name you have called. If you are using this trade name you must pay me. And I would like a copy of your notarized oath of office, your honor.\nhttp://www.youtube.com/watch?v=uliLfykURYo", "parent_id": null, "user": "SirPoeticJustice", "published": 1322244151399, "downs": 0, "karma": 1, "id": 426753, "ups": 1}, {"content": "A song for OWS... http://www.youtube.com/watch?v=4FM3KR9dEOk", "parent_id": null, "user": "OWSMusic", "published": 1322179064354, "downs": 0, "karma": 1, "id": 423397, "ups": 1}, {"content": "So I'm an idiot for wanting to bring back the USA manufacturing jobs that were sent to China, end the huge trade deficit and keep the US economy and job market strong? You say \"get a job\" but unless you've been living under a rock you know that is often difficult to do these days since the unemployment rate (people without jobs despite looking for work) is very high. Many of us have or had jobs and were laid off, wages reduced or too low, no raises, etc. I was laid off because the company I worked for decided to move our department to a lower wage/income area in the boonies so they could pay lower wages.\n\nSince you served in the military, let me ask you this question. Do you support spending over $1 trillion on wars over the past 10+ years? I fully support our military for defense purposes but not spending billions and trillions of taxpayer dollars on foreign and fake \"wars\" that could have been avoided, putting the US economy in great danger. I say fake because Bush lied - Saddam had no WMDs. I do not support wars based on lies. It's all about oil and other profits. Now you tell me why are gas prices so high? See what power China has now\n\nhttp://newsbusters.org/forums/latest-news/china-threatens-u-s-treasury-war-bonds-14702\n\nYou say vote, and voters should be well informed by reading our posts, the TRUTH, not brainwashed by corporate lobbying, paid TV advertising etc. And until corporate lobbying/influence is outlawed I doubt any politician can fix things for the 99%. 99% of Americans don't have billions of dollars to lobby Washington and even if we did we'd put it to better use.", "parent_id": 420839, "user": "wewontgetfooledagain", "published": 1322179393918, "downs": 0, "karma": 1, "id": 423414, "ups": 1}, {"content": "There's a lot of talk here about Wal Mart's profits, poor wages to workers, lack of benefits, etc.  I feel there is a slight lack of information about the root causes of complaints about Wal Mart.  I think it breaks down into two categories:\n\n1.  Wal Mart takes massive local subsidies, passes most health care costs onto its employees, has special roads built for them, housing assistance for their workforce, etc.\nhttp://www.thirdworldtraveler.com/Corporate_Welfare/WalMart_Welfare.html\n\n2. Wal Mart lowers prices largely by buying from abroad and taking advantage of slavery like conditions.  Everything is subcontracted, and they work through the most abusive, environmentally destructive, child labor using, and all around horrible producers.\n\nEssentially, Wal Mart is a major outlet for all the trade agreements made in recent years like NAFTA and agreements with China.\n\nEveryone supports business and competition on a level playing field, but there's something not quite right when Americans have to compete against slave labor.  I think we need more \"Fair Trade\" and less \"Free Trade\".  There should be minimum standards for child labor, education, worker rights, working conditions, etc.  If a producer cannot meet those conditions, I think their products should be subject to a tariff.", "parent_id": null, "user": "vnayar", "published": 1322107054734, "downs": 0, "karma": 3, "id": 420040, "ups": 3}, {"content": "they still sell cheap compared to everyone else", "parent_id": null, "user": "teaparty001", "published": 1322180769213, "downs": 0, "karma": 1, "id": 423484, "ups": 1}, {"content": "You are right, it is wise for the employer to listen to there employees. I find that they will have better customer service and less turn around witch translates to less training time, and more skilled employee's. Its also the owners choice to do so as well. \n\nAs far as treating employees as slaves, well, they have the choice to work where they are at. However employers should do what they say the will do(ie give raises when they said they would, etc). Last time I hired someone, they want to work for me, and last time I told a boss to go put it were the sun dont shine, I too wanted to work for him at one point.", "parent_id": 421025, "user": "jdnreha", "published": 1322246182192, "downs": 0, "karma": 1, "id": 426870, "ups": 1}, {"content": "Actually, he didn't take a loan until recently (2008) when he decided to increase his company size. He literally brought something from an auction for $5.33 and then resold it for profit. and he is still doing it.", "parent_id": 419514, "user": "jdnreha", "published": 1322246352059, "downs": 0, "karma": 1, "id": 426877, "ups": 1}, {"content": "Can you imagine how much more they could pay their poor workers if they didn't have such big bills for campaign donations and lobbying? Just sayin'", "parent_id": null, "user": "xxcONScIENcExx", "published": 1322074130726, "downs": 10, "karma": 16, "id": 417104, "ups": 26}, {"content": "Bingo!\n\nI'll stop caring about Wal-Mart and all other lobbying factions when they stop caring about corrupting our democracy and undermining my vote. All Americans should be mad as hell that their votes have literally been stolen from them by greedy corporations looking to pay their executives $9000 an hour and then pad it with fat bonus checks. All instances of political corruption should be prosecuted as treason against our democracy. The right to vote is not enough and should not end at the polls. There will be the naysayers on here that say we shouldn't protest Wal-Mart and we should be protesting our politicians... I say BS! The corporations are accomplices in this murder... they built and bought the gun.. they hired the hit man... Hell, they even drove the getaway car.... they're just as guilty as the phonies that we vote for who accept the bribes. I don't care which way you lean politically... This should piss you off. Do not let up.... Do not back down", "parent_id": 419090, "user": "xxcONScIENcExx", "published": 1322096019498, "downs": 2, "karma": 4, "id": 419203, "ups": 6}, {"content": "I worked hard raking the leaves from my lawn last weekend. Who's going to pay me for my hard work? You?", "parent_id": 417305, "user": "KirkVanHouten", "published": 1322078879100, "downs": 1, "karma": 2, "id": 417558, "ups": 3}, {"content": "\"With its long history of mistreating workers and suppliers...\"\n\nPure nonsense. If that were the case, too many workers would quit and the company would have to raise wages and benefits to get reliable employees.\n\nSuppliers would demand cash on delivery. In fact, every supplier wants to sell to Walmart. \n\n\"The Walton family (the largest shareholders of Wal-Mart stock and descendants of its founder) is the wealthiest family in the United States with an estimated net worth of $92 billion\"\n\nThe value of all Walmart stock is $195 billion. The Waltons own about half. Big deal. When the store was founded, the family owned 100%. Thus, they shared their success with outside stockholders, who are mostly institutions like pension funds and mutual funds. Thus, anyone with a pension has probably benefited from owning Walmart stock.", "parent_id": null, "user": "noslappz", "published": 1322074523750, "downs": 0, "karma": 1, "id": 417136, "ups": 1}, {"content": "You know. I think the people making $9000/hour forgot that the guy making $8/hour can afford this thing called the internet.  The guy making $8/hour has access to all the same knowledge as the rich guy. WE AS PEOPLE ARE REALIZING WE ARE ROBBED.", "parent_id": null, "user": "corbs92", "published": 1322183361776, "downs": 0, "karma": 1, "id": 423645, "ups": 1}, {"content": "How much should be paid per hour to a person stocking items at Walmart?", "parent_id": null, "user": "HarryPairatestes2", "published": 1322074547412, "downs": 5, "karma": 4, "id": 417139, "ups": 9}, {"content": "Wall Mart has put more small businesses out of business than any other organization. Yet their merchandise is made up of a lot of junk. We should change their name to Junk Mart. Look at their clothes line. It is so bland. Look at their color of their meats. They are dyed red to hide spoilage. Open their cans of food. You will many times see staleness of quality. Many times they get their food from distributers who have a lot of food that they must sell fast to avert quality spoilage so they call Wally's Junk Mart to unload their lower quality food. It's about time we turn our back on all of those that are destroying America in one way or another.", "parent_id": null, "user": "rebel9999", "published": 1322247832836, "downs": 0, "karma": 1, "id": 426971, "ups": 1}, {"content": "if all you are qualified to do is stock shelves and ring up plastic shit on a conveyor, then you only have yourself to blame for not earning a \"decent living\".", "parent_id": 418565, "user": "tsizzle", "published": 1322101912442, "downs": 0, "karma": 1, "id": 419676, "ups": 1}, {"content": "Can you imagine how much more they could pay if they didnt have to put aside money to make up for possible idiot protests?\n\n That being said, Please protest the Wal-Mart in Bowie Maryland, I would love nothing more than to be able to walk in past those trying to block me.", "parent_id": 417104, "user": "5percenter", "published": 1322074658272, "downs": 0, "karma": 1, "id": 417146, "ups": 1}, {"content": "I wonder if the CEO can show how he/she works a thousand times harder than the average worker.", "parent_id": null, "user": "vicfan", "published": 1322074678126, "downs": 5, "karma": 3, "id": 417148, "ups": 8}, {"content": "Don't buy anything from China. The message needs to get out to everyone.\nI saw an investment banker call China the \"Factory of the World\" How many factories have the 1% moved offshore from the US and Canada? Would showing a clear correlation between the rising debt, high unemployment bring more people onside?", "parent_id": null, "user": "Collector", "published": 1322183909365, "downs": 0, "karma": 1, "id": 423674, "ups": 1}, {"content": "I was wondering what kind of employee discounts Target workers get and ran across these job reviews:\n\nhttp://www.jobbite.com/reviews/target\n\nhttp://www.jobbite.com/reviews/wal-mart\n\nAnd wow they get just a 10% discount on goods made in China at slave labor wages? Some benefit. Many \"sale\" prices are a better discount than that. Target is similar to Walmart and imports goods made in China because US extreme free trade laws allow it. Corporate lobbying keeps the laws that allow/cause this in place. End the trade deficit and bring jobs back to America!\n\nhttps://www.uschina.org/statistics/tradetable.html", "parent_id": null, "user": "wewontgetfooledagain", "published": 1322183994181, "downs": 0, "karma": 1, "id": 423682, "ups": 1}, {"content": "Just when I think you hit the bottom of your silliness, you go and surprise me again!  Walmart is a major force to make commonly needed products available to the \"99%\" at low price.  Only a bunch of elitists would come out against an organization like this.", "parent_id": null, "user": "FreeMarkets", "published": 1322074873615, "downs": 0, "karma": 1, "id": 417167, "ups": 1}, {"content": "100k a year including their yearly goal bonus pkg of stock certificates", "parent_id": 417139, "user": "USCitizenVoter", "published": 1322074901993, "downs": 0, "karma": 3, "id": 417170, "ups": 3}, {"content": "\"It’s time to Occupy Wal-Mart, to shine the spotlight on its many abuses and to support its millions of workers in their struggle for a living wage. Transportation will be leaving from Westlake Center starting at 12:30pm.\"\n\nHere's my bet. Walmart shoppers will shove Occupy Walmart protesters out of the way. \n\nThis event will go as badly for Occupy Walmart protesters as the plan to block the NY Stock Exchange and the subways went for our local OWS clowns. \n\nWhen news of that plan circulated, NY City cleared out Zuccotti Park.", "parent_id": null, "user": "noslappz", "published": 1322074908101, "downs": 0, "karma": 1, "id": 417172, "ups": 1}, {"content": "\"In the meantime those same barriers put a lot of farmers out of business who depend on American exporting their goods to the world.\"\n\nHow so if trade is equally balanced i.e. the amount exported = amount imported? There should be no trade DEFICIT.\n\nhttps://www.uschina.org/statistics/tradetable.html", "parent_id": 422723, "user": "wewontgetfooledagain", "published": 1322184632104, "downs": 0, "karma": 1, "id": 423725, "ups": 1}, {"content": "If the employees share in the profits, they have a vested interest in working hard and making sound decisions. The Idea is working at several companies around the country.", "parent_id": 422768, "user": "sameeker", "published": 1322184910514, "downs": 0, "karma": 2, "id": 423744, "ups": 2}, {"content": "No.  They are \"little people\" who will be manipulated and condescended to by their intellectual superiors from NYU.", "parent_id": 417143, "user": "FreeMarkets", "published": 1322075005437, "downs": 0, "karma": 1, "id": 417180, "ups": 1}, {"content": "and can you imagine how much better off workers would be if they just took over the institutions and [**started running it democratically themselves**](http://struggleforfreedom.blogg.no/1317735903_chomsky_explains_libe.html)\n\nCorporations are [**private tyrannies**](http://www.youtube.com/watch?v=iqlTyAMVDUk) . We need real **democracy** built from the bottom up with non-hierarchical egalitarian principles where institutions and communities are run democratically : http://struggleforfreedom.blogg.no/1320873951_the_society_we_should.html\n\nWe can achieve this, you know. The Occupy Movement has started a struggle that´s going to lead to radical changes.\n\nmy contribution to how we can achive this: http://struggleforfreedom.blogg.no/1321101669_the_transition_phase_.html", "parent_id": 417104, "user": "struggleforfreedom80", "published": 1322075088505, "downs": 8, "karma": 6, "id": 417187, "ups": 14}, {"content": "I hope people will do more than just Occupy Wal-Mart. I hope people will discuss studying the Mondragon model and discuss creating an American version of Mondragon that would include an alternative to Wal-Mart. \n\nBetter to light a candle than to curse the darkness.", "parent_id": null, "user": "LeoYo", "published": 1322249361756, "downs": 0, "karma": 1, "id": 427061, "ups": 1}, {"content": "Really?  The person at the Burger King counter should be paid enough to have \"a one bedroom apartment, food, a car too get to and from your job, utilities, health care and a little spending money to fuel the economy\"?\n\nYou don't understand business or have never owned a business or both.", "parent_id": 426751, "user": "HarryPairatestes2", "published": 1322249590017, "downs": 0, "karma": 1, "id": 427078, "ups": 1}, {"content": "Why does it seem like most ideas generated by OWS have no purpose other than a half baked plan and a dream to hopefully affect/collapse large corporations and the US economy by actually impacting and hurting the 99%? There seems to be no follow up, forethought or accountability for the people who will be most affected and hurt by OWS actions. Every boycott or attack on businesses prevents people (99%) from earning income. Is it right because you have made bad decisions to punish EVERYONE who has a job? \n\nWhat happens if you actually succeed in financially impacting or causing the collapse of a corporation?..... More layoffs, increased unemployment, additional need for government run social assistance, more people who can not pay their bills? So just how will these actions against the 99% help the 99%? When the doors close, the people who will feel the pain are the employees.... \n\nThe so called 1% have savings and investments and typically don't live paycheck to paycheck, unlike most of your so called 99%. The 1% you are trying to hurt will still have food on the table and keep paying their bills, and will most likely start another endeavor to make money because they are entrepreneurs who make things happen for themselves vs waiting for handouts, blaming others, or waiting till it's too late and wondering what happened and crying why me.\n\nWhy do I not see any ideas for the 99% banding together and helping each other to improve, achieve, or sustain? Only calls for assistance or shouts of blame. If people lose jobs, can't eat, lose their home, etc because of OWS actions, what are your plans to help and support them? Where are your solutions or forward looking plans.... What's next if you achieve your goals and employees and their families are hurt by your day to day protests and actions?\n\nThis is why our constitution exists and why we have delegates to represent us. We have stored up our grievances and frustrations and have not effectively participated in our established political system. Now because people have sat back and watched what is going on (more people vote for American Idol) everyone is in an uproar and negatively reacting. Yes, we have many major problems and need drastic change. Is collapsing our economy and government going to succeed in making things better, or should we work within the framework setup by our founding fathers to make change?\n\nAre we really so oppressed that it is time for revolution and are you prepared for months, years, or decades of real economic depression, social chaos, food shortages, civil unrest, starvation, homelessness, job loss, etc. The banks will surely control the money by order of the government which will not go away. We will see Military on the streets, marshal law will be imposed, the rights you currently have will be suspended, and in fact we will have given the government more power.", "parent_id": null, "user": "proudamerican26", "published": 1322075251035, "downs": 0, "karma": 1, "id": 417199, "ups": 1}, {"content": "I don't think you've really followed what happened in many towns where Walmart was NOT \"demanded\".....\n\nhttp://gapolitico.com/en/2011/11/17/no-walmart-petition-reaches-4300-signatures-in-hours/\n\nhttp://sustainablewatertown.com/?q=No_to_Walmart\n\nhttp://nomurphywalmart.com/\n\nNo histrionics....  Walmarts have destroyed a lot of small town business", "parent_id": 422378, "user": "sinead", "published": 1322186056304, "downs": 1, "karma": 1, "id": 423820, "ups": 2}, {"content": "OWS types aren't exactly early risers.", "parent_id": 417294, "user": "KirkVanHouten", "published": 1322079026052, "downs": 1, "karma": 3, "id": 417569, "ups": 4}, {"content": "Sorry, when someone is earning a comfortable living without having to work 2-3 jobs or go into debt way over their heads (ie having to resort to using credit cards) wages are (were) NOT too high. And USA companies did fine and made good fair profits BEFORE Walmart and the trade deficit took off. It was corporate greed that caused this mess. Benefits are not too high but health care and insurance is very expensive, which is another problem fueled by lobbying. In China etc. wages are too low and that's why many USA companies import. Good paying USA jobs were replaced with slave labor jobs.\n\nSanta's Workshop\nhttp://www.youtube.com/watch?v=MQh2CZZK1YU", "parent_id": 423230, "user": "wewontgetfooledagain", "published": 1322186270364, "downs": 0, "karma": 1, "id": 423834, "ups": 1}, {"content": "Nothing stops an investment group from buying a controlling interest in Walmart. But none have tried. Smart investors know the Waltons and top management are doing a good job.\n\nBut if you want to start a group of dissident shareholders you can. However, the complainers never take the road that's both open to them and effective.", "parent_id": 417187, "user": "noslappz", "published": 1322075437466, "downs": 0, "karma": 1, "id": 417215, "ups": 1}, {"content": "Santa's Workshop\nhttp://www.youtube.com/watch?v=MQh2CZZK1YU\n\nhttp://www.youtube.com/watch?v=7cMu76GOaqE\n\nhttp://www.youtube.com/watch?v=_nULCtORf9c", "parent_id": null, "user": "wewontgetfooledagain", "published": 1322186492636, "downs": 0, "karma": 1, "id": 423846, "ups": 1}, {"content": "jsuit@cityofdelcity.org   email Del City, OK police a crime tip....police brutality is a crime...the protesters were leaving Walmart and were at the registers area and then were tackled and jailed.  WE WILL NOT STOP.", "parent_id": null, "user": "dingy58", "published": 1322250058087, "downs": 0, "karma": 1, "id": 427107, "ups": 1}, {"content": "I think we need to alter the idea here a bit. Say a union decides that conditions are horrible, and so in turn convinces the workers to throw out the boss. There is no government interference. It's not the government telling them how to run the business. It's the union, which is comprised of the workers.", "parent_id": 417337, "user": "aeturnus", "published": 1322079025785, "downs": 0, "karma": 1, "id": 417568, "ups": 1}, {"content": "I'm talkin' to you.\n\n$0.50 an hour.  It's what you want.\n\nPut up or shut up.", "parent_id": 423256, "user": "shooz", "published": 1322186653736, "downs": 0, "karma": 1, "id": 423862, "ups": 1}, {"content": "that makes no sense at all.  He probably is more profitable, sorry he doesn't stand there and say \"Si Senor\" . If the CEO or any other higher paid executive has the power and connections to keep a company that size profitable and hiring people, then yes he is1000x's better than the average worker.  Don't forget Walmart is the #1 employer in a lot of states. You guys have no idea what you're talking about.  If these companies disappeared a lot of people and you'd all be screwed.  But you're screwed anyways cause you're lazy and would just rather just protest and complain.", "parent_id": 417148, "user": "LarsBorsch", "published": 1322075575323, "downs": 0, "karma": 1, "id": 417232, "ups": 1}, {"content": "The board of directors negotiated his paycheck. There was no objection from shareholders. Shoppers don't get a direct vote. But they can vote with their wallets. However, based on store traffic, Walmart is keeping its customers happy. That's the vote that counts.", "parent_id": 417148, "user": "noslappz", "published": 1322075589899, "downs": 0, "karma": 1, "id": 417235, "ups": 1}, {"content": "According to statistics, somewhere up or down from their average of  $9.98 per hour and up probably how bad they need stockers.\n\nIn our case, they need them real bad.  I am headed out there now and I only expect to find 1/2 of the items on my list.", "parent_id": 417139, "user": "ronjj", "published": 1322075621647, "downs": 4, "karma": -3, "id": 417238, "ups": 1}, {"content": "ronjj-- we will never know... the facts above are just what was reported. having worked in an executive position at a large retail chain, i can tell you that what was reported in terms of lobbying dollars is an extremely small percentage of the actual amount when you take into consideration all of the special interests that are important to such a behemoth.\n\nComments should be closed for this posting. I think it's pretty well explained above without involving my comments or the genius of \"ronjj\" -", "parent_id": 417125, "user": "xxcONScIENcExx", "published": 1322075625136, "downs": 0, "karma": 1, "id": 417241, "ups": 1}, {"content": "Union high wages drove factory work to China because Unions just cost too much.  Corporations down to hot dog stands exist to make a profit,  not to lose money.  Google has left the US and set up in another country because the US charges 35%   Many others have left also.    Other places charge 12-14%  No brainer!  Millions saved!!  What would you do?    Dustpans will now be made in China...no turning back.", "parent_id": 423862, "user": "mandodod", "published": 1322187350754, "downs": 0, "karma": 1, "id": 423907, "ups": 1}, {"content": "Easily. The CEO's decisions affect the viability of the entire company while the average worker's decisions affect how well the aisle gets mopped.", "parent_id": 417148, "user": "Danimal98367", "published": 1322075713750, "downs": 6, "karma": -2, "id": 417250, "ups": 4}, {"content": "Different is 15 years ago. Loans were easy to get.\n\nYou can't get loans to start a business nowadays unless you have a substantial amount of capital already.", "parent_id": 418721, "user": "GetAngry", "published": 1322099921890, "downs": 0, "karma": 2, "id": 419514, "ups": 2}, {"content": "I'm asking YOU to help out.\n\nDo the correct thing, and accept the lowest wages possible.\n\nIs $0.50 too much?   I could get you even more hours at $0.25.", "parent_id": 423907, "user": "shooz", "published": 1322187710497, "downs": 0, "karma": 1, "id": 423934, "ups": 1}, {"content": "", "parent_id": 417125, "user": "anonymous", "published": 1322075751839, "downs": 0, "karma": 1, "id": 417256, "ups": 1}, {"content": "Don't just boycott walmart,boycott all business that open on Thanksgiving day including your local supermarket. These business are taking advantage of the poor workers,by not letting them stay home on Thanksgiving day with their families to have a thankful meal.", "parent_id": null, "user": "MiMi1026", "published": 1322075729697, "downs": 2, "karma": 0, "id": 417255, "ups": 2}, {"content": "The fact is, if the net negatives outweighed the net positives, communities would reject Wal-Mart. Since they haven't, the arguments against Wal-Mart are apparently not convincing enough to drive people away... and it's not because they're \"stupid\" or \"uninformed\". I've found that people can be surprisingly well informed on both mainstream and obscure issues.", "parent_id": 422775, "user": "AuditElmerFudd", "published": 1322187874701, "downs": 1, "karma": 0, "id": 423950, "ups": 1}, {"content": "CEO wages are set by the company, and in some cases shareholders may weigh in on executive compensation. What's of greater importance in my opinion is the fact that the value of the dollar to gold bullion has fallen 98% since Nixon took us off the gold standard in 1971. Think a minute about that, and see how neatly that dovetails into the CEO wage increases since 1970....That is a far greater threat to the American worker than all CEO salaries combined.", "parent_id": 422504, "user": "AuditElmerFudd", "published": 1322188362814, "downs": 0, "karma": 1, "id": 423979, "ups": 1}, {"content": "We will never pay that low.  The jobs are already gone.  We will never build dustpans again.  Why should we?  Also,  with India and Mexico,  they can make stuff way cheaper..  The jobs are lost.  Sorry.", "parent_id": 423934, "user": "mandodod", "published": 1322188372181, "downs": 0, "karma": 1, "id": 423980, "ups": 1}, {"content": "This Occupy movement is nailing it. They are targeting so many social, political,  and environment issues and shinning the light of truth on them for all to see. Everyday the evil deeds of the 1% are exposed to the 99%. Don't ever quit. The future of this country rests in your hands. Also a big thank you to Michael Moore. He was there before the first tent was pitched and is in my opinion the heart of this movement.", "parent_id": null, "user": "NYGUARD", "published": 1322188838516, "downs": 0, "karma": 1, "id": 424007, "ups": 1}, {"content": "OIC.\n\nThe CEOs find ever more ways to rip us off and you think that's fine.\n\nGold has better uses than bling and money.\n\nGet over it.\n\nThere are other ways to look at macro economics, then taking us back to the 19th century.\n\n\nhttp://pragcap.com/resources/understanding-modern-monetary-system", "parent_id": 423979, "user": "shooz", "published": 1322188869355, "downs": 0, "karma": 1, "id": 424011, "ups": 1}, {"content": "I want you to work for that.\n\nIf it's good for the goose, it's good for the gander.\n\n\nHow much are you making now?", "parent_id": 423980, "user": "shooz", "published": 1322188999418, "downs": 0, "karma": 1, "id": 424019, "ups": 1}, {"content": "American made:   jeans $30, t-shirts $8.50,  socks $3.50, boxer shorts $8.50, leather shoes $100.  Sounds high, but that is what clothes cost if the person making them is making a decent wage.  A lot of people cannot afford to pay for clothes made in the USA, but a lot of us can.  The people who work at Wal-mart can't for sure.  Our government is corrupt  but we have a chance to vote every time we spend a dollar.  Every time you swipe a credit card your giving money to the issuing bank and to the credit card company that is figured into the cost of the goods you are purchasing.  We need to support the Occupy movement and change the things that need to be changed, but we must also face the fact that the more we spend on foreign made goods the more jobs will stay out of the country,  The government can't force us to buy American made goods, we have to make that choice ourselves.  And by making that choice we may have to face the fact that we can't buy as much stuff as were used to, but maybe we don't need as much stuff as we think we do. Debt is voluntary slavery, so try not to volunteer.", "parent_id": null, "user": "po1", "published": 1322189007177, "downs": 0, "karma": 1, "id": 424021, "ups": 1}, {"content": "That's not working a thousand times harder. You didn't answer the question.", "parent_id": 417250, "user": "agnosticnixie", "published": 1322076370300, "downs": 2, "karma": 3, "id": 417305, "ups": 5}, {"content": "OWS knows what is best for hard working people trying to pay their bills and stay employed in a hard economy than those people could ever guess for themselves.\n\nIf you want to make an omlet, a few eggs must be broken. Those eggs stock shelves rather than make boardroom decisions, but hey - they are great cannon fodder.", "parent_id": 417143, "user": "Danimal98367", "published": 1322075853914, "downs": 1, "karma": 0, "id": 417259, "ups": 1}, {"content": "How is a piece of paper, backed by nothing, more modern or efficient than a currency backed by something of value? Keep in mind, currency could potentially be backed by nearly anything, and our nearly worthless dollars should face currency competition in the US. Let the best \"money\" win!", "parent_id": 424011, "user": "AuditElmerFudd", "published": 1322190030413, "downs": 0, "karma": 1, "id": 424069, "ups": 1}, {"content": "I spent a very enjoyable morning reading your well written and thought provoking essays.\n\nWorth reading people!", "parent_id": 417629, "user": "fiverrah", "published": 1322100245211, "downs": 0, "karma": 1, "id": 419543, "ups": 1}, {"content": "In accounting, a negative balance is called \"red\" and a positive balance is called \"black\", referring to the ink that used to be used.  Many companies first meet their operating costs on the day after Thanksgiving when everyone goes shopping, thus they go from the \"red\" into the \"black\".\n\nPersonally, I think it's a terrible name.  It's a view point that makes it a holiday to spend as much money as you can, as if the people exist only to increase the profits of corporations.", "parent_id": 420396, "user": "vnayar", "published": 1322191135893, "downs": 0, "karma": 1, "id": 424125, "ups": 1}, {"content": "I support the ideas here, but I don't think this is a good tactic. It sounds like the tired old moralist interventions that the left has already been doing for decades. OWS should continue ushering in a new dynamic with new tactics. \n\nThe problem with this kind of approach is that it implies some kind of collusion on the part of the average people that are shopping at wal mart for largely economic reasons. It a sets up a rift between OWS and the 99% that we are representing. Honestly, it kind of makes it seem like we are \"against Christmas\" to the average shopper, who might not be so informed about these issues. I know the whole idea is to inform them of these issues, but then what do they do? Give up on their Christmas shopping and go home? Feel guilty?  This just doesn't seem like a constructive tactic. \n\nI think our energy is better spent elsewhere (by the way I think the Movement for Justice in El Barrio and the Thanksgiving meals are excellent projects). We should be directly engaging with our neighbors as friends and equals finding common cause, not as moralizers.", "parent_id": null, "user": "SeaChange", "published": 1322191436651, "downs": 0, "karma": 2, "id": 424147, "ups": 2}, {"content": "If harder is sweat - no. If sweat = value to you, you really don't understand business.\n\nValue is based on amount \"in\" exchanged for amount \"out\". The sweat of the aisle mopper may create a nicer environment for the people shopping in the store, but the amount of money the shopper saves at Walmart compared to having to visit several more expensive small shops in a day far outweighs the comfort of a mopped floor.", "parent_id": 417305, "user": "Danimal98367", "published": 1322076752392, "downs": 1, "karma": 1, "id": 417340, "ups": 2}, {"content": "And who, in your plan, would decide and set priorities for the equal export-import ratio.   Let's say that food commodities is 01. export priority, then the 01. import priority has to be oil to produce that commodity, from this point on, the process belongs to the import side because our imports far exceed those of our exports.\n\nThis process might set a few advantageous priorities and might get rid of all those nasty imports into WalMart thus increasing manufacturing in the US BUT, at what point do we cut our own throats by then, not being able to export anymore because we don't need to import any more.\n\nThose companies that are dependent upon exports will at some point be cut off by the maximum imports that we can have and thus they will downsize.", "parent_id": 423725, "user": "ronjj", "published": 1322191631630, "downs": 0, "karma": 1, "id": 424161, "ups": 1}, {"content": "They'd be very happy to see people CARED enough about them to demonstrate against the low wages,no healthcare insurance and  poor  part time working conditions . Yes Im sure no one told them to take a walmart job.However walmart is known for their discriminatory practices towards women. Working for walmart is about as close to servitude as one can get. The workers practically have no rights.", "parent_id": 417143, "user": "MiMi1026", "published": 1322076808175, "downs": 0, "karma": 1, "id": 417346, "ups": 1}, {"content": "Walmart rocks", "parent_id": null, "user": "myrealthoughtshidden", "published": 1322100678252, "downs": 0, "karma": 1, "id": 419575, "ups": 1}, {"content": "True. Also, once everyone is paid a living wage, they will have more money to in turn purchase from small businesses. This is Keynesianism and it was the dominant economic philosophy during the US's most prosperous period, the post-WWII epoch. You could call it \"trickle up economics\", but regardless of what you call it, it worked a lot better than what we have now.", "parent_id": 417936, "user": "SeaChange", "published": 1322192588355, "downs": 0, "karma": 1, "id": 424252, "ups": 1}, {"content": "They are informed they know that shopping at Walmart is an endorsement of slavery but they figure its just how it is. They could stop shopping at Walmart there but how much difference could that possibly make? Everyone else shops there after all. So they shop there and try to ignore the negative consequences. Its like smoking cigarets, if you like to smoke you can become quite proficient at not considering that it ain't good for you.", "parent_id": 423950, "user": "sfsteve", "published": 1322193036447, "downs": 0, "karma": 1, "id": 424286, "ups": 1}, {"content": "The problem is obvious, yet widely ignored. A corporation's only purpose is to make a pofit and increase those profits every year, year after year. So corporations are only doing what they are configured to do. But it is simple math to know that they can not increase profits forever. That is what is being ignored - sooner or later there are no more profits to take. The answer is to reconfigure so that coporations become a democratically organized entity that balances profit with a high standrard of living for all who work there. That is a model sustainable for eternity.", "parent_id": null, "user": "LoveAll22", "published": 1322079158584, "downs": 2, "karma": 0, "id": 417583, "ups": 2}, {"content": "i cannot wait until they call the police and them you to get off their property", "parent_id": null, "user": "justcause", "published": 1322193197983, "downs": 0, "karma": 1, "id": 424298, "ups": 1}, {"content": "Safeway Stores is a unionized corporation and has about the same turnover rate as WalMart.  This rate is indicative of the retail market as a whole.\n\nPart of the reason that this rate is high at these two corporations is the fact that both sell a very low margin product.  The prices at Safeway are higher for identical items than WalMart beause they have to adjust for added employee benefits provided to employees.  Both corporations have similiar starting salaries depending upon area of the country and advancement up the pay scale is slower than in many other areas of employment.\n\nPlease correct or clarify if I am not interpreting data correctly.", "parent_id": 423008, "user": "ronjj", "published": 1322193546282, "downs": 0, "karma": 1, "id": 424323, "ups": 1}, {"content": "great, take em on", "parent_id": null, "user": "jjordanw", "published": 1322077188561, "downs": 2, "karma": 0, "id": 417387, "ups": 2}, {"content": "yes what if they took all that lobbying money and said, HEY, lets take care of our employees, lets take care of the people that are helping us make all this money, what can we do for them to make their lives better, \ninstead, of how can we squeeeeeza a few more pennies out of them to put in our profits....", "parent_id": null, "user": "jjordanw", "published": 1322077340058, "downs": 1, "karma": 1, "id": 417404, "ups": 2}, {"content": "I don't think that the point was \"that is a lot of money for their employees,\" its that that is a lot of money to spend on a handful of politicians.\n\nBut the fact is in our current system, if you can afford it, a campaign contribution is the best possible investment you can make. It wildly outperforms any other kind of financial instrument.", "parent_id": 421630, "user": "SeaChange", "published": 1322193946536, "downs": 0, "karma": 1, "id": 424356, "ups": 1}, {"content": "I can't understand peoples objection to protesting Walmart.  Even if they did not throw money at our politicians their treatment of employees is deplorable and the way the destroy the businesses in small towns is a crime.\n\nI wouldn't mind seeing OWS show en mass at both Walmart and DC.", "parent_id": 419203, "user": "sinead", "published": 1322098903941, "downs": 2, "karma": -1, "id": 419439, "ups": 1}, {"content": "well, not everyone can start a business. You need **capital** to do that. But it doesnt matter, thats not the point. The economy is all-encompassing. By creating a co-op the unjust economy is still there. Still a few percentage control huge parts of the economy, the enormous concentration of wealth is still there, people are still being exploited. What we need to do is create a **society** with democratic institutions", "parent_id": 417337, "user": "struggleforfreedom80", "published": 1322077401701, "downs": 2, "karma": 2, "id": 417411, "ups": 4}, {"content": "What is the best way to go about this?", "parent_id": null, "user": "livinincalifornia", "published": 1322077401341, "downs": 1, "karma": 0, "id": 417410, "ups": 1}, {"content": "Who exactly is being enslaved in your opinion?", "parent_id": 424286, "user": "AuditElmerFudd", "published": 1322194640833, "downs": 0, "karma": 1, "id": 424412, "ups": 1}, {"content": "Don't choose amazon.com instead.  Consider this ...\n\nhttp://blog.seattlepi.com/trevorgriffey/2011/04/03/top-10-reasons-to-avoid-amazon-com/\n\nAnd this...\n\nhttp://articles.mcall.com/2011-09-18/news/mc-allentown-amazon-complaints-20110917_1_warehouse-workers-heat-stress-brutal-heat", "parent_id": null, "user": "nichole", "published": 1322101087284, "downs": 0, "karma": 1, "id": 419608, "ups": 1}, {"content": "oh wow, if you would put your money where your mouth is it be a whole different world.  Michael Moore DOES take care of his employees REALLY well.  If wal-mart did the same, nobody would be complaining.  Google the benefits Michael Moore gives his workers.", "parent_id": 417246, "user": "DonQuijote", "published": 1322077626513, "downs": 2, "karma": 1, "id": 417435, "ups": 3}, {"content": "you i@%$, walmart workers NEVER have a say!!", "parent_id": 417399, "user": "MiMi1026", "published": 1322077637393, "downs": 0, "karma": 3, "id": 417436, "ups": 3}, {"content": "private property is not right?  stop with the fucking Marxist bullshit.  IT IS A FUCKING FAILURE...IT WILL NEVER FUCKING WORK", "parent_id": 418590, "user": "tsizzle", "published": 1322102040192, "downs": 0, "karma": 1, "id": 419687, "ups": 1}, {"content": "Then I hope you work toward that end.  I read your blog and find it interesting.  Good luck and please go into politics, because honestly, working within the system that is in place is the best way to recreate it the way you see fit.  You obviously are smart and know that of won't happen overnight.", "parent_id": 417411, "user": "pinker", "published": 1322077702707, "downs": 2, "karma": 0, "id": 417443, "ups": 2}, {"content": "The overseas factory workers first. The store employees second. Any job that does not pay a living wage is in my opinion a form of slavery. Paying less than a living wage and not calling it slavery is like saying that since slaves were fed and housed they were essentially paid. Freedom from debt is equivalent to freedom from imprisonment.", "parent_id": 424412, "user": "sfsteve", "published": 1322194967461, "downs": 0, "karma": 1, "id": 424448, "ups": 1}, {"content": "Agreed. $29,000. a yr is barely enough to get by after taxes.", "parent_id": 417221, "user": "MiMi1026", "published": 1322077766448, "downs": 0, "karma": 1, "id": 417447, "ups": 1}, {"content": "thanks\nI never knew what that term meant\nI heard of being in the red\nbut being positive it should be in the green should'nt it?\nmakes more sense to me", "parent_id": 424125, "user": "eyeofthetiger", "published": 1322195034473, "downs": 0, "karma": 1, "id": 424462, "ups": 1}, {"content": "Do all workers on his sets make the same or near the same he does? Are the distribution points they get equal or near to what he and the producers get?  I'm sure he treats them well,  but are his productions democratically run?  Everyone is truly equal?", "parent_id": 417435, "user": "pinker", "published": 1322077902680, "downs": 1, "karma": 3, "id": 417458, "ups": 4}, {"content": "Slaves were forced to work for nothing.  Nobody forced anyone to work at Wal-mart for minimum wage.", "parent_id": 424448, "user": "workhardplayhard", "published": 1322195431163, "downs": 0, "karma": 1, "id": 424492, "ups": 1}, {"content": "Wal-Mart would not exist if so many short-sighted people didn't patron the place.\n This does not excuse Wal-Marts tactics. I am just saying.\n\n This thing mentioned above is cool, but unless everyone engages in some hardship and boycotts these killing machines and starts patroning more expensive and more ethical small businesses they will continue to flourish.\n\n How many of the people heading over there to this thing have shopped at Wal-Mart in the last year?\n I hope none, but I don't know.", "parent_id": null, "user": "BNB", "published": 1322077950726, "downs": 2, "karma": 1, "id": 417463, "ups": 3}, {"content": "everyone knows?", "parent_id": 417617, "user": "tsizzle", "published": 1322101363464, "downs": 0, "karma": 1, "id": 419625, "ups": 1}, {"content": "So you are claiming that neither the factory worker, nor the store worker has a choice and they are literally forced by Wal-Mart to work there. This... is what you're saying. Choose your hyperbole carefully. Credibility relies on your sense of accuracy and perspective.", "parent_id": 424448, "user": "AuditElmerFudd", "published": 1322195547440, "downs": 0, "karma": 1, "id": 424508, "ups": 1}, {"content": "About an dollar a day, just like they do in China.", "parent_id": 417104, "user": "fatherlenin", "published": 1322078027020, "downs": 0, "karma": 1, "id": 417470, "ups": 1}, {"content": "Close all WalMarts! Today! Before Christmas please!", "parent_id": null, "user": "FreedomIn2012", "published": 1322101418974, "downs": 1, "karma": 0, "id": 419634, "ups": 1}, {"content": "Probably a lot more. WalMart has operated horribly since its conception, using militant tactics to strategize its position in the global economy, and driving forth incentives to force the closure of small businesses who couldn't compete with the rampant abuses disguised as a free-market love story. Some towns have even tried to stop WalMart from entering. I suspect the number of small shops hurt by WalMart's activities far outweigh any of the shops hurt by OWS in their occupations.\n\nSo, WalMart, if  you continue in your attempts to usurp the economy and drive your draconian measures onto our cities and towns, then you best be prepared ...You might be seeing us bringing it straight to your door, from town to town, city to city. In union we stand!", "parent_id": 417104, "user": "aeturnus", "published": 1322078028456, "downs": 0, "karma": 3, "id": 417471, "ups": 3}, {"content": "there really isn't a good alternative. target's prices are quite a bit more if you do a full load of shopping.", "parent_id": null, "user": "TimMcGraw", "published": 1322078064487, "downs": 2, "karma": -1, "id": 417476, "ups": 1}, {"content": "Take over? No, why don't you start your own Walmart and pay your employees a wage YOU think is fair. \n\nThat is what people do in a democracy. You don't take anything from anyone.", "parent_id": 417187, "user": "fatherlenin", "published": 1322078168924, "downs": 4, "karma": -1, "id": 417488, "ups": 3}, {"content": "Is that kind-of what Whole Foods Market does?", "parent_id": 417404, "user": "BNB", "published": 1322078200006, "downs": 0, "karma": 1, "id": 417493, "ups": 1}, {"content": "Really? You hate them but still go there? Money is tight, but Walmart is providing a place for you to buy food, yet you hate them? They are employing people so they can put food on THEIR table and you hate them?\n\nMakes absolutely no sense whatsoever.\n\nPut your money where your mouth is. Stand by your beliefs and DON'T GO TO WALMART, otherwise you're just a hypocrite.", "parent_id": 417455, "user": "fatherlenin", "published": 1322078336991, "downs": 1, "karma": 3, "id": 417506, "ups": 4}, {"content": "Actually, my work place gives you a choice and pays double that day.", "parent_id": 417255, "user": "BNB", "published": 1322078407902, "downs": 1, "karma": 1, "id": 417513, "ups": 2}, {"content": "There are doors at every corner of the store, and each worker is free to walk right out that door at any time.  Climb down off your self-anointed throne, MiMi.", "parent_id": 417346, "user": "FreeMarkets", "published": 1322078410475, "downs": 0, "karma": 1, "id": 417515, "ups": 1}, {"content": "Dear those who revel in rhetoric. I don't own a single Apple product, use any apple programs, buy overpriced clothes at the Gap or Urban Outfitters, buy overpriced coffee from Starbucks or any other major chain coffee shop. I've been to Occupy Wall Street several times. If you disagree with the movement politically fine, but stop using moronic generalizations about who's involved in it as a means of dismissing it.", "parent_id": 417449, "user": "nicck", "published": 1322078495975, "downs": 0, "karma": 3, "id": 417522, "ups": 3}, {"content": "read my answers to pinker below.\n\n\"You don't take anything from anyone\"\n\nOh, so no bailouts and profitting from other people´s work then..?", "parent_id": 417488, "user": "struggleforfreedom80", "published": 1322078497514, "downs": 3, "karma": 0, "id": 417523, "ups": 3}, {"content": "See the three parties who have candidates for US President in Missouri here:\n\nhttp://www.sos.mo.gov/candidatesonweb/DisplayCandidatesPlacementPPP2012.asp\n\nThe only candidate on the ballot in Missouri's US presidential primary who is not a D or R is James Ogle [Libertarian].", "parent_id": null, "user": "bobby", "published": 1322078917973, "downs": 0, "karma": 1, "id": 417561, "ups": 1}, {"content": "Everyone knows the political and economic systems are broken. Is some kind of new paradigm possible? This video begins that discussion. See if it causes you to think about what you have been taught is right. A crisis is a good time to re-evaluate basic assumptions. Reality trumps any ideology conservative or liberal. \n\nhttp://tinyurl.com/5swbwzz", "parent_id": 417337, "user": "dealdoctor", "published": 1322079635255, "downs": 0, "karma": 2, "id": 417617, "ups": 2}, {"content": "Im aware of that. Im within that income brackett. I pay taxes.", "parent_id": 417826, "user": "MiMi1026", "published": 1322103827813, "downs": 0, "karma": 1, "id": 419800, "ups": 1}, {"content": "What is wrong with you people?   Get a job and quit blaming others for your lack of effort and work ethic.  Your parents apparently never told you that life wasn’t fair. Get over it and quit living in tents and pay back your collage loans.  You older hippies leading this charge should be ashamed of yourselves.  You’re not the answer, you’re the problem!  How dare you breach the peace and provoke anarchy with simple minded brain washed spoiled children.  How many of you have given back anything to this country?  I’ve served my entire adult life in the military and although I support your right to free speech, I have to ask again, what contribution have any of you made?  If you received this comment, were did it come from and how are you reading it?  Who is paying for that technology?   I’ll answer that…..you aren’t.  You wannabe hippies sicken me.   Cradel to grave support is not what this country was founded on.  If you don’t like the system we live in than vote.  YOUR ALL  IDIOTS.", "parent_id": null, "user": "capitalistkryptonite", "published": 1322118322303, "downs": 2, "karma": 2, "id": 420839, "ups": 4}, {"content": "$46,000 a year for an unskilled worker to stock items on a shelf?", "parent_id": 417284, "user": "HarryPairatestes2", "published": 1322079829330, "downs": 1, "karma": 1, "id": 417630, "ups": 2}, {"content": "Because all workers in a given union are covered by the same bargaining contract.\n\nYes, I think all workers in a given organization should have the right to collective bargaining.\n\nAre you going to answer my question now?", "parent_id": 418176, "user": "shooz", "published": 1322085631741, "downs": 0, "karma": 2, "id": 418213, "ups": 2}, {"content": "It's such a shame, and Sam Walton, is turning in his grave over how WalMart has departed from his beliefs in buying American and treating his employees fairly, paying them a decent wage and providing them with decent benefits! The present CEO's of WalMart care nothing about their employees, only they care about is profits,profits, and their millions they get in salary,benefits and stock options! They should walk in the shoes of the average worker one day, like the show \" Undercover Boss\", and they will see that these workers work long hours and receive sub-wages and now sub-benefits! They are truly the scum of the earth, and yes, march on WalMart, march on the headquarters in Arkansas, and demand that they restore benefits to all workers!", "parent_id": null, "user": "freedomanddemocracy", "published": 1322087090140, "downs": 0, "karma": 1, "id": 418349, "ups": 1}, {"content": "You're right. The government shouldn't be able to tell a business how to organize itself, but that's not the same as the workers telling a business how to organize itself. WalMart has caused enough abuses that are of an extremist variety and think they have the power of the free market on their side to justify their draconian tactics. The government shouldn't be able to tell us what to do, either. If the workplace is causing economic turbulence, then the government has no right to tell us that we can't do anything about it. You can't have it both ways. Why should the government be allowed to tell us, the workers, what we can and can't do, but yet not be able to tell a business how to organize itself? If you don't want the government telling us what to do, that's fine. But you can't have it both ways.", "parent_id": 417246, "user": "aeturnus", "published": 1322078557500, "downs": 2, "karma": 0, "id": 417528, "ups": 2}, {"content": "Wal-Mart is alleged to run its business operations in a manner that contradicts internationally recognised human rights and labour rights standards, both through its suppliers in a number of countries in Asia, Africa and Latin America, and in its own operations. There are numerous reports alleging that Wal-Mart consistently and systematically employs minors in contravention of international rules, that working conditions at many of its suppliers are dangerous or health-hazardous, that workers are pressured into working overtime without compensation, that the company systematically discriminates against women with regard to pay, that all attempts by the company’s employees to unionise are stopped, that employees are in some cases unreasonably punished and locked up, along with a number of other allegations which will be subject to further discussion below under section 4.", "parent_id": null, "user": "brooklynviking", "published": 1322088583523, "downs": 0, "karma": 1, "id": 418511, "ups": 1}, {"content": "Trying to disrupt business at Walmart on Friday is another lousy idea coming from the bad-idea department of OWS.\n\nGuaranteed to backfire.", "parent_id": null, "user": "noslappz", "published": 1322153261537, "downs": 0, "karma": 1, "id": 422120, "ups": 1}, {"content": "If they aren't paid enough to afford these things, the person is essentially \"homeless\". You do you not understand the greed here in America. What the CEO of Walmart makes in 2-3 hours could support the living of one person for nearly a year! You don't think someone should be able to have a roof over their head? No car to get to and from whom they serve? No food on the table? No healthcare? Consumer spending is 70% of the economy, so they would need just a small amount out side of their needed expenses to help the economy :). You don't understand how \"economy\" works. If the money doesn't move and support the weakest on it's team, then our money has no value.", "parent_id": 427078, "user": "skillciaX", "published": 1322256397077, "downs": 0, "karma": 1, "id": 427536, "ups": 1}, {"content": "\"Wal-Mart is the largest corporation in the world and proof positive of how big business is destructive to our democracy.\"\n\nWalmart's sales are about equal to sales of Exxon. However, when it comes to the stock market, both Apple and Exxon are much larger. Apple and Exxon are each worth $350 billion, compared with $195 billion for Walmart.", "parent_id": null, "user": "noslappz", "published": 1322074700027, "downs": 0, "karma": 1, "id": 417151, "ups": 1}, {"content": "Your comment is both ignorant and offensive. No body is whinning that big business is simply making a profit.  The complaint is that worker in the 99 percent are getting less while the top 1 percent are triplling their porfits, at the expense of those who are less fortunate (I'd say sarcasm but it simply is the truth).  I do not know what your economic situation is and I am not going to attempt a guess.  Your pass at justifying the corruption on  \"being human\" is weak.  The truth is the stock holders and CEO's running these companys are greedy! Lets take Walmart for example.  It is on the top of any list at being one of the most profitable businesses.  In fact billions of dollars in revenue and billions of dollars in profits.  Instead of these profits being used to give raises, better benefits, or to create jobs, they are being used to line the pockets of those running the business.  You might not be aware but one billion dollars reinvested back into the company every year would make things significantly better for ALL Walmart employees.  According to you that is completly unreasonable.  Heavans forbid that the CEO of Walmart make a million or two less!  As for your statement regarding changing jobs.  Jobs are not out there for those at the bottom part of the 99 percent.  Any jobs that are available only pay  minimum wage or slightly over.  A single person with no kids cannot sufficiently provide for them selves getting paid minimum wage.  There is no possible way for a person to pay for all of their necessisites (food, shelter, utilities, transportant) on 200 dollars a week.  People go to work, so they can pay their bills and in most cases not even make enough to do that.  So I guess my point is, who do you think you are?  How do you look at your self in the mirror?  I would find it very hard to consider myself a good, riteous, and virtuous person with an opinion like yours.  In fact its people like you that perpetuate the greed and corruption because you think it is ok.  That it is all part of the natural order.  Well it is not! You and everyone who thinks like you is WRONG!", "parent_id": 417297, "user": "buddazjade", "published": 1322101942470, "downs": 2, "karma": -1, "id": 419680, "ups": 1}, {"content": "Today a CEO is often paid 70, 80 or over 100 times the salary of their average worker, when three decades ago the ratio usually stood at 13 to 1.", "parent_id": null, "user": "USCitizenVoter", "published": 1322079175470, "downs": 1, "karma": 0, "id": 417584, "ups": 1}, {"content": "Why stop at WalMarts? Shut down Target, Kohl's, Macy's, Sears, Home Depot, Lowe's, Victoria Secret (please not them), Bloomingdale's, The Gap, Old Navy, McDonalds, Burger King, Wendy's, Taco Bell, Kentucky Fried Chicken, Arby's, Brookstone, CVS, Walgreen's, Rite Aid, Shop Rite, Osco's, Ace Hardware, and all the other slug leeches on our society. We don't nwed them any more because we are the 99%! Screw those 1%ers!!", "parent_id": null, "user": "FreedomIn2012", "published": 1322102051682, "downs": 0, "karma": 2, "id": 419690, "ups": 2}, {"content": "And that is taking care of their own group.\n\nHow about me the consumer - I want some free cookies.", "parent_id": 418028, "user": "ronjj", "published": 1322085019497, "downs": 1, "karma": 0, "id": 418141, "ups": 1}, {"content": "Before workers could \"take over\" an institution like Walmart someone has to create it and grow it.  Otherwise, you are assuming that everyone will become entrepreneurial and democratically grow wealth producing enterprises of this scale (to employ everyone).  That is not a natural state:  Most people just want to go to work - not create the whole enterprise.", "parent_id": 417187, "user": "FreeMarkets", "published": 1322102172437, "downs": 0, "karma": 1, "id": 419696, "ups": 1}, {"content": "As a taxpayer, Wal-Mart makes you pay for the way they treat employees.\n\nhttp://www.thirdworldtraveler.com/Corporate_Welfare/WalMart_Welfare.html", "parent_id": 418141, "user": "cmt", "published": 1322085188319, "downs": 0, "karma": 1, "id": 418157, "ups": 1}, {"content": "Anyone who knows anything about Sam Walton would say that he was a man that worked hard but also worked smartly! I for one believe in the American Free enterprise system. If you work hard, smartly and you are motivated to become successful, The USA is the best place on earth. I have seen many of you complain about student loans; but many of you went and got degrees in English, Philosophy and the like. These were decisions that you people made. These types of degrees are very easy to get but do not offer and potential employer much to work with. The fact that you made bad choices isn’t my fault. I work hard and pay lots of taxes. I’m not a 1%’er  but most like in the top 30 Percent of American citizens. If you want something you have to work for it. Most importantly, you need to understand, Communism and Socialism are hard working people’s nightmare and slackers / bum’s dreams come true! In Communism and Socialism, there is no incentive and therefore people work only as hard as least productive person resulting in NOTHING getting done!", "parent_id": null, "user": "Benzobug", "published": 1322085214060, "downs": 0, "karma": 1, "id": 418158, "ups": 1}, {"content": "http://www.youtube.com/watch?v=Hftb_DVuelo\n\nWal Mart the high price of low costs movie", "parent_id": null, "user": "Justice4all", "published": 1322079340942, "downs": 1, "karma": 1, "id": 417597, "ups": 2}, {"content": "If you work at Walley World then you must feel like your working on a Chain Gang. I feel sorry for you and I hope that some other jobs open up for you. Good Luck to you.\n\nP/S I have found lots and lots of items on the market sold for lower prices than the prices at a walmart. \n\nI'm for boycotting walmart permanently. You'll never get another red cent from me walmart.", "parent_id": 418099, "user": "USCitizenVoter", "published": 1322085314605, "downs": 0, "karma": 1, "id": 418173, "ups": 1}, {"content": "Problem with protesting on privately owned property...it is only allowed if the owner allow it! Walmart is private and generally located on private property.", "parent_id": null, "user": "mannysmom", "published": 1322085341788, "downs": 0, "karma": 1, "id": 418175, "ups": 1}, {"content": "Are you serious?  Just because it is a holiday, no one should have to work?", "parent_id": 417255, "user": "lisaizonline", "published": 1322079405162, "downs": 1, "karma": 1, "id": 417598, "ups": 2}, {"content": "Try doing the math. There are over 1 million Walmart employees.in the US. Campaign contributions in the US were stated at $4.3 million. Thus, workers lost out on $4.30 each.", "parent_id": 417104, "user": "noslappz", "published": 1322075280093, "downs": 0, "karma": 1, "id": 417202, "ups": 1}, {"content": "I hope people will demonstrate peacefully and let the grandma's and moms and dads get their Christmas shopping done.", "parent_id": null, "user": "JoeTheFarmer", "published": 1322085672550, "downs": 0, "karma": 1, "id": 418219, "ups": 1}, {"content": "Sounds like such a dumb idea.  So now you're protesting WallMart?  Well at least you don't have to change your silly acronym \"Occupy WallMart Stores\"", "parent_id": null, "user": "LarsBorsch", "published": 1322075345585, "downs": 0, "karma": 1, "id": 417208, "ups": 1}, {"content": "VETO para todos estos personajes que han participado de alguna manera en las decisiones que han llevado a Colombia (y todos los demás países) a la situación en la que se encuentra.\nNo supieron aprovechar la oportunidad de hacer algo bueno por el país, sólo por sus bolsillos. No más de estos funestos personajes, necesitamos sangre nueva para que de verdad este país tenga lo que se merece.\nVETO", "parent_id": null, "user": "Anacleto", "published": 1322085843293, "downs": 0, "karma": 1, "id": 418235, "ups": 1}, {"content": "Lol - well that is what the corporations know.  They can get it cheaper lobbying OUR  elected officials.  So how about we go to the source and occupy Washington D.C. Make it part of our country again and fire them all. Period. Problem solved.", "parent_id": 419641, "user": "farmerjohn", "published": 1322108124034, "downs": 0, "karma": 2, "id": 420122, "ups": 2}, {"content": "Let me answer that for you.  Related to weeks sales alone, that would amount to less than 1/2 cent per week for all (not each) of their employees for every time you go into WalMart that week.\n\nThat 1/2 cent would then be divided among their 1.2 million employees.", "parent_id": 417125, "user": "ronjj", "published": 1322075478143, "downs": 1, "karma": 0, "id": 417219, "ups": 1}, {"content": "When you can only shop at Wal-Mart, Wal-Mart becomes your only lobbyist.", "parent_id": null, "user": "JamesS89118", "published": 1322079434454, "downs": 1, "karma": 0, "id": 417603, "ups": 1}, {"content": "The federal minimum wage needs to increase to support the ability for every working person in the country to sustain themselves. The minimum wage has NOT increased in any sort of realistic proportion to the increase in living expenses.\n\nI think $15/hr is the absolute lowest amount that any laborer should be paid in this country.", "parent_id": 417139, "user": "XenuLives", "published": 1322075480208, "downs": 1, "karma": 6, "id": 417221, "ups": 7}, {"content": "This is absolutely ridiculous. This article states that there are MILLIONS of people employed by Wal-Mart. That is MILLIONS of people of now have jobs. Big business is corrupt for employing MILLIONS of people? Is company health insurance a RIGHT or a PRIVILEGE? I believe that is whey they call them \"perks\" and \"benefits\" Ok, yes, there is corruption in big business. There is corruption in small business as well. Unfortunately, when business are filled with PEOPLE, corruption will happen. I wonder if one of those $8 employees has ever stolen anything from Wal-Mart. My guess is that it's happened. Let's occupy those employees homes because they are corrupt! (sarcasm). Running a successful business in not a crime. Wal-Mart has done more good for each city it has \"occupied\" than bad. If a Wal-Mart employee wants to make more than $8 an hour, they should go seek employment elsewhere. To those who think minimum wage needs to be increased, have you ever wondered what happens to prices of the items that you purchase when a company has to pay it's workforce more? YOU pay more, the price of everything goes up and it all comes out a wash in the end. Crazy huh?The employer has no responsibility to pay them any more than what they agree to pay them. Should they pay their employees more? Maybe. But that is their prerogative. Quit whining that big business are making a profit and go find a job. If you don't like where you work, you have the RIGHT to go find something else. OR you could start your OWN business and run it the way YOU think is most fair.", "parent_id": null, "user": "occupyyourself85", "published": 1322076305930, "downs": 7, "karma": -3, "id": 417297, "ups": 4}, {"content": "how much money could the SEIU put in their member's pockets if they stopped stuffing the pockets of Nancy Pelosi and Barack Obama", "parent_id": 417104, "user": "tsizzle", "published": 1322102260280, "downs": 0, "karma": 1, "id": 419700, "ups": 1}, {"content": "OWS is teetering and staggering toward its final collapse. But, like most drunks, the members of the OWS crowd don't know how seriously intoxicated they are.\n\nWalmart is not going to feel your pain.", "parent_id": null, "user": "noslappz", "published": 1322086169230, "downs": 0, "karma": 1, "id": 418270, "ups": 1}, {"content": "Create corporations and run them that way if you choose, but the government should not be able to tell a business how to organize itself.  And corporations should not be able to control government with contributions.  Less govt.  Not more. This model was sent to me via a Michael Moore link.  Let MM lead by example and equally share with ALL crew members decisions about his films and profits.  Ain't gonna happen.", "parent_id": 417187, "user": "pinker", "published": 1322075671350, "downs": 6, "karma": 3, "id": 417246, "ups": 9}, {"content": "Correct. Owners can operate on any legal basis. Pay workers $100 an hour. Operate only four hours a day. Whatever. The complainers should create a store and run on their own terms.\n\nWalmart won't object, mainly because a store managed on the OWS principles would fail within months.", "parent_id": 417246, "user": "noslappz", "published": 1322075913794, "downs": 0, "karma": 1, "id": 417261, "ups": 1}, {"content": "You need to understand that the economy is all-encompassing, What we need to do is to create a democratic **society** based on democratically run workplaces and communities, not just a co-op here and there in a sea of state- capitalism: http://struggleforfreedom.blogg.no/1320873951_the_society_we_should.html", "parent_id": 417246, "user": "struggleforfreedom80", "published": 1322076252004, "downs": 0, "karma": 2, "id": 417289, "ups": 2}, {"content": "What about all the teacher and union pension funds that are invested in Walmart?  Your proposal would destroy their pension funds.  Don't you care about them?", "parent_id": 417795, "user": "FreeMarkets", "published": 1322086891714, "downs": 0, "karma": 1, "id": 418333, "ups": 1}, {"content": "I already did?  Maybe there is someone there that can help you?", "parent_id": 418213, "user": "mandodod", "published": 1322086978454, "downs": 1, "karma": 0, "id": 418338, "ups": 1}, {"content": "Struggle  99.9 percent you are right that you need capital to start a business,\nThat is what we were taught. I for myself could not afford one so i went to the bank and they said NO. no no no no .  So i decided to use there money and not pay my mortgage for 1 month and buy a piece of equipment that i needed and started my business.  I have done this for 15 years now and my business is totally vested = paid for. As of this date i am still behind on my mortgage and should be caught up by Jan 2012.  I have worked 7 days a week for 12 years -  holidays and sometimes i work then also. Trying to put bread on the table.  This all happened when at 1998 when i could not get employment, either overqualified or to dam old.  So it is possible but you have to work your butt off depends on your dream i guess.  Our economy is no longer a manufacturer of products we gave it all away.  Just a service industry.", "parent_id": 417411, "user": "farmerjohn", "published": 1322109382250, "downs": 0, "karma": 4, "id": 420247, "ups": 4}, {"content": "Where?!!! Get a grip on reality. Where are people hired at Walmart going to get a job. Wake up.!!! When it hits you it will be too late. I guess you have no clue and you SNOOZE WE ALL LOSE!!!", "parent_id": 417846, "user": "gladyg", "published": 1322087577659, "downs": 0, "karma": 2, "id": 418403, "ups": 2}, {"content": "I have, therefore, a recommendation for the Occupy movement, rightfully incensed as it is with the excesses of Wall Street over the last three decades. It is to call for an end to the state of emergency, which has been in force since 2001, under which since 2008 a U.S. Army Brigade Combat Team has been stationed permanently in the United States, in part to be ready “to help with civil unrest and crowd control. Prof. Peter Dale Scott", "parent_id": null, "user": "RobertUeberfeldt", "published": 1322087726472, "downs": 0, "karma": 1, "id": 418422, "ups": 1}, {"content": "I agree with all the events OWS is doing. But...where is the event to show support to Tahrir? Tahrir supported Occupy, they sent us open letters of support, and they even marched on the US Embassy in Cairo for us. \n\nWhere is the OWS event to return the favor, to march on the Egyptian embassy and the Point Lookout Capital Partners - the mega-financiers manufacturing and selling crowd control weapons to Egypt - and give the Egyptian revolutionaries some hope and support?\n\nI see lots of armchair Occupiers watching live feeds and hours of people in tents discussing Occupy; yet I've yet to see an event for Egypt come together.\n\nEgyptian Embassy in NYC (Consulate General):\n1110 Second Ave. – Suite 201 New York, NY 10022 \nTEL: 212.759.7120\nFAX: 212.308.7643 \n\nPoint Lookout Capital Partners\n1370 Avenue-The Americas # 29  New York, NY 10019-4619\n(917) 322-6437\n\nMichael A. Monteleone\nTel: 917-322-6437\nmm@pointlookoutcapital.com      \n \nJames J. Cesare\nTel: 917-322-6438\njc@pointlookoutcapital.com", "parent_id": null, "user": "xOccupyx", "published": 1322087748417, "downs": 0, "karma": 1, "id": 418424, "ups": 1}, {"content": "It would be interesting to trace that properties ownership back to the original owner and then see how he/she acquired it.", "parent_id": 417637, "user": "BNB", "published": 1322087767881, "downs": 0, "karma": 1, "id": 418426, "ups": 1}, {"content": "From occupy NZ to occupy wall st. Classic NZ protest footage and damming indictment of our Prime Minister an ex US Federal reserve agent who helped the whole world to become a poorer place http://www.youtube.com/watch?v=8AjgWyxJAGQ", "parent_id": null, "user": "RobertUeberfeldt", "published": 1322110009156, "downs": 0, "karma": 1, "id": 420289, "ups": 1}, {"content": "The economic system needs reform.  So I'm voting for Mitt Romney, the only candidate that has the proven track record of reducing and eliminating favoritism towards corporations in tax policy.  For example, banks in MA were forming real estate trusts. He hired a specialist to comb the tax law and eliminated many, and had to be stopped when he tried to go national.\n\nSeeking Taxes, Romney went after Business\n\nhttp://www.nytimes.com/2011/10/02/us/politics/romneys-strategies-as-governor-bucked-his-ceo-image.html?pagewanted=all", "parent_id": 417631, "user": "whosear", "published": 1322087849551, "downs": 1, "karma": 0, "id": 418440, "ups": 1}, {"content": "And the turnover at WalMart is very high (say 44%) as the workers do what they do to survive.\n\nI am torn between being confronted by NEW employees at WalMart all the time and going to a major competing business and being confronted by OLD employees that are guaranteed their job and could care less about me as a customer-(no smile, no greeting at the door, no carts in the rack, dirty floors, waiting 15-20 minutes for someone called for assistance to get there, etc. (DISCLAIMER - this has been my experience only and may not be true of all locations of either business being made reference to)\n\nPS - missing a ) somewhere above. Please put it where it belongs for me.  Thanks..", "parent_id": 417747, "user": "ronjj", "published": 1322088013958, "downs": 0, "karma": 1, "id": 418453, "ups": 1}, {"content": "I'm sorry that your small store didn't make ti, but as an entrepreneur who competes against significantly (100x +) times bigger competitors, there is a way to compete, but you need to do it the right way and pick and choose what tactics will work. Often times, it means using the strengths of your competition in one area as a weakness in others. This is so powerful since they can't change inherently who they are very quickly at all.", "parent_id": 419489, "user": "classynancy", "published": 1322258959954, "downs": 0, "karma": 1, "id": 427701, "ups": 1}, {"content": "So what is your simple point??\n\nInflation, is that CEO doing exactly the same work with the same resources that he was doing when the ratio was 13-1, I can understand a CEO working with a ratio of 13 - 1 three decades ago who had 100 employees.  Compare apples to apples and oranges to oranges.  Now you have a CEO with a ration of 70-1 with 1.2 million employees - what exactly is the point you are trying to make.\n\nJust try to imagine that this is your final written exam in either your English or your Economics class and give yourself a grade on that paper.", "parent_id": 417584, "user": "ronjj", "published": 1322084689185, "downs": 0, "karma": 1, "id": 418099, "ups": 1}, {"content": "How many of the 99% drew mortgages they couldnt afford via no doc loan apps?", "parent_id": null, "user": "Wallst4eva", "published": 1322110644682, "downs": 0, "karma": 1, "id": 420320, "ups": 1}, {"content": "Better hand out candy to the shoppers. Trust me, the people who shop there are not out on a whim. Paycheck to paycheck, they only survive buying teh Cheap. Also Women in particular feel social obligations, and everyone likes to Give a little this season. They will find the Buy Nothing message offensive if a shopper's mere presence is judged as bad. I would prefer to see a flash mob songfest in the big richy stores on Black Friday. I'll join that.", "parent_id": null, "user": "johndenton47", "published": 1322088275467, "downs": 0, "karma": 3, "id": 418482, "ups": 3}, {"content": "http://www.regjeringen.no/en/sub/styrer-rad-utvalg/ethics_council/Recommendations/Recommendations/recommendations-on-human-rights/Recommendation-of-November-15-2005--on-e.html?id=423835", "parent_id": null, "user": "brooklynviking", "published": 1322088461972, "downs": 0, "karma": 1, "id": 418497, "ups": 1}, {"content": "You talking to me??   Never worked at WalMart a day in my life.\n\nI do not doubt your second statement at all.  I purchase over $1,000 per week at WalMart and Sams.  I do not have the luxury of the time to find lots and lost of items for lower prices although, I can pretty much give you the comparable prices between WalMart, KMart, Alco, etc and I will purchase the less expensive if of the same brand, weight, etc PROVIDED, it doesn't mean one trip for one item about 5 miles away - just not economically sound to me.\n\nBoycotting is a good thing.  More power to you.", "parent_id": 418173, "user": "ronjj", "published": 1322088533062, "downs": 0, "karma": 1, "id": 418506, "ups": 1}, {"content": "Hello, What about Microsoft? They bring lots of H1/L1 visa workers to replace Americans. They got rid of 5000 workers and replace them with L1 visa holders. Tata consultancy, WIPRO, Infosys and Cognizant are big into bringing H1/L1 holders. Most of the IT professionals don't get jobs because of this.", "parent_id": null, "user": "adlogyram", "published": 1322088584098, "downs": 0, "karma": 3, "id": 418512, "ups": 3}, {"content": "Except through your taxes.  It's sad.\n\nPeople who work full time should have enough money not to need Medicaid, SCHIP, and food stamps.", "parent_id": 418198, "user": "cmt", "published": 1322088596421, "downs": 0, "karma": 2, "id": 418517, "ups": 2}, {"content": "Here we go. I'm sure there might have been other posts hidden amongst the many in this relatively not-so-user-friendly website that have mentioned this, but I have to say. Amongst the posts that I have read, and excluding my own posts, this is the first I have read that is actively promoting workplace democracy. Keep it going!", "parent_id": 417187, "user": "aeturnus", "published": 1322077477749, "downs": 3, "karma": 1, "id": 417425, "ups": 4}, {"content": "Please explain how that works and do NOT just refer me to another http.  What is your interpretation in your own words - that is what I want to hear.", "parent_id": 418157, "user": "ronjj", "published": 1322088759812, "downs": 0, "karma": 1, "id": 418534, "ups": 1}, {"content": "Here and in surrounding states, they violated the child labor laws repeatedly, and were caught repeatedly.  I don't buy there.", "parent_id": 418511, "user": "cmt", "published": 1322088770661, "downs": 0, "karma": 1, "id": 418537, "ups": 1}, {"content": "A report is also available from the National Labor Committee containing further documentation of working conditions at Wal-Mart’s suppliers in Bangladesh. This alleges use of child labour (a 13 year-old girl) and the death of a young woman after working non-stop for 38 hours despite being ill.59\nA further report describes how 6-7 employees at a textile factory outside Dhakar lost their lives and many were injured when the management called in the police after the employees had gone on strike. They went on strike because they were ordered to work five hours unpaid overtime per day, seven days a week. The police beat the employees with batons and opened fire with handguns. One of the injured in the shooting was a 13 year-old girl.60", "parent_id": null, "user": "brooklynviking", "published": 1322088844977, "downs": 0, "karma": 1, "id": 418545, "ups": 1}, {"content": "Never give up, never surrender! Lets occupy the world! We the 99 need to take it back and we can't stop until it's done.", "parent_id": null, "user": "mannysmom", "published": 1322088899351, "downs": 0, "karma": 1, "id": 418549, "ups": 1}, {"content": "A turnover rate of 44%? Very high, indeed. Workers are doing what they do to survive. WalMart apparently can't even hold on to its own workforce, because it is not a viable place to work. They do not have the capacity for workers to earn a decent living. That's my point.", "parent_id": 418453, "user": "aeturnus", "published": 1322089001601, "downs": 0, "karma": 1, "id": 418565, "ups": 1}, {"content": "o crap, troll alert, ronjj is a stupid troll.", "parent_id": 418506, "user": "USCitizenVoter", "published": 1322089400992, "downs": 0, "karma": 1, "id": 418604, "ups": 1}, {"content": "Can you imagine the jobs if that made all that stuff in America?", "parent_id": 417104, "user": "demcapitalist", "published": 1322078162521, "downs": 0, "karma": 2, "id": 417486, "ups": 2}, {"content": "Also. all this talk of corporations and owners making all that money.  Look at any movie set and compare what the actors like Pitt make compared to the crew.  It's just as obscene as any CEO's pay.", "parent_id": 417435, "user": "pinker", "published": 1322078178190, "downs": 1, "karma": 3, "id": 417489, "ups": 4}, {"content": "I personally don't shop at Walmart but why go to the store and pester shoppers who are just trying to save some $, and workers who are just trying to survive?  They're not your target are they?  Why not go to Walmart headquarters.  Great way to alienate the very people you are supposed to be speaking up for.  And you can't tell me the shoppers won't be insulted.", "parent_id": null, "user": "MaryS", "published": 1322103982218, "downs": 0, "karma": 1, "id": 419814, "ups": 1}, {"content": "During the year that is being withheld, right? Do you get a refund come tax time?", "parent_id": 419800, "user": "HarryPairatestes2", "published": 1322104170328, "downs": 0, "karma": 1, "id": 419823, "ups": 1}, {"content": "The slave owners in the old South did give food and housing to their slaves. I do not know if they were considered \"perks\" or \"benefits\". There were very many who thought that system was just business as usual and should not be questioned. My gosh, Southern Christians even found Bible verses to support the institution of slavery or was it \"wage slavery\". It must have been wage slavery because they did get food and housing \"wages\".  Sure all those slaves were lazy too, right? Dirty, right? Needed a bath? Right? Could an entire system be flawed? Only people who think out of the box their tradition gave them can even imagine a change of the entire system. Going back to cave man times is not an option. Can you imagine something more people friendly instead of just bank account friendly? Slavery did get lots of money in the bank for the slave holder but it was really not people friendly for the 99% caught in its web.", "parent_id": 417297, "user": "dealdoctor", "published": 1322081024231, "downs": 1, "karma": 1, "id": 417731, "ups": 2}, {"content": "I agree, but it also needs to be understood that small businesses can not afford to pay that rate. We need to have a mechanism in place in which such a wage can be utilized across the board. If we just come up with a law stipulating that right now, it would likely be disastrous.  I believe it is something we ought to be fighting for in the future and something we should be arguing for, but that is why I support a millionaire's tax.", "parent_id": 417221, "user": "aeturnus", "published": 1322080292395, "downs": 1, "karma": 0, "id": 417668, "ups": 1}, {"content": "Poor people were held captive by overpriced goods in small stores/corner stores.  Toilet paper is a human dignity all should be able to afford.  I would poll the people who are shopping in Walmart to see what they want.", "parent_id": 417471, "user": "pinker", "published": 1322080332591, "downs": 0, "karma": 4, "id": 417672, "ups": 4}, {"content": "\"the amount the shopper saves\", you must mean the CASH amount as your standard of value. Perhaps there is a human value that both CEO and  mopper share equally that is beyond any price or dollars saved by any shopper. Are your children just little \"shopper saver machines\". Gosh, are we all just \" shoppers now?  Shit, better get my bag and head to the store because right now I am just being not shopping. When money inserts itself into even the definition of persons much less into their value as persons it has overstepped its bounds. I mean really when you played Monopoly were you really just a little piece on someone's board?  Was the winner really the most valuable kid? People invented money and the game of Monopoly. Ask two more questions.", "parent_id": 417340, "user": "dealdoctor", "published": 1322080430056, "downs": 0, "karma": 4, "id": 417681, "ups": 4}, {"content": "I was thinking they might not want to confront people so poor they camp outside Walmart to get a computer.", "parent_id": 417569, "user": "pinker", "published": 1322080460391, "downs": 0, "karma": 2, "id": 417685, "ups": 2}, {"content": "Fatherlenin was a little over the top, but I mainly agree. I'm poor as hell (oh, and I mean poor), and I don't eat food from Wal-Mart. I hardly ever go there. I try and make it to our local 'Wal-mart' Homeland before they close. \n\nYes, they are more expensive. Half the store now days is on sale at any given time, though, and what's on sale makes it as cheap (or even cheaper!) than Wal-mart. Just buy what's on sale, you can even eat organic this way, without spending anymore. Don't think it limits you either... out of half the store there will be something you would like to eat. My husband picks his cereal that way. :) So really, it's like I spent $5 to not have to go to Wal-mart.", "parent_id": 417455, "user": "IamMamaCas", "published": 1322080433016, "downs": 0, "karma": 2, "id": 417683, "ups": 2}, {"content": "Unfortunately, some of the people who work as stockers are people I would not want to be making decisions that affect the store. Just let them put the soup cans on the shelf.", "parent_id": 417634, "user": "HarryPairatestes2", "published": 1322080566436, "downs": 1, "karma": 1, "id": 417690, "ups": 2}, {"content": "You should also be protesting at your pension plan. Most of the stockholders are pension plans. Your retirement pay is funded by the profits of Walmart.", "parent_id": 419680, "user": "HarryPairatestes2", "published": 1322103466516, "downs": 1, "karma": 1, "id": 419770, "ups": 2}, {"content": "How about UNoccupying Walmart -- that is encouraging everyone everywhere NOT to go there on Thursday or Black Friday. You may gain special support on Thursday because many people find it distasteful that Walmart and others are now pushing their Black Friday sales up to Thursday, which requires their workers to be there on Thanksgiving just to make another buck. For a LONG time, people have been bothered that Christmas gets closer to Thanksgiving every year. This year Home Depot and others were putting out Christmas decorations before it was even Halloween! Now Walmart is starting it's Black Friday sale on Thursday -- Thanksgiving.\n\nThis runs is the exact opposite manner of the wishes of people in the OWS movement. It is even more rampant commercialism that is happening on a level that MOST Americans can readily join you in boycotting,\n\nSO, UNOCCUPY WALMART ON THANKSGIVING. BOYCOTT IT. SPREAD THE NEWS FOR EVERYONE TO AVOID THEIR THANKSGIVING-DAY SALES COMPLETELY AND TO SHOP ELSEWHERE ON BLACK FRIDAY AS PUNISHMENT FOR THEIR GREED IN TRYING TO USURP A NATIONAL HOLIDAY FOR THEIR CORPORATE GREED.\n\n--KnaveDave\nhttp://TheGreatRecession.info/blog", "parent_id": null, "user": "KnaveDave", "published": 1322080643173, "downs": 1, "karma": 1, "id": 417696, "ups": 2}, {"content": "Workers should be paid fair market value. End of discussion. If you've ever studied economics or finance you'd understand. Educate yourselves, people.", "parent_id": null, "user": "patg911", "published": 1322103562767, "downs": 0, "karma": 1, "id": 419776, "ups": 1}, {"content": "Shut them all down!! We don't need no WalMarts!!", "parent_id": null, "user": "FreedomIn2012", "published": 1322103650814, "downs": 0, "karma": 1, "id": 419784, "ups": 1}, {"content": "Im serious. I never said no one should work.I worked many a holiday,including TG and Xmas. Hospitals workers ,police officers,government workers have always worked on holidays.  They are much needed. But consumerism on a national holiday..Thanksgiving at that is NOT  a necessasity.\nMacys,Walmart ,Target and franchise supermarkets are not only taking advantage of their low wage workers,but the American public as well(if we let them). Boycott! The big boxes  have now crossed the line.", "parent_id": 417598, "user": "MiMi1026", "published": 1322103670651, "downs": 0, "karma": 1, "id": 419786, "ups": 1}, {"content": "The value of labor is a cash (or barter) value.\n\nHuman worth is seperate. However, the virtue of being human does not give you permission to demand sustenance from me. I am not your slave.", "parent_id": 417681, "user": "Danimal98367", "published": 1322080838973, "downs": 2, "karma": -1, "id": 417712, "ups": 1}, {"content": "How many people are aware that Walmart was one of the major forces that sent American jobs to China and that China has over 5 million prison slave workers? This is a must see video:\nhttp://www.aljazeera.com/programmes/slaverya21stcenturyevil/2011/10/2011101091153782814.html", "parent_id": null, "user": "eeverett", "published": 1322076967823, "downs": 2, "karma": 1, "id": 417363, "ups": 3}, {"content": "This is EXACTLY why I'm quitting this shithole. Walmart doesnt care about employees, only profits. Its a shame that americans cant see Walmart for what it REALLY is.. the greedy money machine that has NO sympathy for its employees rights, health or needs. (Customers included) Occupy ALL Walmart's around the country and all over the world!!!! SOLIDARITY!!!!!", "parent_id": null, "user": "Dramatica", "published": 1322103844439, "downs": 0, "karma": 2, "id": 419802, "ups": 2}, {"content": "When you write that Wal-Mart is making an effort \"to buy our legislative process\" you misrepresent \"our\" legislative process since you are certainly talking about Congress. Congress doesn't use the money we send it for \"us\". Instead, since the Constitution says it has power to \"regulate Commerce...among the several States\", it is not obligated to use taxes exclusively for national purposes as do all other states in the world. It votes money where it sees fit and it has so much money from our taxes that corporations are drawn to it like flies to a huge pool of honey. You should ask why we have no legislative process in Washington working directly to support our national interest as do all other national legislatures. That is the main problem. Corporate influence is an important problem but it is secondary. Daniel McNeill usoftheworld.com", "parent_id": null, "user": "usoftheworldcom", "published": 1322081267283, "downs": 2, "karma": -1, "id": 417749, "ups": 1}, {"content": "I got a walmart down the street from me and refuse to shop there after I saw a documentary on PBS. Also women were not paid equally. There was a class action suit against walmart that was thrown out this year.I kicked walmart to the curb. I support small businesses.", "parent_id": 417363, "user": "MiMi1026", "published": 1322104392377, "downs": 0, "karma": 1, "id": 419841, "ups": 1}, {"content": "You need to seperate human worth from effort worth. They are very different.", "parent_id": 417654, "user": "Danimal98367", "published": 1322080968488, "downs": 1, "karma": 0, "id": 417724, "ups": 1}, {"content": "If you do not like Wal Mart,  don't shop there.  Or don't work there.  If a person stocks the store,  why should he/she make more than $8-10 per hour?  Does not take skill.  Does not take brains.  Would be better to go to school or join the military.", "parent_id": null, "user": "mandodod", "published": 1322080973643, "downs": 3, "karma": 0, "id": 417725, "ups": 3}, {"content": "FINALLY!", "parent_id": null, "user": "ronimacarroni", "published": 1322080994553, "downs": 1, "karma": 1, "id": 417727, "ups": 2}, {"content": "Proof you are now run by New York Communities for Change and are a tool for the unions.  I thought OWS actually had some new ideas.", "parent_id": null, "user": "conservative4change", "published": 1322081492529, "downs": 1, "karma": 0, "id": 417766, "ups": 1}, {"content": "i wrote an article on occupy. I wanted to get some feedback on it.\nI initially went into it with a pretty negative outlook on the protestors, but i kind of changed my mind half way through:\nhttp://greatcreditscore.org/economy/occupy-wallstreet/\n\nOur economic problems are directly caused by banks selling their \"bad mortgage debts\", as good debt. The credit rating agencies that gave this bad debt, triple A ratings made a ton of cash, as did the banks. While we got left to pay the bill.\n\nIf this movement is about preventing financial companies from cuasing economic problems, then i totally support it. But i don't really like how negative energy seems to be directed at all wealthy people.", "parent_id": null, "user": "ross777", "published": 1322080688499, "downs": 1, "karma": 0, "id": 417700, "ups": 1}, {"content": "You see that the only way to control the Walmarts and Woolworths of the world is to not shop there first off.After you stop shopping at those places then use your power of VOTE at the next election.The break up of the two party political stranglehold in Australia has seen a more moderate government in this term so far with the present one bringing in a  Mining Tax on Big Corporation.Vote for your Independent Candidate,change is possible through the polls.I understand that protests are needed when the system is rotten(I marched against the rotten Vietnam War and the Apartheid in South Africa}but the strongest power the 99% have is their VOTE.Use it or you will lose it.", "parent_id": null, "user": "Bighead1883", "published": 1322081630107, "downs": 1, "karma": 0, "id": 417773, "ups": 1}, {"content": "Plot or no plot,  the Post Office really needs to clean up.  Really,  way too many folks.  Email and bill pay has changed things. Just do not need a zillion post office folks any longer. They get paid a ton and have better healthcare than the regular feds.  By far!  And the redular Fed workers have really good healthcare. I'm not kidding about the junk mail.  I know that is how they make money but it is still junk mail!!!!!  Huge layoffs are coming soon to a neighborhood near you.  Happy Thankgiving.  Time to prep dinner for tomorrow.", "parent_id": 419385, "user": "mandodod", "published": 1322098682329, "downs": 1, "karma": 0, "id": 419417, "ups": 1}, {"content": "How could you possibly compete with a company with that kind of buying power? Plus it isn't like your going to get a loan from any of the bailed out mega banks.\n\nBetter option is to start a union organizing campaign at Walmart; but to do that, we'll first have to take back our government because they've spent 50 years basically gutting worker's rights.", "parent_id": 417488, "user": "alexrai", "published": 1322081957979, "downs": 0, "karma": 2, "id": 417794, "ups": 2}, {"content": "14.3 billion in profits / 2.1 million employees ~ $7,000 per year ~ $3.5/hour\n\nThat's a pretty decent pay raise.\n\n[edit: that calculation assumes a 40 hour work week, since a lot of employees are part time the actual hourly wage increase might actually be higher...]\n\n[edit 2: $8,990 / 2.1 million employees is less than a penny an hour wage increase if the CEO worked for nothing, so the CEO's pay isn't really a big issue here]", "parent_id": 417104, "user": "meep", "published": 1322081966176, "downs": 0, "karma": 1, "id": 417795, "ups": 1}, {"content": "Thanks. I pay little attention to profanity attacks and what not. But I wasn't really referring to that in calling this a not-so-user-friendly website. I find it very hard to search for specific posts on this site. So you basically have to read through all the stuff to find things that are most interesting.", "parent_id": 417779, "user": "aeturnus", "published": 1322082026505, "downs": 1, "karma": 1, "id": 417802, "ups": 2}, {"content": "So fuck progression, that was so last century.", "parent_id": 417766, "user": "JProffitt71", "published": 1322082078167, "downs": 0, "karma": 1, "id": 417805, "ups": 1}, {"content": "Due to the fact that my husband works too...its none of your business.", "parent_id": 419823, "user": "MiMi1026", "published": 1322104814900, "downs": 0, "karma": 2, "id": 419869, "ups": 2}, {"content": "Well, that is not how I think. Making decisions that affect the store ought to be done by consensus or some sort of voting mechanism. I'm talking about a couple of jobs. If you prove good at those, you can do some other different things. It's a thought derived from trying to balance out wage scales, really.", "parent_id": 417690, "user": "aeturnus", "published": 1322082167139, "downs": 1, "karma": 1, "id": 417813, "ups": 2}, {"content": "Remember, at that income level they stand a good chance of getting state and/or federal tax refunds come April 15.", "parent_id": 417447, "user": "HarryPairatestes2", "published": 1322082350963, "downs": 1, "karma": 0, "id": 417826, "ups": 1}, {"content": "In 1985 I worked in a Wal-Mart distribution center. I hated the way we were treated like criminals by loss prevention, and found a really cool way to \"strike\" back. I knew how anti union Wal-Mart is - they made sure we all knew their positions on unions. I began writing such things as \"We need a union. Working conditions are terrible!\" on slips of paper, and dropping those slips of paper into openings in large boxes, like for TVs or other appliances. The openings where you put your hands to lift a box were perfect. It wasn't long before some of the slips were discovered and Wal-Mart sent down a team to deal with the \"crisis\". They have a psychologist on their anti union staff! Every single employee was interviewed. I'm sure they tried to match up the handwriting but I had printed neatly with large Magic Markers that bled a little. In the end they installed a few new fans in that non air-conditioned facility where temps went well over 100 degrees. They fixed a few holes in the floor that were a safety hazard for forklifts. That was about it.  \n\nSo that was my moment of glory while employed by the evil Wal-Mart beast. I bet it would work again...", "parent_id": null, "user": "damascus", "published": 1322100027923, "downs": 0, "karma": 3, "id": 419522, "ups": 3}, {"content": "Slaves did not have a choice regarding their \"employment.\"  Workers at Wal-Mart are free to find another job anytime they want.", "parent_id": 417731, "user": "HarryPairatestes2", "published": 1322082507469, "downs": 3, "karma": -1, "id": 417846, "ups": 2}, {"content": "Everyone deserves decent pay for a hard day's work, regardless of how \"skilled\" it is perceived to be.", "parent_id": 417630, "user": "XenuLives", "published": 1322082525234, "downs": 0, "karma": 2, "id": 417848, "ups": 2}, {"content": "How about we continue to pay the price that the market will bear, regardless of how much people are earning. You will see a minor price bump on some products, but not on all of them. The increase in quality of life for a large amount of Americans more than makes up for any minor price change that could come from this.\n\nBig Macs still cost $2.59 for millionaires as they do for everyone else.", "parent_id": 417625, "user": "XenuLives", "published": 1322082847382, "downs": 1, "karma": 2, "id": 417872, "ups": 3}, {"content": "Those monies go to help the 99%\n\nWalMart?  Not so much.\n\nWhy do you HATE unions?", "parent_id": 417866, "user": "shooz", "published": 1322082886133, "downs": 0, "karma": 2, "id": 417877, "ups": 2}, {"content": "Does that include part time workers having a say on how the business is run?\n\nI think what people are missing is that being a stocker at Wal-Mart should not be considered a career. It is a job that was never created to be one a person is going to have for 20 years and support a spouse and kids, save for college, etc.\n\nIt is the same kind of job you get in high school at the local clothing store, fast food joint, or car wash. Earn some money while you improve yourself for a better job.\n\nBut in the past few years the argument is being made that these low level unskilled jobs should be equivalent to skilled jobs and earn equal pay.  Really?", "parent_id": 417813, "user": "HarryPairatestes2", "published": 1322082871875, "downs": 0, "karma": 2, "id": 417876, "ups": 2}, {"content": "My original Christmas song \"Synthetic Xmas\" that is PERFECTLY in-line with this kind of protest. Support independent art. Thank you.\n\nhttp://kinggod.bandcamp.com/ \n\nKeep it peaceful, make them laugh, make them think.", "parent_id": null, "user": "wearehumanpeople", "published": 1322082975011, "downs": 0, "karma": 1, "id": 417887, "ups": 1}, {"content": "Perceived to be?  How much skill is involved in putting t-shirts on a shelf or sweeping a floor?", "parent_id": 417848, "user": "HarryPairatestes2", "published": 1322083012872, "downs": 1, "karma": 1, "id": 417889, "ups": 2}, {"content": "For the people who have these jobs as their ONLY options, yes. \n\nNot everyone needs, or has the means, to go to college and get a \"skilled\" job. These people are Americans too. Do they not get to earn a decent life for themselves?", "parent_id": 417876, "user": "XenuLives", "published": 1322083070100, "downs": 1, "karma": 2, "id": 417899, "ups": 3}, {"content": "If you stand with the unions you are a hypocrite.  Plain and simple.  They give millions to the DNC.  You hate it when corporations give to politics.  What is the difference.   There is no difference.   It is all the same.  That is the number one thing you want to stop.  The DNC is politics!!!!", "parent_id": 417877, "user": "mandodod", "published": 1322083068993, "downs": 2, "karma": -1, "id": 417898, "ups": 1}, {"content": "The Rockefellers are richer than the Waltons.", "parent_id": null, "user": "Var", "published": 1322083114943, "downs": 0, "karma": 1, "id": 417901, "ups": 1}, {"content": "There is a huge difference in the amount of monies given and how it is accounted for.\n\nLike I said, those monies are given to help the 99%.\n\n\nNow, will you answer my question?\n\nWho do you HATE unions?", "parent_id": 417898, "user": "shooz", "published": 1322083241178, "downs": 0, "karma": 2, "id": 417910, "ups": 2}, {"content": "So you are another one of the defeatest group who love to say \"it can't be done\"\nHave you no concept of what history can teach, do you know that history exists.\nWho do you think that WalMart put out of business (for all practical purposes) before they rose to the top.\nGo down another layer of history - where is your local Woolworths' Store in your town?  Was there one there at one time, almost every town in the country had one.\n\nalexrai - somewhere out there in your great land of oz, there echos the same question that K-Mart asked about Woolworths, and WalMart asked about K-mart.  \"How could you possibly..........\"\n\nBy the way, that question has already been asked regarding WalMart and it has been answered by Alco, Family Dollar, BigLots and any of a dozen other retail giants.  And my guess is that someone, somewhere is still asking the question, \"How could I possibly.\"\nThe difference is \"you\" and \"I\" so far as this part of the American Dream is concerned.\n\nIf your American Dream has turned into a long nightmare you might check what you have been eating, or better yet, what you have been FED before you turn off the lights tonight.\n\nAlong with all of this, check to see which companies were union companies and how that change worked out for them.\n\nAnd if it will lift your spirits a little, WalMart represents ONLY 8% of US retail sales.  Kinda a 92% vs the 8%  dragon.\n\nSleep well, and whatever you do, buy K-Mart you will be supporting union jobs.", "parent_id": 417794, "user": "ronjj", "published": 1322082900781, "downs": 0, "karma": 1, "id": 417880, "ups": 1}, {"content": "It doesn't matter how much skill it takes to do those tasks. Those people deserve to have decent pay for doing the work, period. \n\nSmall businesses are hurt from a minimum wage increase, yes. I agree on that. However, there is nothing stopping this wage increase to coincide with an increased tax break for these businesses, or other programs that would use our taxpayer money to help out the local community businesses instead of bailing out \"too big to fail\" banks. These things are bundled into bills all of the time.", "parent_id": 417889, "user": "XenuLives", "published": 1322083462196, "downs": 1, "karma": 2, "id": 417936, "ups": 3}, {"content": "That guy is the worst (best) example of what a true hypocrite is all about. He became rich out of complaining about the riches. Still, some people are so unable to think for themselves that they need him, which is why he is able to sell his stuff in the first place. Anyone who compares who he is with who he criticizes will realize they were fooled very bad.", "parent_id": 417246, "user": "tryingheretoo", "published": 1322083567339, "downs": 1, "karma": 0, "id": 417952, "ups": 1}, {"content": "Never shop at Walmart.  Never ever ever set foot inside.", "parent_id": null, "user": "Edwin", "published": 1322083600438, "downs": 0, "karma": 3, "id": 417955, "ups": 3}, {"content": "Wal-Mart is making good money, yes.  But they also have $43 billion in loans to repay, still.  Sometimes you get in trouble if you focus on one thing, like income.", "parent_id": null, "user": "Joseph031", "published": 1322083651582, "downs": 0, "karma": 1, "id": 417962, "ups": 1}, {"content": "A lot has happened since the early 1960s. Globalization being one of those things, if it was once possible to start a big box retail chain by saving up money at a minimum wage job, or asking a kind banker for a loan. Those days ended long ago.\n\nIt might be possible to see a venture capital company, but I bet the first question they ask is: How can you compete with Walmart? They have options on all the prime retail space around cities, and they have massive economies of scale, and sophisticated logistics systems which no startup can compete with. Again, different than the 1960s.\n\nIncidentally: Alco by the look of things started in 1901, went Chapter 11, and was refinanced with GE. Not exactly an American Dream story.\n\nYou sound like a real union hater, but hey; Businesses get the unions they deserve. If Walmart did not treat its employees like crap, it would not have to bribe politicians to get rid of labour laws.\n\nOh and please visit Vancouver some day; they did not allow Walmarts until very recently, and guess what? There are tons and tons of small little shops which compete with each other, and prices are as good if not better than Walmart. There are also tons and tons of small merchants living the Canadian dream, instead of a few fat cat executives making Millions of their under payed workers and small Chinese children.", "parent_id": 417880, "user": "alexrai", "published": 1322083657657, "downs": 0, "karma": 3, "id": 417963, "ups": 3}, {"content": "You left out Walmart's systematic discrimination against women, and the right-wing activist Supreme Court's dismissal of the class action suit.", "parent_id": null, "user": "piewackett1", "published": 1322084010268, "downs": 1, "karma": 3, "id": 418009, "ups": 4}, {"content": "BF needs to be a day of educating people.\n\n**Remind them of the banker bailouts** that pissed them off in 2008.", "parent_id": null, "user": "Var", "published": 1322105973025, "downs": 0, "karma": 1, "id": 419961, "ups": 1}, {"content": "[edit 3: the question was what if they didn't spend $4.3 million on political contributions and lobbying . . . $4.3 million / 2.1 million employees is $2.05 a year . . . or 1/10 of 1 penny per hour.]", "parent_id": 417795, "user": "Danimal98367", "published": 1322084114190, "downs": 0, "karma": 1, "id": 418024, "ups": 1}, {"content": "you are stupid, Wally World needs to give the workers some free insurance.", "parent_id": 417985, "user": "USCitizenVoter", "published": 1322084157918, "downs": 0, "karma": 2, "id": 418028, "ups": 2}, {"content": "Fantastic idea. New ripples to the Occupy theme will only make the movement stronger and harder to contain by the elite. I believe one of the important themes of the movement is the way workers are treated by their employers and how this relationship deteriorates as the economy continues to sink. Taking the movement to one of the country's largest employers is a great way to deliver the message on a big stage and create a nationwide conversation on this topic. \n\nTo all the Tea Partiers Out There: The government has to subsidize the Wal Mart workforce with finanical and medical aid because Wal Mart doesn't pay them anything! Just thought you might be interested in that.\n\nClosing Point:\n\nMichael Corleone once said to, \"Keep your friends close, and your enemies closer.\" Well this is where Mr. Bloomberg made a huge mistake in dispersing the park encamptment. Now he has protestors all over the city ready to occupy different parks, buildings, and companies at any given moment. Having the protestors in one predictable spot would have allowed him to monitor their activities and block their moves before they happened. These new tactics will prove much harder to stop and will make the movement much more fluid and effective.", "parent_id": null, "user": "PatriotMissiles", "published": 1322106144114, "downs": 0, "karma": 2, "id": 419969, "ups": 2}, {"content": "this is why my family and i never have shopped at walmart.", "parent_id": null, "user": "dawnduffy", "published": 1322084318509, "downs": 0, "karma": 3, "id": 418057, "ups": 3}, {"content": "If you work at Walley World then you must feel like your working on a Chain Gang. I feel sorry for you and I hope that some other jobs open up for you. Good Luck to you all.", "parent_id": null, "user": "USCitizenVoter", "published": 1322084508898, "downs": 0, "karma": 3, "id": 418080, "ups": 3}, {"content": "Are you really trying to compare working at Wal-Mart to slavery?", "parent_id": 417731, "user": "occupyyourself85", "published": 1322084728796, "downs": 0, "karma": 2, "id": 418103, "ups": 2}, {"content": "I have a friend who works full-time unloading trucks at Wal*Mart. He has a fiancee and a 2-year-old child to take care of at home. The fiancee is jobless despite searching for who-knows-how-many months now. He WOULD go back to school, except that taking care of a child while still holding down that full-time job takes up all of his time. He also doesn't have any money after bills to pay the bloated tuition that the college system wants to charge him. \n\nLoans? People in his shoes don't have the luxury of owning a credit card, new car, or any other \"traditional\" source of credit. He will not get qualified for anything, much less a huge student loan that his family wouldn't be able to pay back anyhow.\n\nMy friend and his family will be homeless if he loses that job. If his pay gets cut then he will fall behind on bills, eventually leading to the same conclusion. Basically, his entire well-being is in the hands of a large corporation that doesn't give two shits about him. \n\nSome people don't have a choice. Are we not humane enough to ask that these people have at least a decent wage?", "parent_id": 417998, "user": "XenuLives", "published": 1322084751739, "downs": 1, "karma": 1, "id": 418105, "ups": 2}, {"content": "Yes.", "parent_id": 417630, "user": "GarnetMoon", "published": 1322107001085, "downs": 0, "karma": 1, "id": 420033, "ups": 1}, {"content": "I recall the times not so long ago that  One Person's Salary would feed and clothe a family, make a home and buy the House to keep it all in whilst running a car.\n\nWhere did it go wrong?\n\nThere is a Solution.\n\nStop Spending and make Frugality an Artform", "parent_id": null, "user": "devilliers123", "published": 1322084860350, "downs": 2, "karma": 0, "id": 418119, "ups": 2}, {"content": "Totally agreed. This person saying he hates them yet buys from them is simply hypocrite no matter what the excuse is. The price difference is not that great, not if you talk about food for that matter. Of course, if his agenda includes cheap electronics, than it's a hole other issue, but then the claim of hating becomes even more hypocrisy.", "parent_id": 417683, "user": "tryingheretoo", "published": 1322085000669, "downs": 0, "karma": 2, "id": 418136, "ups": 2}, {"content": "Sweet , you should project the movie High cost of low prices on the wall.", "parent_id": null, "user": "jcrocker", "published": 1322085010350, "downs": 0, "karma": 1, "id": 418139, "ups": 1}, {"content": "Nope,  that will not answer the question.   You are a hypocrite.  Can't have it both ways.  Why should unions take from republican workers pockets and give to the DNC without asking them?   Do you think that is fair?  Do you think that folks should have to be in a union?  There is no difference,  big money to the tune of millions to the DNC.   You do not have a brain.", "parent_id": 417910, "user": "mandodod", "published": 1322085347822, "downs": 1, "karma": 0, "id": 418176, "ups": 1}, {"content": "I agree with your link and would like to say this. \nLets fire them all through each election.  Let our public servants know that the party is over.  Elect a candidate the will support and really pay attention to this word \"FOR\"  The Constitution For the Unites States.  This is the Constitution for the Republic of the United States of America.  The Word \"of\" is for the incorporated United States.  Two different documents.\nAny public servant that does not support this change should not be ellected, period.\nWhen this occurs all your all will be restored as our Fathers had intended.\nand we all will be SOVEREIGN again as it was designed to be.", "parent_id": 417187, "user": "farmerjohn", "published": 1322107729997, "downs": 0, "karma": 1, "id": 420085, "ups": 1}, {"content": "Go, go, go!!!", "parent_id": null, "user": "isupportoccupywallstreet", "published": 1322085445370, "downs": 0, "karma": 1, "id": 418188, "ups": 1}, {"content": "Anyone who knows anything about Sam Walton would say that he was a man that worked hard but also worked smartly! I for one believe in the American Free enterprise system. If you work hard, smartly and you are motivated to become successful, The USA is the best place on earth. I have seen many of you complain about student loans; but many of you went and got degrees in English, Philosophy and the like. These were decisions that you people made. These types of degrees are very easy to get but do not offer and potential employer much to work with. The fact that you made bad choices isn’t my fault. I work hard and pay lots of taxes. I’m not a 1%’er  but most like in the top 30 Percent of American citizens. If you want something you have to work for it. Most importantly, you need to understand, Communism and Socialism are hard working people’s nightmare and slackers / bum’s dreams come true! In Communism and Socialism, there is no incentive and therefore people work only as hard as least productive person resulting in NOTHING getting done!", "parent_id": null, "user": "Benzobug", "published": 1322085451051, "downs": 0, "karma": 1, "id": 418190, "ups": 1}, {"content": "Problem with protesting on privately owned property...it is only allowed if the owner allow it! Walmart is private and generally located on private property.", "parent_id": null, "user": "mannysmom", "published": 1322085505819, "downs": 0, "karma": 1, "id": 418195, "ups": 1}, {"content": "I'm for boycotting walmart permanently. You'll never get another red cent from me walmart.", "parent_id": 418157, "user": "USCitizenVoter", "published": 1322085540171, "downs": 0, "karma": 2, "id": 418198, "ups": 2}, {"content": "2011 and you are just getting around to viewing a video on slave workers?.  Were we not at one time, slaves to England, how about Mexico, Malyasia, Taiwan, Japan, India, have they not been slaves to us world at one time or another.\n\nThe Chinese will throw off the \"slave worker\" concept in a short period of time AND when you wake up, YOU will be the slave to those workers, because you will no longer be able to produce your own clean underwear.\n\nIf you are not aware of this truth - check the LG refrigerator in the store and compare it to Sears Elite line (same manufacturer) and top of the line - now who is the slave??\n\nBeen admiring those new KIA vehicles.  Sky rocketing in quality and value.  Welcome to slavery at its finest.\n\nDummies of the world are not confined to WalMart corporations.  If you have too, climb to the top of a mountain and get a view of what the world is really about.", "parent_id": 417363, "user": "ronjj", "published": 1322085622431, "downs": 0, "karma": 1, "id": 418211, "ups": 1}, {"content": "Bring back New Coke!", "parent_id": 419634, "user": "occupymybutt", "published": 1322107904312, "downs": 1, "karma": 0, "id": 420101, "ups": 1}, {"content": "Surely he refers to the CEO as some magical being who can make super market decisions that no other human is capable of even understanding, never makes mistakes, never looks stupid asking the help of the government, never gets his money from abusing slave workers abroad (as if that was a hard decision to make) and therefore deserves his pay for he is super important and irreplaceable. What is rather puzzling is that this ranting guy is definitively not the CEO nor does it look like he is line to become the next.", "parent_id": 417305, "user": "tryingheretoo", "published": 1322085648663, "downs": 0, "karma": 4, "id": 418216, "ups": 4}, {"content": "So this is where the communist hang out. What is your alternatives? Collapse the American capitalist system? Transfer power from the hands of the corporations to the hands of the government/party leaders? How well has that worked out for China? N. Korea? Cuba? \n\nYou kids are clueless. Without these \"evil\" corporations, you'd be living like real peasants, except you wouldn't have your laptops, your Kindles, your iPhones, and iPods and your asses would be working in some cesspool of a state run factory or farm 16 hours a day, trying to provide food for the millions of people the government is trying to provide for, all the while, the party leaders would be living just like the corporate CEO's you hate so much. And if you dared even try to \"protest\" or \"occupy\" anything, you'd be run over by tanks, or rounded up and shot, or thrown into prison/work camps for the rest of your lives.\n\nGo ahead and protest against a system you hate, but still allows you voice your hate without retribution. Go ahead and hate Walmart, but please turn in your iPhones and other gadgets you are using to communicate and organize the proletariat and take down this website (hosted by an evil corporation no doubt and do it grassroots style...hand out pamphlets on the street corners.", "parent_id": null, "user": "fatherlenin", "published": 1322077774123, "downs": 5, "karma": -3, "id": 417449, "ups": 2}, {"content": "I'm sorry but the corner store does not happen to have the purchasing power of wallmart.  It has an overhead just like you and i do in our daily lives. He has to purchase it at a higher price and mark it up accordingly.  That's the convenience of you going to the corner and not driving 5 miles to get to wallmart.  He makes the investment and puts everything on the line so you can go to the corner and buy what you need.", "parent_id": 419120, "user": "farmerjohn", "published": 1322108498798, "downs": 0, "karma": 2, "id": 420168, "ups": 2}, {"content": "Dont forget the \"Dead Peasants\" Insurance Wal-Mart puts on its employees so they benefit if any of their employees die.", "parent_id": null, "user": "Pennybags", "published": 1322086200488, "downs": 0, "karma": 3, "id": 418274, "ups": 3}, {"content": "A firm does not \"make\" you pay for health care anymore than they make you pay for bananas or automobiles.  Health care is something that some companies choose to add in to a compensation package.  It is amazing that you think they should be FORCED to do this; I'm actually nearly speechless.\n\nHealth care should be purchased on the open market, just like automobile insurance.  Companies could provide voucher payments towards this if they CHOOSE to do so.", "parent_id": 417747, "user": "FreeMarkets", "published": 1322086650873, "downs": 0, "karma": 1, "id": 418310, "ups": 1}, {"content": "Exactly!", "parent_id": 418625, "user": "cmt", "published": 1322089680502, "downs": 0, "karma": 1, "id": 418631, "ups": 1}, {"content": "Are you serious?  the people hired at Walmart have no other job choices?? If you believe that to be true, then isn't Walmart doing a good thing for the community by hiring these otherwise unemployable people?", "parent_id": 418403, "user": "HarryPairatestes2", "published": 1322089759261, "downs": 2, "karma": 1, "id": 418638, "ups": 3}, {"content": "I started a business with no capital, My dad started his with $5.33 about 15 yrs ago. ( I killed mine, didnt like the work, so we will talk about my dads) Why should my dad's employees have a say in how he runs HIS business which he is liable for and has to manage? By the very definition of democratically run workplaces, There can be no boss, so who would take the risk of starting a business?", "parent_id": 417411, "user": "jdnreha", "published": 1322090739737, "downs": 0, "karma": 3, "id": 418721, "ups": 3}, {"content": "We not only need separation of church and state. But we need separation of corporation and state.", "parent_id": null, "user": "Cjoy77", "published": 1322090972765, "downs": 0, "karma": 2, "id": 418744, "ups": 2}, {"content": "There not evil. Some magical guy deemed it. or did you not get the memo?", "parent_id": 418512, "user": "jdnreha", "published": 1322091387062, "downs": 0, "karma": 1, "id": 418790, "ups": 1}, {"content": "You're moving the goal posts. The question was \"HARDER\" nothing else.", "parent_id": 417340, "user": "agnosticnixie", "published": 1322092178446, "downs": 0, "karma": 2, "id": 418861, "ups": 2}, {"content": "What a stupid waste of time that was. No wonder you're a part of OWS, you guys are used to wasting time and complaining about how everyone else has it better than you.", "parent_id": 418773, "user": "LarsBorsch", "published": 1322094286697, "downs": 0, "karma": 1, "id": 419063, "ups": 1}, {"content": "Sorry, I'm old that's what they used back when I cared. So lay off the Red Bull then.\n\nCorporations give billions.  Plus all the think tanks, front groups, astro turffer's, marketing/PR firms, etc.  Unions can't touch that, and you know it.\n\n \n\nYou're the hypocrite.\n\n\nHave you been drinking the RupertRush juice again?", "parent_id": 418974, "user": "shooz", "published": 1322094450986, "downs": 0, "karma": 3, "id": 419074, "ups": 3}, {"content": "Union members are the 99%.\n\nTheir organizations are democratic.\n\nNot so with corporations.\nThey are tyrannical.\n\n\nWhy do you support tyranny?\n\n\nNo difference between zillions and millions?\nI suppose you're pissed about the budget deficit.\n\nAnd you call me a hypocrite?", "parent_id": 419104, "user": "shooz", "published": 1322095572062, "downs": 0, "karma": 3, "id": 419167, "ups": 3}, {"content": "Why didn't you just have the Mexicans do it?", "parent_id": 417558, "user": "puff6962", "published": 1322096967783, "downs": 1, "karma": 1, "id": 419278, "ups": 2}, {"content": "Unions are corrupt.  Thay give money from union dues to the DNC.  Without even asking.  They give big money to big politics.  To the tune of millions.  You are a hypocrite. You are a fake.  Can't have it both ways.  Can't say corporations are evil and say it's OK for the unions to give to the DNC.   Plain and simple.  Plain and simple.", "parent_id": 419279, "user": "mandodod", "published": 1322097950811, "downs": 2, "karma": -1, "id": 419357, "ups": 1}, {"content": "Wonderful", "parent_id": null, "user": "cJessgo", "published": 1322099203843, "downs": 0, "karma": 1, "id": 419466, "ups": 1}, {"content": "NO, exactly how much more could they pay their workers??", "parent_id": 417104, "user": "ronjj", "published": 1322074402029, "downs": 5, "karma": -3, "id": 417125, "ups": 2}, {"content": "Have the Walmart workers agreed to this? Did they have a chance to decide through consensus if they wanted three Occupy factions to come in and occupy their store, and, in so doing, risk their jobs? Or, is this something Occupy decided all by themselves?", "parent_id": null, "user": "Thrasymaque", "published": 1322074638920, "downs": 6, "karma": 1, "id": 417143, "ups": 7}, {"content": "This is the same Walmart that employs thousands of low-skill workers in rural and small-town areas?", "parent_id": null, "user": "cityrep", "published": 1322074704002, "downs": 0, "karma": 1, "id": 417152, "ups": 1}, {"content": "When I was working at Wal Mart I tried to gather interest in a union. No one wanted any part of it because they are too afraid of being fired. Apparently, Wal Mart has a private team of union breakers that are deployed to any store where mention of a union reaches management's ears. Occupy the crap out of them. They are the epitome of evil empire.", "parent_id": null, "user": "Daniel1984", "published": 1322099949973, "downs": 1, "karma": 1, "id": 419517, "ups": 2}, {"content": "ESWA did a study several years ago and found that a \"minimum living wage\" was about $24.00/hr. This is in the Northeast...", "parent_id": 417221, "user": "GarnetMoon", "published": 1322076186076, "downs": 0, "karma": 4, "id": 417284, "ups": 4}, {"content": "Why doesn't this event start earlier?  Like 7am when the throngs are there?", "parent_id": null, "user": "pinker", "published": 1322076293468, "downs": 2, "karma": -1, "id": 417294, "ups": 1}, {"content": "YOU are free to create any type of business you want and run it that way.  Democratically run busniesses sound great to me, but I do not think businesses should be told how to structure their business.  I like your idea, but human nature is what it is.  It won't work - there will always be people who usurp power.  it's an animal instinct.", "parent_id": 417289, "user": "pinker", "published": 1322076708448, "downs": 3, "karma": 0, "id": 417337, "ups": 3}, {"content": "Sure, but that doesn't answer my question. Did the workers at this particular store have a say in the matter? I think that's important, no?", "parent_id": 417346, "user": "Thrasymaque", "published": 1322077306189, "downs": 1, "karma": 2, "id": 417399, "ups": 3}, {"content": "A song for OWS... http://www.youtube.com/watch?v=4FM3KR9dEOk", "parent_id": null, "user": "OWSMusic", "published": 1322101017899, "downs": 0, "karma": 1, "id": 419603, "ups": 1}, {"content": "My point exactly!! This is a great opportunity to give them a say!! Empower them by letting them decide instead of doing what WalMart does!! Teach by example!! Let them decide how the situation should be handled!! Ask them what Occupy can do to help!! Don't force an occupation down their throats like WalMart forces bad contracts down their throats!! Work with them!!", "parent_id": 417436, "user": "Thrasymaque", "published": 1322078188250, "downs": 1, "karma": 1, "id": 417490, "ups": 2}, {"content": "I don't shop there. Most of the poor around here do though. 100 bucks at walmart is120 bucks at the place across the street. Can't blame anyone for getting stuff there.", "parent_id": 419439, "user": "Farleymowat", "published": 1322101495762, "downs": 0, "karma": 4, "id": 419641, "ups": 4}]}